{
    "title": "Alien",
    "year": 1979,
    "genres": [
        "Horror",
        "Sci-Fi"
    ],
    "runtime": [
        "116"
    ],
    "rating": 8.5,
    "plot": [
        "In the distant future, the crew of the commercial spaceship Nostromo are on their way home when they pick up a distress call from a distant moon. The crew are under obligation to investigate and the spaceship descends on the moon afterwards. After a rough landing, three crew members leave the spaceship to explore the area on the moon. At the same time as they discover a hive colony of some unknown creature, the ship's computer deciphers the message to be a warning, not a distress call. When one of the eggs is disturbed, the crew realizes that they are not alone on the spaceship and they must deal with the consequences.::blazesnakes9",
        "In the distant future, during her return to Earth, the commercial spaceship Nostromo intercepts a distress call from a distant moon. The seven-member crew are awakened from hypersleep and the spaceship subsequently descends on the moon. While exploring the moon, a three-member team of the crew discover a derelict spaceship and a huge chamber inside her containing thousands of eggs. When a curious team member goes near the egg, the parasite inside the egg attacks him, rendering him unconscious. He is brought back aboard and the spaceship takes off. After a little while, the parasite dies and his host wakes up seemingly unruffled. Everything soon returns to normal - but not for long.::Soumitra",
        "After a space merchant vessel perceives an unknown transmission as a distress call, its landing on the source moon finds one of the crew attacked by a mysterious lifeform, and they soon realize that its life cycle has merely begun.::dimakorou"
    ],
    "language": {
        "id": [
            "English"
        ],
        "adult_language_percentage": 2.2095748242383664,
        "linguistic_difficulty_percentage": 0.06695681285570808,
        "words_per_minute": 51,
        "common_words": {
            "get": 69,
            "dallas": 61,
            "right": 57,
            "parker": 50,
            "ripley": 42,
            "lambert": 42,
            "come": 40,
            "ash": 37,
            "got": 33,
            "well": 31
        }
    }
}