{
    "title": "All the President's Men",
    "year": 1976,
    "genres": [
        "Biography",
        "Drama",
        "History",
        "Thriller"
    ],
    "runtime": [
        "138"
    ],
    "rating": 8.0,
    "plot": [
        "In the run-up to the 1972 elections, Washington Post reporter Bob Woodward covers what seems to be a minor break-in at the Democratic Party National headquarters. He is surprised to find top lawyers already on the defense case, and the discovery of names and addresses of Republican fund organizers on the accused further arouses his suspicions. The editor of the Post is prepared to run with the story and assigns Woodward and Carl Bernstein to it. They find the trail leading higher and higher in the Republican Party, and eventually into the White House itself.::Jeremy Perkins {J-26}",
        "Factual account of investigative journalists Bob Woodward and Carl Bernstein of the Washington Post whose reporting of the Watergate break-in eventually led to the resignation of Richard Nixon, 37th President of the United States. The film focuses on the period from the break-in on June 17, 1972 to Nixon's re-election in November later than year. Their perseverance - and the support of their editors - revealed that the break-in at the Watergate office complex was only one small part of a much larger network of intelligence gathering activities, many of which were illegal. The story also focuses on the role of Woodward's now legendary secret source dubbed Deep Throat (since identified as FBI Deputy Director Mark Felt) and the encouragement he provided when the journalists hit roadblocks in their investigation.::garykmcd",
        "On June 17, 1972, the Washington DC police apprehend five men who broke into the National Democratic Party headquarters in the Watergate building. The Washington Post newspaper assigns Bob Woodward, a reporter relatively new to the paper who works the local news desk, to cover the seemingly minor story. When Woodward sees that the five men - primarily Cuban immigrants - have high powered lawyers working for them in the background, he sees a potentially larger story. That's when a fellow reporter at the newspaper, Carl Bernstein, who is more of a hack who was close to being fired, wants in on the story as well, which Woodward eventually welcomes. One of Woodward's Washington insider contacts, who is given the code name Deep Throat, implies that the break-in is indeed part of a larger story. Deep Throat will neither confirm or deny information, but will lead Woodward in the right direction if Woodward does get confirmation of information. Deep Throat eventually tells him to \"follow the money\", which leads them to uncover that the burglars had moneys in their bank accounts that were originally donated to the Committee to Reelect President Richard Nixon. They have to uncover who controlled the diversion of those funds to see how high up the story goes, which may lead them into the White House itself. Through the process, they have the obstacles of the newspaper's editor-in-chief Benjamin C. Bradlee who needs their story to be confirmed by reliable source after reliable source to prevent liable, few sources tied to the Committee who will speak to them on the record (their silence which is as telling to Woodward and Bernstein as actual information), and public apathy as no one but them, their newspaper and those to who they speak seem to believe there is a story at all. As they get closer to the truth, there may be those who will do anything to quash the story, all in the name of national security.::Huggo",
        "Two green reporters and rivals working for the Washington Post, Bob Woodward and Carl Bernstein, research the botched 1972 burglary of the Democratic Party Headquarters at the Watergate apartment complex. With the help of a mysterious source, code-named Deep Throat, the two reporters make a connection between the burglars and a White House staffer. Despite dire warnings about their safety, the duo follows the money all the way to the top.::Jwelch5742",
        "Enactment of the work of Bob Woodward and Carl Bernstein who uncovered the dirty tricks campaign and the coverup of the White House's involvement in the Watergate break in. The stories they wrote were very instrumental in the eventual resignation of President Richard Nixon.::John Vogel <jlvogel@comcast.net>",
        "\"The Washington Post\" reporters Bob Woodward and Carl Bernstein uncover the details of the Watergate scandal that leads to President Richard Nixon's resignation.::Jon Reeves <jreeves@imdb.com>"
    ],
    "language": {
        "id": [
            "English",
            "Spanish"
        ],
        "adult_language_percentage": 0.7753861422988648,
        "linguistic_difficulty_percentage": 0.0992494262142547,
        "words_per_minute": 116,
        "common_words": {
            "wa": 143,
            "know": 135,
            "got": 91,
            "say": 80,
            "right": 75,
            "get": 69,
            "one": 67,
            "said": 67,
            "mr": 66,
            "think": 63
        }
    }
}