{
    "title": "American History X",
    "year": 1998,
    "genres": [
        "Crime",
        "Drama"
    ],
    "runtime": [
        "119"
    ],
    "rating": 8.5,
    "plot": [
        "Derek Vineyard is paroled after serving 3 years in prison for brutally killing two black men who tried to break into/steal his truck. Through his brother, Danny Vineyard's narration, we learn that before going to prison, Derek was a skinhead and the leader of a violent white supremacist gang that committed acts of racial crime throughout L.A. and his actions greatly influenced Danny. Reformed and fresh out of prison, Derek severs contact with the gang and becomes determined to keep Danny from going down the same violent path as he did.::Nitesh D.(nmxpa7@msn.com)",
        "Edward Norton plays, Derek Vineyard, an ex neo-nazi ex-con that was a real product of his subtle upbringing and environment. When he gets out of jail he tries to convince his little brother (who he actually introduced to the same hateful life) that he can make better choices.",
        "Derek Vinyard is a skinhead and the leader of a white supremacist gang. After killing two black men who tried to steal his truck he is sent to prison for three years. Prison gives him a time to think about his life and when he comes out he decides to avoid the hate and prejudice of his past. He leaves the gang and attempts to live a normal life. However, his previous actions and prejudices may have influenced his younger brother.::grantss",
        "Derek Vinyard returns from prison to find his younger brother, Danny, caught in the same web of racism and hatred that landed him in prison. After Derek's father is killed in the line of duty by a minority, Derek's view of mankind is altered, but while in prison, he discovers that there is good and bad in every race. The task before him now is to convince Danny of his newfound enlightenment.::Robin <soonerzs@yahoo.com>",
        "A brutal Neo Nazi skinhead named Derek Vinyard is tried and sent to prison for three years for the murder of two black guys who tried to steal his truck. When he returns from prison reformed, his younger brother Daniel Vinyard who idolizes him is on the brink of becoming a Neo Nazi himself. Derek must save his younger brother from a similar fate.::Emphinix",
        "A former neo-nazi skinhead tries to prevent his younger brother from going down the same wrong path that he did.::<jarls@datasync.com>"
    ],
    "language": {
        "id": [
            "English"
        ],
        "adult_language_percentage": 4.730959188978424,
        "linguistic_difficulty_percentage": 0.034659041677497615,
        "words_per_minute": 96,
        "common_words": {
            "right": 121,
            "know": 94,
            "go": 89,
            "come": 89,
            "fucking": 88,
            "yeah": 75,
            "get": 74,
            "fuck": 68,
            "man": 64,
            "gonna": 61
        }
    }
}