{
    "title": "American Beauty",
    "year": 1999,
    "genres": [
        "Drama"
    ],
    "runtime": [
        "122"
    ],
    "rating": 8.4,
    "plot": [
        "After his death sometime in his forty-third year, suburbanite Lester Burnham tells of the last few weeks of his life, during which he had no idea of his imminent passing. He is a husband to real estate agent Carolyn Burnham and father to high school student Janie Burnham. Although Lester and Carolyn once loved each other, they now merely tolerate each other. Typical wallflower Janie too hates both her parents, the three who suffer individually in silence in their home life. Janie tries to steer clear of both her parents. Carolyn, relatively new to the real estate business, wants to create the persona of success to further her career, she aspiring to the professional life of Buddy Kane, the king of the real estate business in their neighborhood. Lester merely walks mindlessly through life, including at his job in advertising. His company is downsizing, and he, like all the other employees, has to justify his position to the newly hired efficiency expert to keep his job. Things change for Lester when he falls in love at first sight with Janie's more experienced classmate, Angela Hays. Both Janie and Angela can see Lester's sexual infatuation with Angela, who courts such attention from any man as a sign that she is model material, she having once appeared in Seventeen and it a career to which she aspires. Lester's infatuation with Angela gives him a reenergized view on life, where he openly doesn't care anymore what anyone thinks about what he does, anyone except Angela. This infatuation coincides with the Fittses moving in next door: homophobic disciplinarian US Marine Colonel Frank Fitts who rules the house with a military fist (that fist being both figurative and literal), his semi-comatose wife Barbara Fitts, and their bright and quietly subversive eighteen year old son Ricky Fitts, who openly abides by his father's rules while behind the scenes lives by his own quite different perspective. Much like Lester's infatuation, Ricky immediately becomes infatuated with Janie, he who considers girls like Angela as ordinary. The entry of Angela and the Fittses into the Burnhams' lives ultimately leads to each of the players confronting what is truly in his or her heart.::Huggo",
        "Lester and Carolyn Burnham are, on the outside, a perfect husband and wife in a perfect house in a perfect neighborhood. But inside, Lester is slipping deeper and deeper into a hopeless depression. He finally snaps when he becomes infatuated with one of his daughter's friends. Meanwhile, his daughter Jane is developing a happy friendship with a shy boy-next-door named Ricky, who lives with an abusive father.::Jessie Skinner <eietherbinge@hotmail.com>",
        "Lester Burnham is suffering a mid-life crisis that affects the lives of members of his family, which is made up of his super bitch of a wife, Carolyn and rebelling daughter Jane, who hates him. Carolyn is a real estate agent, a little too wrapped up in her job, who takes on an affair with business rival Buddy Kane. Meanwhile Jane seems to fall in love with Ricky Fitts, the strange boy next door, who is a drug dealer/documentarian and lives under a roof governed by a very strict marine father and a speechless mother. Lester's mid-life crisis causes him to drastically change his life around when he quits his job and works at a fast food restaurant. He starts working out to gain the attention of Angela (a friend of Jane's) who brags about her sexual exploits every weekend. Lives change and not for the best.::Mystic80",
        "Lester Burnham is a loser suburbanite rebelling against his dead-end job, bitch-on-wheels wife, unloving daughter, and imminent middle-age. His subsequent actions unfold into a darkly comic drama laced with a stellar supporting cast and enough roses to fill a nursery.::lianna g. <buzzie@beer.com>",
        "Lester Burnham is having his mid-life crisis. He is rebelling against his bitch-on-wheels wife Carolyn and his self-absorbed uncaring daughter Jane. After attending a cheerleader competition at Jane's high school, he meets Jane's friend Angela, whom he develops an infatuation for and decides he is going to turn his life around. He quits his high paying job to work at a fast food restaurant and decides to re-live his 20s. The impact his behavior has on the others around him changes and not for the better.::Ryan Harder <hotshotharder@hotmail.com>",
        "A sexually frustrated suburban father has a mid-life crisis after becoming infatuated with his daughter's best friend.::Noah Orent"
    ],
    "language": {
        "id": [
            "English"
        ],
        "adult_language_percentage": 2.303754266211604,
        "linguistic_difficulty_percentage": 0.024378352023403216,
        "words_per_minute": 67,
        "common_words": {
            "like": 61,
            "know": 53,
            "oh": 46,
            "wa": 46,
            "want": 44,
            "well": 40,
            "really": 32,
            "think": 32,
            "dad": 31,
            "going": 28
        }
    }
}