{
    "title": "Anatomy of a Murder",
    "year": 1959,
    "genres": [
        "Crime",
        "Drama",
        "Mystery",
        "Thriller"
    ],
    "runtime": [
        "160"
    ],
    "rating": 8.1,
    "plot": [
        "Frederick Manion (Ben Gazzara), a lieutenant in the army, is arrested for the murder of a bartender, Barney Quill. He claims, in his defense, that the victim had raped and beaten up his wife Laura (Lee Remick). Although Laura supports her husband's story, the police surgeon can find no evidence that she has been raped. Manion is defended by Paul Biegler (James Stewart), a humble small-town lawyer and recently deposed district attorney. During the course of interviews, Biegler discovers that Manion is violently possessive and jealous, and also that his wife has a reputation for flirting with other men. Biegler realizes that the prosecution will try to make the court believe that Laura had been drunk and was picked up by the bartender and then Her husband killed him and beat her up when he discovered they had been together. Manion pleads \"not guilty\" and Biegler, who knows that his case is weak, tries to find evidence that will save Manion.::alfiehitchie",
        "Paul Biegler is a small town lawyer who until recently had been the local district attorney and given a lack of clients, he spends a lot of time fishing. When a murder takes place in a trailer park on the outskirts of town, he is asked to defend Lt. Frederick Manion who admits to having killed Barney Quill, a local bar owner who allegedly raped his wife. Manion claims to have had a form of temporary insanity. The case is both prominent, with the State's Deputy Attorney General personally prosecuting the case and lurid, given the rape and the sexual nature of much of the testimony. Biegler and his friend former lawyer Parnell McCarthy, now a bit the worse for wear and given to drink, must find a way to convince the jury when they little or no evidence to support their case.::garykmcd",
        "In Iron County, Michigan, former District Attorney Paul Biegler has limited legal work and spends his new found time fishing and playing jazz piano. However, he, with the assistance of his alcoholic aged colleague, former lawyer and friend Parnell McCarthy (who is past the prime of his professional life) and his no nonsense secretary Maida Rutledge, decides to take the case of Army Lt. Frederick \"Manny\" Manion, who is charged with the murder of local bar owner Barney Quill. Biegler's decision to try the case is despite his dislike of Manion's brash and insolent attitude, and despite the fact that Manion currently has no money to pay for his services (Manion agrees to sign a promissory note once out of prison). Biegler realizes that he will have an uphill battle as Manion doesn't remember the actual act of shooting Quill but acknowledges that he did indeed kill Quill. The killing was prompted by Quill's alleged rape of Manion's wife, Laura. There is no physical evidence of that act beyond Laura's black eye and other signs of physical abuse. The rape may also be a problem for Biegler as Laura is a seductive woman who many may consider the instigator of an extra-marital liaison. Biegler instructs the Manion's not to tell a lie to him or in court, but he still plans on getting Manion off on the charge and having Manion plead not guilty. In court, he faces the unknown in the form of Judge Weaver. In court, he also faces not only the current District Attorney, but also the bulldog of an Assistant Attorney General, Claude Dancer.::Huggo",
        "Paul Biegler is a small-town lawyer. He was once the District Attorney of the area but, after 10 years in the job, lost the role in an election. Feeling betrayed by his community, he now has his own legal practice but few clients, preferring to spend his time fishing. Now he gets a huge case - an army Lieutenant has apparently murdered another man after that man allegedly raped his wife. The case will require every ounce of Biegler's cunning, experience and courtroom theatrical ability, especially when the prosecution bring in a famed hotshot attorney from the state's capital.::grantss",
        "Laura Manion returns home to tell her husband she's been raped. Lt. Manion kills the rapist and then claims temporary insanity as a defense. At least that's his story. Paul Biegler agrees to defend him and must unravel a case in which the motivations of the murderer, his wife, and the victim are all in question.::John Vogel <jlvogel@comcast.net>",
        "In a murder trial, the defendant says he suffered temporary insanity after the victim raped his wife. What is the truth, and will he win his case?::Anonymous"
    ],
    "language": {
        "id": [
            "English"
        ],
        "adult_language_percentage": 1.3498594941790445,
        "linguistic_difficulty_percentage": 0.11541549578482538,
        "words_per_minute": 124,
        "common_words": {
            "wa": 246,
            "manion": 143,
            "mr": 112,
            "quill": 102,
            "know": 100,
            "yes": 96,
            "barney": 95,
            "like": 88,
            "would": 70,
            "mrs": 69
        }
    }
}