{
    "title": "Andaz Apna Apna",
    "year": 1994,
    "genres": [
        "Comedy",
        "Family",
        "Romance"
    ],
    "runtime": [
        "160"
    ],
    "rating": 8.2,
    "plot": [
        "Amar and Prem are two rivals who belonging to middle-class families with no scope of future advancement. Both individually, without the knowledge of the other decide to take matters into their hands and find ways to get rich quickly. Chaos and acrimony result when both find each other at loggerheads when both arrive to win the hand of the daughter of multi-millionaire Ram Gopal Bajaj amidst considerable upheavals when Shyam, the twin brother of Ram, decides to do away with Ram and assume his identity and thus take over the estate of the Bajaj family.::Sonia",
        "Murli Manohar is the village barber and have an only son Amar while on the other hand Bankeylal Bhopali is a tailor and his son is Prem - both Amar and Prem hopes to hit it rich at warp speed with the sole aim of being a Bollywood actor. They find out that Raveena; the only daughter of multi-millionaire businessman, Ram Gopal Bajaj is on the look-out for a spouse. In order to evaluate the person before marrying Raveena asks her secretary, Karishma to pose as Raveena. When Amar and Prem arrive at the Bajaj's bungalow they starts to outwit each other so that the winner can have his way with Raveena - unknown to them that Ram's notorious brother Shyam Gopal Bajaj alias Teja wants to kill Raveena so that he can become the owner of the Bajaj's family assets and that they themselves will become targets of Teja.::gavin (racktoo@hotmail.com)",
        "Amar and Prem are slackers who want to make it big without any efforts they meet during a bus journey and both have intentions to marry Raveena daughter of rich billionaire.Amar enters Raveena's house pretending to be amnesia patient.Prem enters the house pretending to be a Dr to treat Amar. Where in the housemaid Karishma falls in love with him.Teja twin brother of Raveena's father Ram Gopal Bajaj has hatched a plan to kill them both. He has kept his henchmen Robert and Bhalla in Raveena's house to keep an eye on her.Robert and Bhalla plan many a times to kill her but fail always due to interference of Amar and Prem and face the plan consequences themselves.Crime Master Gogo is on lookout for Teja who has duped him for money.::alex.mjacko@gmail.com",
        "Amar and Prem are two conmen with no money, few prospects and big dreams. On hearing about the arrival of Raveena, an heiress, in India, they both get into her house, Amar as a man Raveena knocks out, and Prem as his doctor. They both vie for her affections, even though Prem finds himself falling in love with Karishma, Raveena's secretary. Then they run afoul of Raveena's father, a local gangster, who also has an interest in Raveena,and his double-crossing henchmen - and the fun begins.::Q. Leo Rahman",
        "Murli Manohar is a barber in a small town in India. He would like his son, Amar, to take over his business. But Amar is a slacker and a day-dreamer, who dreams of making it big in Bollywood movies and getting rich quick. When Amar finds out that a rich heiress, Raveena, is looking for a groom to marry, he decides to go and try his luck. On the way there, he meets with another slacker by the name of Prem, who is the son of a tailor named Bankeylal Bhopali. Prem is also on his way to meet Raveena and attempt to convince her to marry him. When both find out that they are after the same woman, they decide to outdo each other to win over Raveena's affections. Unsure of what groom, she is going to marry, Raveena asks her secretary, Karisma, to pose has herself, while she assumes her name. The result is hilarious chaos.::rAjOo (gunwanti@hotmail.com)",
        "Two slackers competing for the affections of an heiress, inadvertently become her protectors from an evil criminal.::Q. Leo"
    ],
    "language": {
        "id": [
            "Hindi"
        ],
        "adult_language_percentage": 1.2751275127512751,
        "linguistic_difficulty_percentage": 0.09000900090009001,
        "words_per_minute": 41,
        "common_words": {
            "teja": 41,
            "go": 37,
            "get": 34,
            "uncle": 34,
            "wa": 33,
            "let": 33,
            "raveena": 32,
            "diamond": 32,
            "yes": 28,
            "give": 26
        }
    }
}