{
    "title": "Batman Begins",
    "year": 2005,
    "genres": [
        "Action",
        "Adventure"
    ],
    "runtime": [
        "140"
    ],
    "rating": 8.3,
    "plot": [
        "When his parents are killed, billionaire playboy Bruce Wayne relocates to Asia where he is mentored by Henri Ducard and Ra's Al Ghul in how to fight evil. When learning about the plan to wipe out evil in Gotham City by Ducard, Bruce prevents this plan from getting any further and heads back to his home. Back in his original surroundings, Bruce adopts the image of a bat to strike fear into the criminals and the corrupt as the icon known as 'Batman'. But it doesn't stay quiet for long.::konstantinwe",
        "As a child, a young Bruce Wayne witnesses the death of his parents at the hands of a crazed criminal. As an adult, Bruce travels the world seeking the means to fight injustice. He lives among the boroughs of criminals and thieves in central Asia. Eventually, he meets a mysterious figure named Ra's Al Guhl and joins his gang called the League Of Shadows. Using his training, he is able to defeat his trainer. Finally meeting up with his estate caretaker Alfred Pennyworth, Bruce Wayne returns to Gotham. There, he becomes the new head of Wayne Enterprises. Together with the help of the CEO of the Wayne Enterprises Applied Sciences division, a man name Lucius Fox, he dons a new persona: Batman. As Batman takes on the criminals and organized crime underworld of Gotham, a sinister new underbelly of the city is exposed, and a new class of criminal is born. Will Batman be the one to stop them all, or does Gotham need a hero with a face?::halo1k",
        "Bruce Wayne, who experiences the death of his parents at a very young age, relocates to Asia and trains with his metors- Henri Ducard and Ra's Al Ghul in fighting injustice. He returns to a crime-ridden Gotham and with the help of his old butler and estate caretaker Alfred, the CEO of Wayne Enterprises Applied Science Division Lucius Fox, he dons a new persona- Batman, to strike fear into the hearts of the criminals and the corrupt. With the help of rising cop Gordon and the Assistant District Attorney and Bruce's love interest Rachel Dawes, he is able to take down the mafia don Falcone, and the twisted doctor/drug dealer Jonathan Crane aka The Scarecrow. With Ra's Al Ghul's return with his evil plan to destroy Gotham by inducing fear into the hearts of th people, Batman must defeat his mentor once again so as to bring peace in Gotham.::srijanarora-152-448595",
        "Bruce Wayne is still traumatized from that day he fell into the earth and was surrounded by bats, or that night his parents were murdered. But when he arrives at the headquarters of the League of Shadows, he must conquer his fears and start his training. However, he learns that some things are not right for him in the League and he flees, having learned skillful combat and he saves his mentor's life. When he returns to Gotham, he learns that Scarecrow is planning to dump a dangerous drug into the water supply to spread fear and panic throughout the population, only to learn that this plan is being maneuvered by someone much more familiar... Gotham might tear itself apart. Wayne must finally find a hidden identity and gain new power to save his city: Batman.",
        "As a boy a young Bruce Wayne watched in horror as his millionaire parents were slain in front of his eyes, a trauma which led him to become obsessed with revenge but his chance is cruelly taken away from him by fate. After disappearing to the East where he seeks counsel with the dangerous but honorable ninja cult leader known as Ra's Al-Ghul, he returns to his now decaying Gotham City overrun by organized crime and dangerous individuals manipulating the system whilst the company he inherited is slowly being pulled out from under him. The discovery of a cave under his mansion, and a prototype armored suit leads him to take on a new persona, one which will strike fear into the hearts of men who do wrong - he becomes, Batman. In the new guise, and with the help of rising cop Jim Gordon, Batman sets out to take down the various nefarious schemes in motion by individuals such as mafia don Falcone, the twisted doctor/drug dealer Jonathan 'The Scarecrow' Crane, and a mysterious third party that is quite familiar with Wayne and waiting to strike when the time is right.::Dark Horizons",
        "After training with his mentor, Batman begins his fight to free crime-ridden Gotham City from the corruption that Scarecrow and the League of Shadows have cast upon it.::paulrichard"
    ],
    "language": {
        "id": [
            "English",
            "Urdu",
            "Mandarin"
        ],
        "adult_language_percentage": 1.9901610017889086,
        "linguistic_difficulty_percentage": 0.14534883720930233,
        "words_per_minute": 63,
        "common_words": {
            "wa": 53,
            "wayne": 50,
            "bruce": 42,
            "know": 41,
            "one": 40,
            "like": 38,
            "get": 33,
            "gotham": 32,
            "mr": 29,
            "take": 29
        }
    }
}