{
    "title": "Chinatown",
    "year": 1974,
    "genres": [
        "Drama",
        "Mystery",
        "Thriller"
    ],
    "runtime": [
        "130"
    ],
    "rating": 8.2,
    "plot": [
        "In 1937 Los Angeles, private investigator Jake 'J.J.' Gittes specializes in cheating-spouse cases. His current target is Hollis Mulwray, high-profile chief engineer for the Los Angeles Department of Water and Power, whose wife suspects him of infidelity. In following Mulwray, Gittes witnesses some usual business dealings, such as a public meeting for construction of a new dam to create additional water supply for Los Angeles, as fresh water is vital to the growing community during the chronic drought; Mulwray opposes the dam. Eventually Gittes sees Mulwray meeting with an unknown young woman who isn't his wife. Once news of the supposed tryst between Mulwray and this woman hits the media, additional information comes to light that makes Gittes believe that Mulwray is being framed for something and that he himself is being set up. In his investigation of the issue behind Mulwray's framing and his own setup, Gittes is assisted by Mulwray's wife Evelyn, but he thinks she isn't being forthright with him. The further he gets into the investigation, the more secrets he uncovers about the Mulwrays' professional and personal dealings, including Mulwray's former business-partnership with Evelyn's father, Noah Cross. The identity of the unknown woman may be the key to uncovering the whole story.::Huggo",
        "It is the Great Depression era, September 1937, the period of the historic Los Angeles - Owens Valley Waters Wars. J.J. \"Jake\" Gittes (Jack Nicholson) is a brash private investigator. His methods yield results: because his small firm depends on publicity, he is not shy with the media. Hollis Mulwray is the Commissioner and Chief Engineer for the Los Angeles Department of Water and Power; given the circumstances and the issues of the times, Mulwray is one of the city's most powerful and influential politicians. Jake is hired to follow Mulwray; he goes to a commission meeting and to various reservoirs, aqueducts, dams, and waterways. Jake also tails him to a cozy apartment, where he snaps a photo of Mulwray in the clinches of a young blonde. The photo and juicy story make front-page headlines. At his office, Jake is confronted by the real Mrs. Mulwray (Faye Dunaway), an angry beauty, and her attorney, who hands Jake a lawsuit. With his reputation at stake, Jake is anxious to talk to Hollis Mulwray, but he is unable to locate him at his office or apartment or other haunts. At the Mulwray home, Evelyn Mulwray receives Jake, but she is evasive and uneven, then she offers to dismiss the law suit. When Jake persists, she suggests Jake try Oak Pass at Stone Canyon Reservoir, as her husband likes to walk there every day at lunch. Jake reaches Oak Pass and Hollis Mulwray is indeed at the reservoir, but so are the police: Mulwray fell and drowned, and his body washed up in a runoff channel. When Evelyn arrives at Oak Pass she lies to the police, and Jake does not expose her lies. Evelyn piques Jake's interest and he makes further investigation. After an attack, Jake informs Evelyn that her husband was murdered, and Jake soon becomes embroiled in the mystery of Mulwray's death and other questions: Who was the impostor and who hired her? Why was she hired? Who is Evelyn Mulwray and who's her daddy? Jake learns \"gold\" is really a five-letter word, more valuable than oil or diamonds, in this 1974 classic.::LA-Lawyer",
        "In 1937 Los Angeles, private detective J.J. Gittes is hired by a woman to investigate whether her husband is having an affair. The husband, Hollis Mulwray, is the chief water engineer for the city of Los Angeles. Soon after Gittes delivers the photos that seem to confirm her suspicions, he meets the man's real wife and, intrigued, investigates further. Then Hollis Mulwray turns up dead.::grantss",
        "Los Angeles detective Jake Gittes is hired by a \"Mrs. Mulwray\" to spy on her husband. Shortly after Gittes is hired, the real Mrs. Mulwray appears in his office threatening to sue if he doesn't drop the case immediately. Gittes pursues the case anyway, slowly uncovering a vast conspiracy centering on water management, state and municipal corruption, land use, and real estate; and involving at least one murder.::filmfactsman",
        "A private detective hired to expose an adulterer finds himself caught up in a web of deceit, corruption, and murder.::Anonymous"
    ],
    "language": {
        "id": [
            "English",
            "Cantonese",
            "Spanish"
        ],
        "adult_language_percentage": 1.071502163610138,
        "linguistic_difficulty_percentage": 0.10302905419328251,
        "words_per_minute": 74,
        "common_words": {
            "know": 80,
            "mr": 75,
            "mulwray": 70,
            "gittes": 61,
            "wa": 58,
            "want": 53,
            "water": 50,
            "get": 48,
            "like": 45,
            "well": 44
        }
    }
}