{
    "title": "City of God",
    "year": 2002,
    "genres": [
        "Crime",
        "Drama"
    ],
    "runtime": [
        "130"
    ],
    "rating": 8.6,
    "plot": [
        "Brazil, 1960s, City of God. The Tender Trio robs motels and gas trucks. Younger kids watch and learn well...too well. 1970s: Li'l Zé has prospered very well and owns the city. He causes violence and fear as he wipes out rival gangs without mercy. His best friend Bené is the only one to keep him on the good side of sanity. Rocket has watched these two gain power for years, and he wants no part of it. Yet he keeps getting swept up in the madness. All he wants to do is take pictures. 1980s: Things are out of control between the last two remaining gangs...will it ever end? Welcome to the City of God.::Jeff Mellinger <jeffmellinger@astound.net>",
        "During their childhood, several children raised in one of the violent neighborhoods of Rio de Janeiro see galling and nettlesome behaviors that turn some into criminals and some into poltroons; while one photographer boy in the middle stays out of their informal war until it's finished and then narrates the complicated story of what happened in that neighborhood and the ascending process of crime between men who were once innocent children.::J. S. Golden",
        "Set in a notorious slum of Rio - Cidade de Deus / City of God - the story of a boy who sees his friends and brother grow up or aspire to be gangsters, and decides to do something else. Meanwhile we also see the power struggles in the neighbourhood, how they developed, who the main protagonists are and the state of their feud.::grantss",
        "City of God is based on a true story that takes place in the '60s where in the slums of Rio de Janeiro two boys growing up in the neighborhood take on different paths in life. The story is told through the eyes of Buscape, a poor young fisherman's son who dreams of becoming a photographer one day. His story narrates the violence and corruption surrounding the city and the rise and fall of one of the city's most notorious bosses, Li'l Ze. As war wages on the streets Buscape's only way out of this violent life is to expose its brutality to the world through his pictures. Along the way the lives of others are put into perspective as their stories intersect with the events that take place.::Hax9 - Hax_9@hotmail.com",
        "Set in a lawless slum in Rio de Janeiro, \"City of God\" tells the story of Rocket, an aspiring photographer looking for his big break so he can leave the treacherous area once and for all. The movie chronicles Rocket's life as a young boy as he deals with his law bending brother and his gang, all the way to his teen years as a pseudo hippie. As the crime level soars in brutality, Rocket begins to realize his niche as a photographer is his only means of staying honest. With a psychopathic thug named \"Lil Ze\" looking to take over the slum, Rocket's career will take him on his most dangerous task of all.::Vince M",
        "Two boys growing up in a violent neighborhood of Rio de Janeiro take different paths: one becomes a photographer, the other a drug dealer.::IMDb Editors"
    ],
    "language": {
        "id": [
            "Portuguese"
        ],
        "adult_language_percentage": 4.534834324553951,
        "linguistic_difficulty_percentage": 0.07434154630416313,
        "words_per_minute": 72,
        "common_words": {
            "go": 90,
            "wa": 85,
            "li": 77,
            "get": 61,
            "one": 55,
            "let": 54,
            "z": 51,
            "want": 46,
            "kid": 41,
            "take": 38
        }
    }
}