{
    "title": "Dallas Buyers Club",
    "year": 2013,
    "genres": [
        "Biography",
        "Drama"
    ],
    "runtime": [
        "117"
    ],
    "rating": 8.0,
    "plot": [
        "Dallas 1985. Electrician and sometimes rodeo bull rider Ron Woodroof lives hard, which includes heavy smoking, drinking, drug use (primarily cocaine) and casual sex. He is racist and homophobic. While in the hospital on a work related injury, the doctors discover and inform him that he is HIV+, and that he will most-likely die within thirty days. Ron is initially in angry denial that he would have a disease that only \"faggots\" have, but upon quick reflection comes to the realization that the diagnosis is probably true. He begins to read whatever research is available about the disease, which at this time seems to be most effectively treated by the drug AZT. AZT, however, is only in the clinical trials stage within the US. Incredulous that he, as a dying man, cannot pay for any drug which may save or at least prolong his life, he goes searching for it by whatever means possible. It eventually leads him to Mexico and a \"Dr.\" Vass, an American physician whose license was revoked in the US because of his AIDS related work against US regulations. Dr. Vass leads Ron to a cocktail of other drugs, some vitamins, he believes are more effective in treating the symptoms, since the virus, as Ron learns, will always be in the system of those who have been exposed to it. Ron begins to smuggle these drugs not approved by the FDA into the US, not only for his own use but for sale to other HIV+ persons. In this venture, he goes into an unlikely partnership with a HIV+ transgender woman named Rayon, who he met in the hospital and who has greater contact with AIDS patients through the gay community. As they try to work both above ground to get the meds to those that need them and underground to avoid detection by especially the FDA, Ron comes up with an idea to circumvent the fact of selling the drugs - which are not considered drugs yet since they are not FDA approved - directly to the HIV+ population, which then should should not be against the law. Richard Barkley and Dr. Sevard, the FDA's lead man on the file and one of Ron's doctors respectively, the latter who sees clinical trials as the only way to determine the efficacy of drugs despite the fact that Ron and others would have probably died already without these drugs, try to stop Ron and Rayon at every turn. Caught in the middle is Dr. Eve Saks, another of Ron's doctors, who understands why policies are in place, but who can sympathize with Ron, Rayon and others - all her patients, directly or indirectly - in their situation.::Huggo",
        "In 1985, in Dallas, the homophobic electrician and rodeo rider Ron Woodroof is a cocaine user who frequently has sex with hookers and promiscuous women. When he has an accident at work, he is sent to the hospital where Dr. Sevard and Dr. Eve tell him that he is HIV+ and will die within thirty days. Ron also meets trans-gender Rayon, who is drug addicted and also has the disease. Ron does not accept the diagnosis but a couple of days later he realizes that it may be accurate. He researches about the disease and learns that AZT might be lethal for infected people. Further, he discovers that in Mexico there is a doctor with revoked license named Vass that uses alternative drugs in the treatment of AIDS. Ron improves his health and decides to sell the drugs in Dallas. He makes a partnership with Rayon and soon he creates the Dallas Buyers Club, where the memberships pay four hundred dollars per month to have the necessary drugs. But the FDA does not accept his research and he is oppressed by the authorities.::Claudio Carvalho, Rio de Janeiro, Brazil",
        "Ron Woodroof is a man living in Texas in 1985. He drinks, does drugs and sleeps with women, a real alpha male. When he gets injured at work, he is brought to the hospital and as a procedure, they test his blood and when they get the result, they tell him that he has the HIV virus which causes AIDS. They tell him that he has 30 days to get his affairs in order. He doesn't believe them because like most people at the time, he thinks only homosexuals get the disease. When he gets worse, he learns of the drug AZT which can treat the disease. But it's not available to the public so he finds someone who works in a lab and pays him to provide him with it. But when he tells Woodroof he can't get it anymore, Woodroof needs it so he tells Woodroof of a doctor in Mexico who treats people with AIDS. Woodroof goes there and finds the doctor who treats him. After awhile, Woodroof is doing better. The doctor tells him that he doesn't use AZT because it only makes things worse, so he uses his own remedies. Woodroof decides to sell the doctors meds in the US which the medical community refuses to accept. He finds people who want it and business is booming. Eventually the government tries to stop him but he finds a way around them.::rcs0411@yahoo.com",
        "In mid 1980s Texas, electrician Ron Woodroof is starting to learn that he has AIDS. Though told he has just 30 days left to live, Woodroof refuses to give in to despair. He seeks out alternative therapies and smuggles approved drugs into the US from where ever he can find them. Woodroof joins forces with a fellow AIDS patient and begins selling the treatments to the growing number of people who can't wait for the medical establishment to save them.::Gerry Garcia",
        "The story of Texas electrician Ron Woodroof and his battle with the medical establishment and pharmaceutical companies after being diagnosed as HIV-positive in 1986, and his search for alternative treatments that helped established a way in which fellow HIV-positive people could join for access to his supplies.::Focus Features",
        "In 1985 Dallas, electrician and hustler Ron Woodroof works around the system to help AIDS patients get the medication they need after he is diagnosed with the disease.::Scott Moran"
    ],
    "language": {
        "id": [
            "English",
            "Japanese"
        ],
        "adult_language_percentage": 4.706286499484714,
        "linguistic_difficulty_percentage": 0.011450818733539448,
        "words_per_minute": 74,
        "common_words": {
            "got": 80,
            "get": 65,
            "right": 64,
            "fucking": 53,
            "fuck": 43,
            "drug": 40,
            "shit": 38,
            "know": 38,
            "well": 37,
            "need": 36
        }
    }
}