{
    "title": "Dangal",
    "year": 2016,
    "genres": [
        "Action",
        "Biography",
        "Drama",
        "Sport"
    ],
    "runtime": [
        "161"
    ],
    "rating": 8.5,
    "plot": [
        "Biopic of Mahavir Singh Phogat, who taught wrestling to his daughters Babita Kumari and Geeta Phogat. Geeta Phogat was India's first female wrestler to win at the 2010 Commonwealth Games, where she won the gold medal (55 kg) while her sister Babita Kumari won the silver (51 kg).::Dibyayan_Chakravorty",
        "Dangal is a biography of a real life patriotic fighter Mahavir Singh Phogat who raises his daughters and evolves them into World Class Fighters. The movie begins with a crochy brawl between Mahavir (Aamir Khan) and his colleague who was also former wrestler, thus embalming the terrific Dangal Theme, discovering Mahavir's past life of a Wrestler. Mahavir admires to make his dreams come true by his sons but on contrary, four daughters take birth. They come with a complaint of beating down a boy in their locality. Hence Mahavir hopes they would be future Wrestlers. So he trains his daughters Gita and Babita, thus proving they're no less than a professional male wrestler. After a long struggle, Gita enters the National level Wrestling and acquires victory. When she is up to the Internationals, she opts to get trained from the NSA(National Sports Academy) where a coach mis-trains Gita, due to which she deliberately fails every match she attempts. Her sister Babita also attains an age to get into Wresting. Now, Mahavir plans to train both by his own norms. Finally, Gita defeats an Australian Wrestler by following the predominant path of her father, not of the coach. The movie is par excellent, enridges Women Empowerment in the Nation. Aamir Khan once again proves to be a Living Gem in the History of Indian Cinema. For more reviews follow @ramsay_cullen.di.caprio on Instagram::Srivathsavan Iyengar",
        "Mahavir Singh Phogat is a former wrestling champion had to quit the sport due to his family pressure as it was not helping his family financially.He only dreams that his son should win Gold Medal for India in wrestling but back to back he has four daughter's.Mahavir feels his dream cant be complete and starts staying away from the sport,while his daughter Geeta and Babita are growing the notices that they have quality of being wrestlers and starts training them,Geeta and Babita have to get a hard training and start to dislike their father for this but they realize that their father is doing this for their betterment and take the sport seriously.Geeta soon becomes a a known wrestler in the state and wins Junior International.Geeta further has to Patiala for further training to participate in common wealth games where she has a new coach Pramod Kadam.Meanwhile Babita makes her name at Junior level.Geeta believes her coach's training is better than her father which makes Mahavir very depressed.::alex.mjacko@gmail.com",
        "Former wrestler Mahavir Singh Phogat and his two wrestler daughters struggle towards glory at the Commonwealth Games in the face of societal oppression.::Ishaan Gulati"
    ],
    "language": {
        "id": [
            "Hindi",
            "Tamil",
            "Telugu"
        ],
        "adult_language_percentage": 1.3086770981507825,
        "linguistic_difficulty_percentage": 0.03793266951161688,
        "words_per_minute": 65,
        "common_words": {
            "geeta": 196,
            "papa": 66,
            "girl": 59,
            "win": 52,
            "point": 52,
            "wrestling": 49,
            "wrestler": 48,
            "come": 47,
            "ha": 46,
            "go": 43
        }
    }
}