{
    "title": "Dial M for Murder",
    "year": 1954,
    "genres": [
        "Crime",
        "Thriller"
    ],
    "runtime": [
        "105"
    ],
    "rating": 8.2,
    "plot": [
        "In London, wealthy Margot Mary Wendice had a brief love affair with the American writer Mark Halliday while her husband and professional tennis player Tony Wendice was on a tennis tour. Tony quits playing to dedicate to his wife and finds a regular job. She decides to give him a second chance for their marriage. When Mark arrives from America to visit the couple, Margot tells him that she had destroyed all his letters but one that was stolen. Subsequently she was blackmailed, but she had never retrieved the stolen letter. Tony arrives home, claims that he needs to work and asks Margot to go with Mark to the theater. Meanwhile Tony calls Captain Lesgate (aka Charles Alexander Swann who studied with him at college) and blackmails him to murder his wife, so that he can inherit her fortune. But there is no perfect crime, and things do not work as planned.::Claudio Carvalho, Rio de Janeiro, Brazil",
        "After learning that his wife Margot had a brief affair with mystery writer Mark Halliday, Tony Wendice decides he's going to kill her. He wants to provide himself with an ironclad alibi and so blackmail a one-time schoolmate with a shady past, Charles Swann, to do the killing for him. The plan is simple. He will give Swann a key to their flat and while he and Halliday are out at a dinner, Swan can let himself into the flat and strangle her. It all goes as planned but Margot successfully defends herself, killing Swan in the process. She is convicted of his murder - Tony had planted evidence to suggest that he had been blackmailing her - and soon finds herself in prison awaiting execution on the gallows. It's left to Mark Halliday and a sympathetic policeman, Chief Inspector Hubbard, to uncover Wendice's plan and get the evidence to arrest him.::garykmcd",
        "Residing in London, former tennis pro turned sporting goods salesman Tony Wendice and socialite Margot Wendice have a loving, happy marriage,... or so it appears on the surface. In reality, Margot fell out of love with Tony as a traveling tennis wife, and began an affair with American writer Mark Halliday, who she still loves. Margot decided to make a go of the marriage when Tony gave up tennis for a more steady job, but she still kept one keepsake from Mark, a love letter, which she carried with her everywhere in whatever handbag she was using, that is until the letter was stolen from her handbag. An unknown person is blackmailing her with the letter, threatening to expose the affair to Tony, something she has told no one except Mark. The blackmailer, which in reality is not blackmail but part of a larger plot, is Tony himself. When first discovering the affair, Tony had thought about killing Mark. But now, his carefully thought out plan is to have Margot killed so that he can live off her wealth. That plan, which only recently coalesced into a beginning to end detailed plot, involves blackmailing old college associate Charles Swann, who Tony has recently learned has turned to a life of fraud and murder. While Tony is out for the evening with a visiting Mark, Swann will kill Margot at the Wendice apartment. Tony will have an alibi and Swann should be able to get away scot-free as he has no formal ties to the Wendices and thus no motive to kill Margot. Although Tony considers the plan foolproof, it does not come off quite as planned, with Margot surviving the attack. Tony has to decide what to do, if he should just hide his involvement in the murder plot, or if he has a Plan B up his sleeve still to get rid of Margot for good. Who may factor into what happens are Mark, who will do whatever to help Margot, most specifically using his creative writing skills, and the lead police investigator, Chief Inspector Hubbard, who may see the crime scene in a slightly different light than the average Joe.::Huggo",
        "Ex-tennis pro Tony Wendice decides to murder his wife for her money and because she had an affair the year before. He blackmails an old college associate to strangle her, but when things go wrong he sees a way to turn events to his advantage.::Col Needham <col@imdb.com>",
        "Tony Wendice learns that his wife, Margo had an affair but even though it's over, he decided to kill her but chose to bide his time. He waited until Mark Halliday, his wife's boyfriend, returned to town. He then placed his plan in order. He summoned a man, whose reputation is a bit shady, and reveals that he knows his secrets but also tells him about his wife and her boyfriend and that they are each the beneficiary of their estates. He gets the man to agree to kill his wife and he has laid out what appears to be perfect plan. Only thing is the man was the one who was killed. Wendice trying to cover everything up, decides then to make it appear that Margo had an ulterior motive for killing the man. And it appears to be working except Halliday doesn't believe she's guilty and the police uncover a few anomalies.::rcs0411@yahoo.com",
        "An ex-tennis pro carries out a plot to murder his wife. When things go wrong, he improvises a brilliant plan B.::sspurli"
    ],
    "language": {
        "id": [
            "English"
        ],
        "adult_language_percentage": 0.5289788408463661,
        "linguistic_difficulty_percentage": 0.015332720024532353,
        "words_per_minute": 124,
        "common_words": {
            "wa": 146,
            "yes": 108,
            "well": 83,
            "know": 73,
            "oh": 70,
            "get": 54,
            "tony": 46,
            "come": 44,
            "see": 44,
            "one": 43
        }
    }
}