{
    "title": "Double Indemnity",
    "year": 1944,
    "genres": [
        "Crime",
        "Drama",
        "Film-Noir",
        "Mystery",
        "Thriller"
    ],
    "runtime": [
        "107"
    ],
    "rating": 8.3,
    "plot": [
        "In 1938, Walter Neff, an experienced salesman of the Pacific All Risk Insurance Co., meets the seductive wife of one of his clients, Phyllis Dietrichson, and they have an affair. Phyllis proposes to kill her husband to receive the proceeds of an accident insurance policy and Walter devises a scheme to receive twice the amount based on a double indemnity clause. When Mr. Dietrichson is found dead on a train track, the police accept the determination of accidental death. However, the insurance analyst and Walter's best friend Barton Keyes does not buy the story and suspects that Phyllis has murdered her husband with the help of another man.::Claudio Carvalho, Rio de Janeiro, Brazil",
        "Walter Neff, the Pacific All Risk Insurance Company's top salesman, returns to his office late one evening, bleeding from a gunshot wound, and dictates a memo to colleague Barton Keyes. It all started the previous May, when he stopped at a client's home for a routine renewal inquiry and instead met the client's wife, Phyllis Dietrichson. She asked about buying accident insurance for her husband without his knowledge, and Neff understood that she intended to kill him. Neff and Phyllis were soon lovers, with Neff taking charge of the killing. Initially their plan went off without a hitch, but then Neff realized that he had been played and decided to do something about it.::garykmcd and Copy Editor",
        "Alone in his company's Los Angeles offices late one evening and under some distress, insurance salesman Walter Neff dictates an inter-office memo to his colleague, claims manager Barton Keyes, about killing one of his clients, a Mr. Dietrichson. Barton suspected that Dietrichson was murdered by his wife, Phyllis Dietrichson, who was claiming the double indemnity on her husband's accident insurance policy. Walter met Phyllis innocently enough - he was dropping off auto insurance renewal papers for her husband - but quickly fell under her seductive charms. They were obvious to each other in their mutual attraction. After deducing that she was planning on killing her husband since she stated he was abusive and claiming the insurance moneys on a policy her husband would have no idea existed, Walter decided to go into cahoots with her so that he could help her craft and execute the \"perfect\" insurance policy, and plan and execute the \"perfect\" murder beyond Keyes' scrutiny, leading to them living in bliss together and with money. Beyond any slip-up in the plan, Keyes and Dietrichson's disgruntled daughter, Phyllis' step-daughter Lola Dietrichson, factored into their ability to pull off the plan successfully. Walter concludes his memo for its reason, which he considers more a confession.::Huggo",
        "Walter Neff is an insurance salesman whose life is largely devoid of any excitement and thrill. All of that changes when he meets Phyllis Dietrichson, the callous wife of a man whom she plans to murder and cash out on his accidental death claim (\"double indemnity\"). When he is seduced by Dietrichson into murdering her husband, the two plot a murder scheme that will not go as planned. Suddenly, the motives of each become unclear and the plan becomes further complicated when Neff's boss begins to investigate the murder.::Kyle Perez",
        "Smooth-talking insurance salesman Walter Neff meets attractive Phyllis Dietrichson when he calls to renew her husband's automobile policy. The couple are immediately drawn to each other and an affair begins. They cook up a scheme to murder Mr. Dietrichson for life insurance money with a double indemnity clause. Unfortunately, all does not go to plan...::Col Needham <col@imdb.com>",
        "Insurance agent Walter Neff plots with attractive Phyllis Dietrichson to murder her husband. After the husband has been tricked into signing a double-indemnity accident policy, they kill him and make it look like an accident. But Barton Keyes, an insurance investigator and a friend of Neff's, doesn't believe that it was and he pursues the case, linking Phyllis with everyone but his friend. Neff, meanwhile, is told by Dietrichson's daughter from a previous marriage that she believes Phyllis killed her mother in order to marry her father. Neff suspects Phyllis of a double cross and confronts her.::filmfactsman",
        "An insurance representative lets himself be talked into a murder/insurance fraud scheme that arouses an insurance investigator's suspicions.::Anonymous"
    ],
    "language": {
        "id": [
            "English"
        ],
        "adult_language_percentage": 0.9140645850013344,
        "linguistic_difficulty_percentage": 0.06004803843074459,
        "words_per_minute": 140,
        "common_words": {
            "wa": 166,
            "walter": 86,
            "mr": 82,
            "know": 81,
            "dietrichson": 80,
            "keyes": 78,
            "like": 75,
            "got": 70,
            "get": 63,
            "right": 57
        }
    }
}