{
    "title": "Fanny and Alexander",
    "year": 1982,
    "genres": [
        "Drama"
    ],
    "runtime": [
        "188"
    ],
    "rating": 8.1,
    "plot": [
        "It's the early twentieth century Sweden. Adolescent siblings Alexander and Fanny Ekdahl lead a relatively joyous and exuberant life with their well-off extended paternal family, led by the family matriarch, their grandmother, Helena Ekdahl. The openness of the family culture is exemplified by Helena's now deceased husband ending up becoming best friends with one of her lovers, a Jewish puppet maker named Isak Jacobi, and their Uncle Gustav Adolf's open liaison with one of the family maids, Maj, who everyone in the family adores, even Gustav Adolf's wife, Alma. Between the siblings, Alexander in particular has inherited the family's love of storytelling, his parents and his grandmother who are actors and who manage their own theater. Things change for Alexander and Fanny when their father, Oscar, dies shortly after Christmas 1907. Although she truly does believe she loves him, the children's mother, Emilie, decides to marry Bishop Edvard Vergérus, who she first met as the officiate at Oscar's funeral. She also wants a father figure for the children. Going into the marriage, Emilie has inclinations that it will be a much different life than she had with the Ekdahls, but is not prepared for the harsh, austere and strict life Edvard rules with an iron fist. Emilie, Alexander and Fanny end up being prisoners in the bishop's stark and humorless house. As Alexander butts head with his stepfather and tries to learn how to keep to his own principles while obeying Edvard, Emilie tries to figure out a way to regain her and her children's own destiny, as Edvard will not consent to divorce, and her \"desertion\" in the eyes of the law means that Alexander and Fanny would become his wards.::Huggo",
        "Alexander Ekdahl and his younger sister Fanny live a wonderful life. Their parents own a local theater and the extended Ekdahl family are close, spending Christmas together. Just a few weeks after the Christmas celebrations however, their beloved father dies. The children and their mother feel the loss greatly and Alexander occasionally sees his father's spirit in the house. After a period of time, their mother informs them that she is to be married to Bishop Edvard Vergerus, someone Alexander had already encountered over a lie he once told at school. The Bishop's house is a dreary place and the Bishop proves to be a strict disciplinarian who insists on all house rules being followed. After being caught in another lie, Alexander is severely beaten and his mother realizes she must find a way to send the children away.::garykmcd",
        "The title characters are children in the exuberant and colorful Ekdahl household in a Swedish town early in the twentieth century. Their parents, Oscar and Emilie, are the director and the leading lady of the local theatre company. Oscar's mother and brother are its chief patrons. After Oscar's early death, his widow marries the bishop and moves with her children to his austere and forbidding chancery. The children are immediately miserable. The film dramatizes and resolves those conflicts. A sub-plot features Isak, a local Jewish merchant who is the grandmother's lover and whose odd household becomes the children's refuge.::<jhailey@hotmail.com>",
        "Two young Swedish children experience the many comedies and tragedies of their family, the Ekdahls.::Karl Krejci"
    ],
    "language": {
        "id": [
            "Swedish",
            "German",
            "Yiddish",
            "English",
            "French"
        ],
        "adult_language_percentage": 1.4774882699411,
        "linguistic_difficulty_percentage": 0.16971149046620745,
        "words_per_minute": 106,
        "common_words": {
            "good": 94,
            "child": 89,
            "wa": 88,
            "come": 81,
            "know": 77,
            "say": 72,
            "like": 71,
            "alexander": 67,
            "one": 65,
            "think": 59
        }
    }
}