{
    "title": "Gangster Squad",
    "year": 2013,
    "genres": [
        "Action",
        "Crime",
        "Drama",
        "Thriller"
    ],
    "runtime": [
        "113"
    ],
    "rating": 6.7,
    "plot": [
        "It's 1949 Los Angeles, and gangster Mickey Cohen has moved in, with the intention of controlling all criminal activity in the city. He has bought local judges and police, and no one is willing to cross him or testify against him. Everyone except Sergeant John O'Mara, a former World War II soldier, whose goal is to settle with his family in a peaceful Los Angeles. Police Chief William Parker decides to form a special unit whose mission is to take down Cohen, and chooses O'Mara to lead the unit. O'Mara chooses 4 cops and asks another cop and vet, Jerry Wooters to join him but Wooters is not interested. But when he witnesses the murder of a young boy by Cohen's people, he joins them, and they decide to take apart Cohen's organization. Cohen wonders if a rival is going after him, but eventually he realizes it's the cops.::rcs0411@yahoo.com",
        "1949 Los Angeles. Boxer turned mobster Mickey Cohen, who had been working in Chicago with some other mobster associates, has moved his operation to Los Angeles. He plans to take control of the city, in the process squeezing out all competition by whatever means, usually by violence. In being able to achieve this, Cohen has many in Los Angeles area authority in his back pocket. LAPD Chief Bill Parker asks Sgt. John O'Mara to assemble and lead an unofficial, off-the-books squad to deal with the Cohen problem. Parker makes this request specifically to O'Mara because of O'Mara's previous handling of some cases associated with Cohen's operations. O'Mara and the squad are not to kill Cohen - which would only lead to someone else taking over - but rather disable all his operations in such a way no other mobster would consider coming in. Although she doesn't much like this assignment, O'Mara's loving and very pregnant wife, Connie, convinces her husband that he needs to recruit others with specialized skills as opposed to clones of himself which was his original thought, her advice all in an effort to make sure he comes home alive as a father at the end of it all. O'Mara will have to control the disparate group he has assembled in working toward their common goal. One issue he will have to deal with is the fact that one of his colleagues, Sgt. Jerry Wooters, who has lost his professional drive, has just embarked on affair with Cohen's girlfriend, Grace Faraday, the two whose lives would be in danger if Cohen ever found out. As O'Mara and his team plow ahead without a clear plan, they may encounter problems in finding out who indeed is in Cohen's back pocket, and as they can't ask for any assistance from anyone outside of the squad as being \"unofficial\". Nonetheless, they may be able to continue progressing to their end goal as long as Cohen does not know who they are, namely that they are LAPD undercover. If they are ever discovered, it may not only compromise their work, but may place their lives, and that of their loved ones, in mortal danger.::Huggo",
        "It's 1949 Los Angeles, the city is run by gangsters and a malicious mobster, Mickey Cohen. Determined to end the corruption, John O'Mara assembles a team of cops, ready to take down the ruthless leader and restore peace to the city."
    ],
    "language": {
        "id": [
            "English"
        ],
        "adult_language_percentage": 2.7712264150943398,
        "linguistic_difficulty_percentage": 0.08254716981132076,
        "words_per_minute": 75,
        "common_words": {
            "know": 70,
            "cohen": 69,
            "get": 68,
            "right": 57,
            "come": 54,
            "go": 54,
            "gonna": 45,
            "mickey": 41,
            "guy": 38,
            "like": 37
        }
    }
}