{
    "title": "Goodfellas",
    "year": 1990,
    "genres": [
        "Crime",
        "Drama"
    ],
    "runtime": [
        "146"
    ],
    "rating": 8.7,
    "plot": [
        "Henry Hill might be a small time gangster, who may have taken part in a robbery with Jimmy Conway and Tommy De Vito, two other gangsters who might have set their sights a bit higher. His two partners could kill off everyone else involved in the robbery, and slowly start to think about climbing up through the hierarchy of the Mob. Henry, however, might be badly affected by his partners' success, but will he consider stooping low enough to bring about the downfall of Jimmy and Tommy?::Colin Tinto <cst@imdb.com>",
        "This film views the mob lives of three pivotal figures in the 1960's and 70's New York. Henry Hill is a local boy turned gangster in a neighborhood full of the roughest and toughest. Tommy DeVito is a purebred gangster, who turns out to be Henry's best friend. Jimmy Conway puts the two of them together, and runs some of the biggest hijacks and burglaries the town has ever seen. After an extended jail sentence, Henry must sneak around the back of the local mob boss, Paulie Cicero, to live the life of luxury he has always dreamed of. In the end, the friends end up in a hell of a jam, and must do anything they can to save each other, and stay alive.::<formica97@aol.com>",
        "The story of Irish-Italian American, Henry Hill, and how he lives day-to-day life as a member of the Mafia. Based on a true story, the plot revolves around Henry and his two unstable friends Jimmy and Tommy as they gradually climb the ladder from petty crime to violent murders.::Graeme Roy <gsr@cbmamiga.demon.co.uk>",
        "The lowly, blue-collar side of New York's Italian mafia is explored in this crime biopic of wiseguy Henry Hill. As he makes his way from strapping young petty criminal, to big-time thief, to middle-aged cocaine addict and dealer, the film explores in detail the rules and traditions of organized crime. Watching the rise and fall of Hill and his two counterparts, the slick jack-of-all-trades criminal Jimmy Conway and the brutish, intimidating Tommy DeVito, this true story realistically explores the core, blue-collar part of the mob.::Dustin B.",
        "The story of Henry Hill and his life in the mob, covering his relationship with his wife Karen Hill and his mob partners Jimmy Conway and Tommy DeVito in the Italian-American crime syndicate.::paulrichard"
    ],
    "language": {
        "id": [
            "English",
            "Italian"
        ],
        "adult_language_percentage": 2.955291740338469,
        "linguistic_difficulty_percentage": 0.012629451881788331,
        "words_per_minute": 108,
        "common_words": {
            "wa": 212,
            "got": 153,
            "go": 119,
            "fucking": 109,
            "get": 104,
            "know": 98,
            "like": 82,
            "right": 81,
            "want": 69,
            "come": 69
        }
    }
}