{
    "title": "Groundhog Day",
    "year": 1993,
    "genres": [
        "Comedy",
        "Fantasy",
        "Romance"
    ],
    "runtime": [
        "101"
    ],
    "rating": 8.0,
    "plot": [
        "A weather man is reluctantly sent to cover a story about a weather forecasting \"rat\" (as he calls it). This is his fourth year on the story, and he makes no effort to hide his frustration. On awaking the 'following' day he discovers that it's Groundhog Day again, and again, and again. First he uses this to his advantage, then comes the realisation that he is doomed to spend the rest of eternity in the same place, seeing the same people do the same thing EVERY day.::Rob Hartill",
        "Misanthropic TV weatherman/broadcaster, Phil Connors, is annoyed and despondent when he's assigned the job of covering the annual Groundhog festivities in the small \"Hick\" town of Punxsutawney - making this his fourth in a row. The only noticeable upside is his attractive and good-natured producer. But the real nightmare begins when Phil ends up reliving the same day (Groundhog Day) over, and over again. Unable to leave the town due to a severe blizzard, and with no end in sight, Phil struggles to find a way to escape (and ultimately make the best of) his seemingly hopeless situation.::S. Lagan",
        "TV weatherman Phil Connors is cynical, to say the least, and having to go yet again to Punxsutawney, Pa. on February 2 to see if Punxsutawney Phil sees his shadow isn't his idea of fun. He's grumpy with his segment producer Rita and downright nasty with cameraman Larry. He doesn't take the shadow business at all seriously but the next morning, awakens to find he is reliving the same day. Initially disbelieving and fighting what is happening to him, Phil eventually accepts that he will re-live the same day over and over again. He uses the opportunity to acquire new skills - piano playing and ice carving among them - and soon becomes the most admired man in Punxsutawney. Just how many times he relives the day, however, is anyone's guess.::garykmcd",
        "If forced to repeat the same day over and over again, how would you spend it? A sarcastic, egotistical weathman is forced to spend his least favorite assignment in small town Pa on Groundhog Day.....over and over again! He evolves and learns the key to life isn't what happens but how you react to it.",
        "Phil Connors is the arrogant and egotistical weatherman for local station WPBH-TV Pittsburgh. He has disdain for those with whom he works as well as for his viewers. But he has the most disdain for Groundhog Day held in Punxsutawney, Pennsylvania, which he is to cover for the fourth time in his career, this year with Rita and Larry, the station's new producer and cameraman respectively. Phil wants to get in and out of Punxsutawney as quickly as possible, but a snowstorm forces the threesome to stay an extra night in town after the Groundhog Day festivities. When Phil awakens the next morning, he is experiencing what he thinks is déjà vu. In reality, he is experiencing that Groundhog Day in Punxsutawney all over again. The same happens the following day and the following. As Phil relives that same Groundhog Day over and over again, he goes through a myriad of highs and lows. But as he comes to the realization that Groundhog Day may be his fate for eternity, he also comes to other realizations, such as that his actions have no long term consequences, but that knowledge, especially as it relates to Rita, can be a powerful and dangerous thing. But he is given opportunity after opportunity to get the day \"right\".::Huggo",
        "A weatherman finds himself inexplicably living the same day over and over again.::Anonymous"
    ],
    "language": {
        "id": [
            "English",
            "French",
            "Italian"
        ],
        "adult_language_percentage": 0.9767687434002112,
        "linguistic_difficulty_percentage": 0.05279831045406547,
        "words_per_minute": 75,
        "common_words": {
            "like": 53,
            "phil": 51,
            "know": 50,
            "wa": 39,
            "want": 38,
            "right": 37,
            "think": 36,
            "come": 35,
            "see": 34,
            "day": 34
        }
    }
}