{
    "title": "Hacksaw Ridge",
    "year": 2016,
    "genres": [
        "Biography",
        "Drama",
        "History",
        "War"
    ],
    "runtime": [
        "139"
    ],
    "rating": 8.2,
    "plot": [
        "The true story of Desmond T. Doss, the conscientious objector who, at the Battle of Okinawa, was awarded the Congressional Medal of Honor for his incredible bravery and regard for his fellow soldiers. We see his upbringing and how this shaped his views, especially his religious view and anti-killing stance. We see Doss's trials and tribulations after enlisting in the US Army and trying to become a medic. Finally, we see the hell on Earth that was Hacksaw Ridge.::grantss",
        "An Americam army veteran grieves by the tombstones of his army company that died during World War I. Back home, he raises his sons in a pious setting and asks them to shun weapons. After a naughty fight turns awry, Desmond reads the Bible and vows not to harm another human in his life thereafter. Desmond then saves the life of a worker, experiencing a wholesome satisfaction in the process. In the hospital, he is smitten by a nurse, who he then dates. After the United States enters the Second World War, both sons enlist, adding to the ire of the father who despises his sons joining the Army. The rigorous regimen of training in the Army requires Desmond to clear his firearms training, but after a huge tiff with his seniors, his father, an old corporal, intervenes to save Desmond from being court-martialed and serve with the Army as a medic. They get posted to Hacksaw Ridge, Okinawa. A win there would ensure that the Empire of Japan surrenders to the Allied Forces. What happens thereon?::PipingHotViews",
        "After Desmond T. Doss volunteered to enlist in the US Army in WWII, he was firstly assumed as a cowardice for anti-killing stance performing as a Medic. This is how Private Doss inspired us about an incredible-bravery-true story on Hacksaw Ridge at the Battle of Okinawa.The most inspired part of this film is the scene when Doss whispered, \" Lord, help me get one more, please. Help me get one more.\"::Shine Light",
        "In Lynchburg, Desmond Doss and his brother Hal are raised by a dysfunctional family since their father Tom Doss is an alcoholic veteran of World War I that beats their mother Bertha. One day, Desmond almost kills Hal and his life is affected by the Commandment \"Thou shalt not kill\". Years later, he meets the nurse Dorothy Schutte and they fall in love with each other. Desmond, who is Seventh-day Adventist Christian and conscientious objector, decides to join the army to serve his country in World War II; however he refuses to carry or use any weapon and requests to serve as combat medic to save lives. He faces several problems during the training and but he succeeds to go to the war to participate in the Battle of Okinawa. Will he be helpful in the battle field?::Claudio Carvalho, Rio de Janeiro, Brazil",
        "The extraordinary true story of conscientious objector Desmond T. Doss who saved 75 men in Okinawa, during the bloodiest battle of WWII, without firing a single shot. Believing that the war was just but killing was nevertheless wrong, he was the only American soldier in WWII to fight on the front lines without a weapon. As an army medic Doss single-handedly evacuated the wounded near enemy lines - braving enemy fire and putting his own life on the line. He was the first conscientious objector to ever earn the Congressional Medal of Honor.::Jwelch5742",
        "WWII American Army Medic Desmond T. Doss, who served during the Battle of Okinawa, refuses to kill people, and becomes the first man in American history to receive the Medal of Honor without firing a shot.::bravomailer"
    ],
    "language": {
        "id": [
            "English",
            "Japanese"
        ],
        "adult_language_percentage": 2.1946669592889276,
        "linguistic_difficulty_percentage": 0.03292000438933392,
        "words_per_minute": 65,
        "common_words": {
            "go": 76,
            "get": 75,
            "got": 71,
            "okay": 65,
            "doss": 60,
            "come": 59,
            "sir": 59,
            "right": 56,
            "going": 53,
            "let": 47
        }
    }
}