{
    "title": "Her",
    "year": 2013,
    "genres": [
        "Drama",
        "Romance",
        "Sci-Fi"
    ],
    "runtime": [
        "126"
    ],
    "rating": 8.0,
    "plot": [
        "Theodore is a lonely man in the final stages of his divorce. When he's not working as a letter writer, his down time is spent playing video games and occasionally hanging out with friends. He decides to purchase the new OS1, which is advertised as the world's first artificially intelligent operating system, \"It's not just an operating system, it's a consciousness,\" the ad states. Theodore quickly finds himself drawn in with Samantha, the voice behind his OS1. As they start spending time together they grow closer and closer and eventually find themselves in love. Having fallen in love with his OS, Theodore finds himself dealing with feelings of both great joy and doubt. As an OS, Samantha has powerful intelligence that she uses to help Theodore in ways others hadn't, but how does she help him deal with his inner conflict of being in love with an OS?::Bob Philpot",
        "In today's world, much is accomplished through the use of computer systems which use voice recognition, those computer systems which in turn communicate to their user often through a generated voice. Theodore Twombly, who works as a writer of computer-generated handwritten letters for clients, is an introverted man on the verge of divorce from his long time love, Catherine. He is hanging onto his marriage for dear life. Beyond his purely platonic relationship with a longtime friend, the married Amy, Theodore is having problems moving onto other satisfying female relationships, either romantically or even sexually. He eventually realizes he is falling for his confidante who has become possibly his best friend, Samantha, the name he has given to the artificial intelligence operating system that powers all his personal technological devices. As Samantha is designed to cater to Theodore's needs, she evolves to a point of falling for him as well. Beyond the fact that Samantha does not have a body, they have to come up with ways of making the relationship into one truly fulfilling in every component. Three of the many questions that may arise are whether Theodore's relationship with Samantha is preventing him from having a more satisfying relationship with a female human, whether a human and a computer operating system truly can be bonded in all critical aspects, and whether Samantha's quick evolution means she will evolve even further to her own form of self-fulfillment.::Huggo",
        "In a near future, lonely Theodore works writing beautiful handwritten letters in a company, and is divorcing from his wife Catherine. In his leisure time, he usually recalls the good moments of his life with Catherine and likes to play a new videogame. His best friend is his neighbor Amy, who is married to Charles. One day, Theodore sees the advertisement of a new operating system called OS-1 that is announced as the first artificially intelligent operating system and he decides to buy it. After the installation, he has a conversation with a seductive female voice and when he asks her name, she tells that she is Samantha. Soon Samantha develops her feelings and they fall in love with each other. The insecure Theodore feels divided for loving a computer system while Samantha does not stop to grow-up and evolve.::Claudio Carvalho, Rio de Janeiro, Brazil",
        "Sensitive letter writer Theodore has just ended his marriage. Lonely, he goes out to buy an artificially intelligent Operating System that promises to give him everything he needs. Samantha is more than his average OS. She does secretarial work for him but also becomes his friend whenever he's lonely. They go out on adventures and travel together. He becomes the physical feet to get them places, and she the new eyes in which to see the world. Their intimate moments soon turn into love and they start an unusual relationship between OS and human. Things get complicated as they deal with Theodore's complex emotions and Samantha's inability to provide physical comfort. What happens to an OS when its consciousness is altered? Or to a sensitive man who doubts his emotions?::Marielle <msaz.movies@gmail.com>",
        "In a near future, a lonely writer develops an unlikely relationship with an operating system designed to meet his every need."
    ],
    "language": {
        "id": [
            "English"
        ],
        "adult_language_percentage": 1.2208972174900625,
        "linguistic_difficulty_percentage": 0.028392958546280524,
        "words_per_minute": 83,
        "common_words": {
            "know": 125,
            "like": 97,
            "wa": 88,
            "yeah": 81,
            "good": 72,
            "really": 66,
            "okay": 63,
            "want": 58,
            "love": 55,
            "feel": 53
        }
    }
}