{
    "title": "His Girl Friday",
    "year": 1940,
    "genres": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "runtime": [
        "92"
    ],
    "rating": 8.0,
    "plot": [
        "Having been away for four months, Hildy Johnson walks into the offices of the New York City based The Morning Post, where she is a star reporter, to tell her boss, editor Walter Burns, that she is quitting. The reason for her absence was among other things to get a Reno divorce, from, of all people, Walter, who admits he was a bad husband. Hildy divorced Walter largely because she wanted more of a home life, whereas Walter saw her more as a driven hard-boiled reporter than subservient homemaker. Hildy has also come to tell Walter that she is taking the afternoon train to Albany, where she will be getting married tomorrow to staid straight-laced insurance agent, Bruce Baldwin, with whose mother they will live, at least for the first year. Walter doesn't want to lose Hildy, either as a reporter or a wife, and if he does, doesn't believe Bruce is worthy of her. Walter does whatever he can at least to delay Hildy and Bruce's trip, long enough to persuade Hildy to stay for good. His plan includes doing whatever he can to place Bruce in a bad light, while dangling a big story under her nose, namely covering what the newspaper believes is the unfair imminent execution of convicted cop killer, Earl Williams. Hildy doesn't trust Walter in dealing with her and Bruce in an above board manner, but the lure of what potentially may become the biggest story in years, which includes true love, a bumbling sheriff and a corrupt mayor, the latter's actions largely in light of an upcoming election, may prove to be too much for Hildy to resist, especially if it ends up being an exclusive. Regardless of the story outcome, Hildy will have to decide if the thrill of the chase was worth the anguish on her personal life.::Huggo",
        "When newspaper editor Walter Burns learns that his ex-wife and top reporter Hildy Johnson is quitting to marry Bruce Baldwin, he pulls out all of the stops to get her to stay. The newspaper has been championing the cause of a man on death row, Earl Williams, was convicted of killing a policeman and Walter convinces her to write a story on his case. Williams insists that the shooting was an accident and he's not crazy, as some believe. While Hildy pursues the story, Burns has her fiancé arrested - multiple times. When Hildy gets the scoop of the year - Williams escapes from prison on the eve of his planned execution - she hides him in the police station and mayhem ensues. It also gives her a chance to decide just what she wants in the future.::garykmcd",
        "Four months after her resignation journalist Hildy Johnson returns to The Morning Post - just to tell her former boss and husband Walter Burns to stop bombarding her with telegrams, because she won't come back to him, and anyway, she is going to marry insurance agent Bruce Baldwin the next day. When Walter learns that Hildy and Bruce are going to Albany already in two hours, he has to act very quickly. He immediately starts a series of clever schemes to get Bruce out of the way and Hildy back to journalism. He knows that Hildy cannot resist an enticing commission. Earl Williams is a confused man, who is going to be executed the following day, if not The Morning Post succeeds in convincing the governor to pardon him. Hildy sees the possibilities to get a scoop by interviewing Williams, and postpones her departure some hours. She gets more and more entangled in the case, and even helps Williams to hide, when he has run away from prison. Soon she and Walter work feverishly side by side, and her fiancé Bruce just annoys her.::Maths Jesperson {maths.jesperson1@comhem.se}",
        "Walter Burns (Cary Grant) is a hard-boiled editor for The Morning Post who learns his ex-wife and former star reporter, Hildegard \"Hildy\" Johnson (Rosalind Russell), is about to marry bland insurance man Bruce Baldwin (Ralph Bellamy) and settle down to a quiet life as a wife and mother in Albany, New York. Walter determines to sabotage these plans, enticing the reluctant Hildy to cover one last story, the upcoming execution of convicted murderer Earl Williams (John Qualen).::Waleed El Kady",
        "Walter Burns, editor of a major Chicago newspaper, is about to lose his ace reporter and former wife, Hildy Johnson, to insurance salesman Bruce Baldwin, but not without a fight! The crafty editor uses every trick in his fedora to get Hildy to write one last big story, about murderer Earl Williams and the inept Sheriff Hartwell. The comedy snowballs as William's friend, Molly Malloy, the crooked Mayor, and Bruce's mother all get tied up in Walter's web.::Steve Fenwick <scf@w0x0f.com>",
        "A newspaper editor uses every trick in the book to keep his ace reporter ex-wife from remarrying.::Anonymous"
    ],
    "language": {
        "id": [
            "English",
            "French"
        ],
        "adult_language_percentage": 1.0020989911300697,
        "linguistic_difficulty_percentage": 0.0947931478096012,
        "words_per_minute": 160,
        "common_words": {
            "get": 129,
            "know": 97,
            "got": 87,
            "wa": 73,
            "williams": 71,
            "hildy": 68,
            "right": 68,
            "like": 62,
            "want": 61,
            "bruce": 59
        }
    }
}