{
    "title": "In the Mood for Love",
    "year": 2000,
    "genres": [
        "Drama",
        "Romance"
    ],
    "runtime": [
        "98"
    ],
    "rating": 8.1,
    "plot": [
        "Set in Hong Kong, 1962, Chow Mo-Wan is a newspaper editor who moves into a new building with his wife. At the same time, Su Li-zhen, a beautiful secretary and her executive husband also move in to the crowded building. With their spouses often away, Chow and Li-zhen spend most of their time together as friends. They have everything in common from noodle shops to martial arts. Soon, they are shocked to discover that their spouses are having an affair. Hurt and angry, they find comfort in their growing friendship even as they resolve not to be like their unfaithful mates.::Anonymous",
        "1962, Hong Kong. On the exact same two days, Mr. and Mrs. Chow and Mr. and Mrs. Chan, who don't know each other, rent a room in adjacent flats from the resident owner, Mr. and Mrs. Koo and Mrs. Suen respectively, and move into their room. They join the friendly relationship that exists between their landlords and the other residents of the building, although the Chows and Chans' entry into the relationships are more cordial than friendly. With Mrs. Chow and Mr. Chan often out of town either on business or personal matters, Mr. Chow and Mrs. Chan lead a somewhat emotionally lonely existence. The cordiality and emotional isolation extend to Mr. Chow and Mrs. Chan's working lives. Mr. Chan, a newspaper journalist who would rather be writing martial arts serials, has as his closest work colleague Ping, a gambler who often takes advantage of that friendship. And Mrs. Chan's job as a secretary to married Mr. Ho largely entails her handling his personal affairs, including managing and facilitating his affair with Miss Yu, something she cannot talk about to anyone. Eventually, Mr. Chow and Mrs. Chan individually come to the realization that their respective spouses are having an affair with each other, mostly taking place when they are out of town together. In dealing with this joint betrayal of their respective marriages, Mr. Chow and Mrs. Chan begin spending time together. Despite they not doing anything untoward with each other, they do not tell anyone of their time together in the inappropriateness of two married people of the opposite sex being alone with each other. As they try to figure out what to do about their respective marriages, the situation becomes more complicated when they admit that they are falling in love with each other, something that neither intended when they began their friendship.::Huggo",
        "Hong Kong, 1962. Two married couples, the Chans and the Chows, move in next door to each other. Mr Chan is hardly around, regularly disappearing overseas on business. Mrs Chow works odd hours and also tends to go overseas a lot. Mrs Chan and Mr Chow are initially just neighbors but over time a friendship blossoms, and then develops into something more.::grantss",
        "Hong Kong, 1962, chief editor of a local newspaper, Chau and his wife move into new accommodation of Shanghainese building where he meets Li-chun, who lives in next-door and moves in the same day. It's also a coincidence that both of them are moving in without help from their spouses. As both of their couples are always out for work, they spend more and more time together. One day, they both realize that their particular spouses are having an affair and the discovery shocks both of them...::L.H. Wong <lhw@sfs.org.sg>",
        "Two neighbors, a woman and a man, form a strong bond after both suspect extramarital activities of their spouses. However, they agree to keep their bond platonic so as not to commit similar wrongs.::Skip_4591"
    ],
    "language": {
        "id": [
            "Cantonese",
            "Shanghainese",
            "French",
            "Spanish"
        ],
        "adult_language_percentage": 0.6419858763107211,
        "linguistic_difficulty_percentage": 0.0,
        "words_per_minute": 47,
        "common_words": {
            "mrs": 44,
            "chan": 33,
            "yes": 33,
            "mr": 33,
            "back": 30,
            "wa": 27,
            "husband": 25,
            "know": 25,
            "want": 24,
            "go": 23
        }
    }
}