{
    "title": "Inglourious Basterds",
    "year": 2009,
    "genres": [
        "Adventure",
        "Drama",
        "War"
    ],
    "runtime": [
        "153"
    ],
    "rating": 8.3,
    "plot": [
        "In German-occupied France, young Jewish refugee Shosanna Dreyfus witnesses the slaughter of her family by Colonel Hans Landa. Narrowly escaping with her life, she plots her revenge several years later when German war hero Fredrick Zoller takes a rapid interest in her and arranges an illustrious movie premiere at the theater she now runs. With the promise of every major Nazi officer in attendance, the event catches the attention of the \"Basterds\", a group of Jewish-American guerrilla soldiers led by the ruthless Lt. Aldo Raine. As the relentless executioners advance and the conspiring young girl's plans are set in motion, their paths will cross for a fateful evening that will shake the very annals of history.::The Massie Twins",
        "During World War II a group of American soldiers are sent into Europe to kill Nazis. They've become so good at it that the Germans refer to them as The Basterds. Later, they work with a British officer who was sent to formalize a plan to kill several high ranking German officers at the premiere of a movie depicting the \"heroics\" of a German soldier. But something goes wrong at the meeting with their contact, a German actress, all of the members of the team who speak German are killed which complicates the plans. So the leader Lt. Raine comes up with an alternative. And another complication is the screening is being moved to a small theater because the man depicted in the movie takes a liking to the owner of the theater. And unknown to them, she is a Jew whose entire family was killed by a Nazi officer, who was tasked with rounding up the Jews and is now the security officer of the screening. And also unknown is that she has her own plans.::rcs0411@yahoo.com",
        "It's WWII, the battleground, Nazi-occupied France. The Nazis are doing whatever they need to to flush out and exterminate Jews, the most proficient and prolific of the Jew hunters being the sadistic SS Colonel Hans Landa. As such, the American military forms a unit, led by Lieutenant Aldo Raine and comprised of eight Jews, to kill as many Nazis as possible. Raine requests each of his men to bring him the scalp of at least 100 Nazis apiece. He has his own method of ensuring that those Nazis he does allow or need to let go free are scarred for life. In Paris in 1944, Joseph Goebbels, the Nazi's chief propaganda master and filmmaker, plans to debut his latest film, \"Nation's Pride\". The film, based on the victorious military exploits of Private Fredrick Zoller, stars Zoller as himself. Because of his attraction to its pretty proprietress Emmanuelle Mimieux, Zoller convinces Goebbels and the Nazi brass to hold the premiere at Mimieux's cinema. Landa is to act as chief of security for the event. When the Americans get wind of the screening and the fact that most of the Nazi highers-up will be in attendance, Raine's team is tasked with blowing up the cinema during the screening. They are assisted by renowned German actress, Bridget von Hammersmark, who has been working as a spy for the British. They believe luck is on their side when they learn that Hitler himself is scheduled to attend. Beyond being found out, Raine's team face two as of yet unknown issues. The first is Mimieux, who is really Shoshanna Dreyfus, a Jew who saw her family brutally murdered by Landa four years earlier, and who may have her own plans for Landa and the Nazis. The second is Landa, who beyond his up front mission, has another more personal mission for his life post-war unknown to anyone but himself.::Huggo",
        "A team of jewish american soldiers, are tasked to kill Adolf Hitler. But in Nazi-occupied France a young woman who escaped the slaughter of her entire jewish family, is trying to figure out a way to kill Hitler and most of all a brutal Nazi Colonel.",
        "During World War II, Lt. Aldo Raine leads his squad of Jewish-American soldiers behind enemy lines in Nazi occupied France. Their job is simple: kill the enemy. They also have a particularly violent approach to what they do scalping their victims. Soon they are known and feared throughout the German army. In Paris, Shosanna runs a cinema and through a chance meeting with a German war hero, is selected to host the premiere of one of Dr. Josef Goebbels propaganda film. With all of the German high command scheduled to attend - including Hitler, Goering and Martin Bormann - it seems like the ideal opportunity for Lt. Raine and his men to bring the war to a quick end. Shosanna, who is Jewish and whose parents and siblings were killed before her eyes, also has her own plans for the evening's festivities. When she realizes that the man who killed her family Colonel Hans Landa, known as the Jew Hunter, will also be there it makes her own plans complete.::garykmcd",
        "In Nazi-occupied France during World War II, a plan to assassinate Nazi leaders by a group of Jewish U.S. soldiers coincides with a theatre owner's vengeful plans for the same.::Brian McInnis"
    ],
    "language": {
        "id": [
            "English",
            "German",
            "French",
            "Italian"
        ],
        "adult_language_percentage": 3.3226324237560196,
        "linguistic_difficulty_percentage": 0.12841091492776885,
        "words_per_minute": 40,
        "common_words": {
            "german": 35,
            "going": 34,
            "get": 31,
            "would": 27,
            "know": 27,
            "got": 24,
            "like": 23,
            "one": 23,
            "yes": 22,
            "well": 22
        }
    }
}