{
    "title": "It's a Wonderful Life",
    "year": 1946,
    "genres": [
        "Drama",
        "Family",
        "Fantasy"
    ],
    "runtime": [
        "130"
    ],
    "rating": 8.6,
    "plot": [
        "George Bailey has spent his entire life giving of himself to the people of Bedford Falls. He has always longed to travel but never had the opportunity in order to prevent rich skinflint Mr. Potter from taking over the entire town. All that prevents him from doing so is George's modest building and loan company, which was founded by his generous father. But on Christmas Eve, George's Uncle Billy loses the business's $8,000 while intending to deposit it in the bank. Potter finds the misplaced money and hides it from Billy. When the bank examiner discovers the shortage later that night, George realizes that he will be held responsible and sent to jail and the company will collapse, finally allowing Potter to take over the town. Thinking of his wife, their young children, and others he loves will be better off with him dead, he contemplates suicide. But the prayers of his loved ones result in a gentle angel named Clarence coming to earth to help George, with the promise of earning his wings. He shows George what things would have been like if he had never been born.::alfiehitchie",
        "A young George Bailey, overwhelmed by family obligations and a sense of responsibility toward his community, feels tied down to a company he never had an interest in working for, and a life he never wanted to live. As he ages, he sees his youth, dreams and opportunities pass him by. Unknown to George, all of his friends and family have been praying for him to get through those hard times. Told through the point of view of a group of angels, he is met by his guardian angel Clarence, as he contemplates ending his life.::Marielle <msaz.movies@gmail.com>",
        "George Bailey never got a chance to fulfill his life's ambitions of exploring the world and building skyscrapers. As he watches his friends and family become success stories he dreads on running his fathers building and loan business, rivaling the grumpy old Mr. Potter. When a financial discrepancy puts George in a difficult position, an angel comes to show him what life would have been like if he had never been born.::Eric Johnson",
        "George Bailey spends his entire life giving up his big dreams for the good of his town, Bedford Falls, as we see in flashback. But in the present, on Christmas Eve, he is broken and suicidal over the misplacing of an $8000 loan and the machinations of the evil millionaire Mr. Potter. His guardian angel, Clarence, falls to Earth, literally, and shows him how his town, family, and friends would have turned out if he had never been born. George meant so much to so many people; should he really throw it all away?::Tommy Peter",
        "On the Christmas Eve of Bedford Falls, the guardian angel Clarence is assigned to convince the desperate George Bailey not to commit suicide. George is a good man that sacrificed his dreams and his youth on behalf of the citizens of his small town. He inherited the loan business of his father and he gave up traveling the world and joining University as scheduled. Later he resisted the proposals of the evil banker Mr. Potter, and never sold his business to protect the poor community of Bedford Falls and offer a means to afford to buy their own house. He married his beloved Mary Hatch Bailey and had four children with her and a tough life with his family. When his uncle Billy loses US$ 8,000.00, found and stolen by Mr. Potter, George decides to commit suicide, since he believes he worth more dead than alive. When Clarence sees that he is not able to persuade George to give up his intention, he decides to show the life in town if George had never existed.::Claudio Carvalho, Rio de Janeiro, Brazil",
        "An angel is sent from Heaven to help a desperately frustrated businessman by showing him what life would have been like if he had never existed.::Kenneth Chisholm"
    ],
    "language": {
        "id": [
            "English"
        ],
        "adult_language_percentage": 0.7006214207383941,
        "linguistic_difficulty_percentage": 0.03046180090166931,
        "words_per_minute": 126,
        "common_words": {
            "george": 216,
            "well": 133,
            "know": 130,
            "oh": 122,
            "right": 106,
            "come": 93,
            "get": 92,
            "mary": 87,
            "want": 84,
            "got": 76
        }
    }
}