{
    "title": "Jackie Brown",
    "year": 1997,
    "genres": [
        "Crime",
        "Drama",
        "Thriller"
    ],
    "runtime": [
        "154"
    ],
    "rating": 7.5,
    "plot": [
        "The middle-aged stewardess Jackie Brown smuggles money from Mexico to Los Angeles for the arms dealer Ordell Robbie. When she gets caught by the agents Ray Nicolet and Mark Dargus with ten thousand dollars and cocaine in her purse, they propose a deal to her to help them to arrest Ordell in exchange of her freedom. Meanwhile Ordell asks the 56-year-old Max Cherry, who runs a bail bond business, to release Jackie Brown with the intention of eliminating her. Jackie suspects of Ordell's intention and plots a complicated confidence game with Max to steal half a million dollars from Ordell.::Claudio Carvalho, Rio de Janeiro, Brazil",
        "Jackie Brown is the name of a flight attendant who gets caught smuggling her boss's gun money on the airline she works for. Luckily for her, Fed Ray Nicolet and L.A. cop Mark Dargus decide to team up in order to arrest the arms dealer she works for, whose name they don't even know. Here's when she has to choose one way: tell Nicolet and Dargus about Ordell Robbie (the arms dealer) and get her freedom-except that if Ordell suspects you're talking about him, you're dead-or keep her mouth shut and do some time. That's when she meets Max Cherry, her bail bondsman, a recently separated, burnt-out man in his late fifties, who falls in love with her. Then Jackie comes up with a plan to play the Feds off against Ordell and the guys he works with-Louis Gara and Melanie Ralston, among others-and walk off with their money. But she needs Max's help. No one is going to stand in the way of his million-dollar payoff.::Héctor Barca <sandman@arrakis.es>",
        "Forty-four-year-old flight attendant Jackie Brown gets caught with gun dealer Ordell Robbie's money and to get the ATF off her back she sets up Ordell with her new friend, a bail bondsman named Max Cherry. But what the ATF doesn't know, is that they are part of her wild plan to get Ordell's half million dollars and get off scot-free. However, she has to do it under the noses of both Ordell, the ATF man and a local cop. What she doesn't know is Ordell's blonde beach bunny wants the money for herself as does Ordell's ex-con friend.::Ryan Burgos",
        "A middle-aged woman finds herself in the middle of a huge conflict that will either make her a profit or cost her life.::DeeKeyera"
    ],
    "language": {
        "id": [
            "English"
        ],
        "adult_language_percentage": 2.8702841173730786,
        "linguistic_difficulty_percentage": 0.04657661853749418,
        "words_per_minute": 111,
        "common_words": {
            "know": 170,
            "got": 126,
            "yeah": 99,
            "get": 99,
            "wa": 97,
            "right": 96,
            "gonna": 81,
            "like": 79,
            "go": 73,
            "want": 73
        }
    }
}