{
    "title": "Jaws",
    "year": 1975,
    "genres": [
        "Adventure",
        "Drama",
        "Thriller"
    ],
    "runtime": [
        "124"
    ],
    "rating": 8.0,
    "plot": [
        "It's a hot summer on Amity Island, a small community whose main business is its beaches. When new Sheriff Martin Brody discovers the remains of a shark attack victim, his first inclination is to close the beaches to swimmers. This doesn't sit well with Mayor Larry Vaughn and several of the local businessmen. Brody backs down to his regret as that weekend a young boy is killed by the predator. The dead boy's mother puts out a bounty on the shark and Amity is soon swamped with amateur hunters and fisherman hoping to cash in on the reward. A local fisherman with much experience hunting sharks, Quint, offers to hunt down the creature for a hefty fee. Soon Quint, Brody and Matt Hooper from the Oceanographic Institute are at sea hunting the Great White shark. As Brody succinctly surmises after their first encounter with the creature, they're going to need a bigger boat.::garykmcd",
        "When a young women is killed out on the ocean, Cheif Police Martin Brody believes it was the works of a shark. Mayor Larry Vaughn refuses to close the beaches, which leads up to several deaths. With the help of archaeologist Matt Hooper and Captain Quint, Brody attempts to hunt down the shark.",
        "Martin Brody is the new police chief of Amity, an island town somewhere in New England. He has a wife named Ellen, and two sons named Michael and Sean. On a Summer morning, Brody is called to the beach, where the mangled body of Summer vacationer Chrissie Watkins has washed ashore. The medical examiner tells Brody that it could have been a shark that killed Watkins. Mayor Larry Vaughn, who is desperate to not lose the money that will be brought in by 4th of July tourists, wants Brody to say Watkins's death was caused by a motorboat propeller instead of a shark, because the thought of a shark in Amity's waters would drive tourists away from Amity. It looks like Vaughn is a mayor who puts money ahead of people's lives. Shark expert Matt Hooper believes Watkins was killed by a shark. Hooper is proven right a few days later, when Alex Kintner is killed by the shark that killed Watkins. Looking for the quickest solution, Vaughn tells all of the local fishermen to let him know if they see the shark. A shark hunter named Quint offers to find the shark and kill it, but Vaughn thinks Quint's price of $10,000 is too high. When a tiger shark is killed and hauled in by a couple of boaters, Vaughn hastily says that the shark crisis is over, but Hooper says the shark that's been killing people a huge great white shark is still in Amity's waters. However, Vaughn leaves the beaches opened because all he cares about is the 4th of July tourist money. On the 4th of July, Vaughn encourages people to swim at the beach, and Hooper is proven right again when the shark kills a man, biting the man's leg off. Michael, who was in the water at the time of the attack, is taken to the hospital, where he's treated for shock after watching the shark kill the guy. Brody asks Vaughn to hire Quint to find the shark. Because his own kids were at that beach too, Vaughn agrees to hire Quint to find the shark. Quint, Hooper, and Brody are sent out to sea in Quint's boat, the Orca, ready to do whatever it takes to find the shark.::Todd Baldridge",
        "The peaceful community of Amity island is being terrorized. There is something in the sea that is attacking swimmers. They can no longer enjoy the sea and the sun as they used to, and the spreading fear is affecting the numbers of tourists that are normally attracted to this island. After many attempts the great white shark won't go away and sheriff Brody, with friends Hooper and Quint decide to go after the shark and kill it.::Sami Al-Taher <staher2000@yahoo.com>",
        "A Great White Shark decides to make the small beach resort town of Amity his private feeding grounds. This greatly frustrates the town police chief who wants to close the beaches to chase the shark away. He is thwarted in his efforts by the town's mayor who finally relents when nothing else seems to work and the chief, a scientist, and an old fisherman with revenge on his mind take to the sea to kill the beast.::<drewgrgich@netzone.com>",
        "A local sheriff, a marine biologist and an old seafarer team up to hunt down a great white shark wrecking havoc in a beach resort.::Jwelch5742"
    ],
    "language": {
        "id": [
            "English"
        ],
        "adult_language_percentage": 1.604882459312839,
        "linguistic_difficulty_percentage": 0.011301989150090416,
        "words_per_minute": 71,
        "common_words": {
            "get": 75,
            "shark": 69,
            "got": 60,
            "going": 59,
            "go": 57,
            "right": 53,
            "come": 50,
            "water": 44,
            "know": 43,
            "chief": 41
        }
    }
}