{
    "title": "Judgment at Nuremberg",
    "year": 1961,
    "genres": [
        "Drama",
        "War"
    ],
    "runtime": [
        "186"
    ],
    "rating": 8.2,
    "plot": [
        "It has been three years since the most important Nazi leaders had already been tried. This trial is about 4 judges who used their offices to conduct Nazi sterilization and cleansing policies. Retired American judge, Dan Haywood has a daunting task ahead of him. The Cold War is heating up and no one wants any more trials as Germany, and Allied governments, want to forget the past. But is that the right thing to do is the question that the tribunal must decide.::Tony Fontana <tony.fontana@spacebbs.com>",
        "It's 1948 in Nuremberg, Germany, where the American military is holding a post-WWII tribunal on the activities of individuals within the Nazi Party leading up to and during the war. Dan Haywood is the lead judge in a three-man judiciary in one of those trials, where four men, who were involved in judicial matters, are the defendants. The general issues surrounding these four is whether they are guilty of international crimes or were just carrying out the laws of their national government, especially as they did not run or operate concentration camps for example, or purportedly know about what was happening to anyone they sentenced to life at those concentration camps. Of the four on trial, the largest question mark surrounds Dr. Ernst Janning, a globally renowned judge. Haywood, not being a well traveled man outside of the US, tries to get to know life in Germany, both then and now, to get a better perspective of the discussions at the trial. He befriends a Mrs. Bertholt as that conduit into German life. The counsel for the prosecution is led by Col. Tad Lawson, who wants to win at any cost, which includes trotting out the emotional aspects of the genocide at the concentration camps at whatever opportunity, regardless of if it actually applies to the defendants. The counsel for the defense is led by Hans Rolfe, who sees the proceedings as German self-determination on trial. Problems on both sides is getting the German public affected to talk about and thus testify about this emotionally traumatizing period of their past. But another issue in the background of this trial is the current Communist aggression, most specifically in Eastern Europe, and the Americans' need for German support in quashing this aggression, support which would be difficult to obtain if the Americans are putting Germans behind bars.::Huggo",
        "In 1947, four German judges who served on the bench during the Nazi regime face a military tribunal to answer charges of crimes against humanity. Chief Justice Haywood hears evidence and testimony not only from lead defendant Ernst Janning and his defense attorney Hans Rolfe, but also from the widow of a Nazi general, an idealistic U.S. Army captain and reluctant witness Irene Wallner.::Jwelch5742",
        "In 1948, an American court in occupied Germany tries four Nazi judges for war crimes.::Mark Logan <marklo@west.sun.com>"
    ],
    "language": {
        "id": [
            "English",
            "German"
        ],
        "adult_language_percentage": 1.4709925762991476,
        "linguistic_difficulty_percentage": 0.06873797085510036,
        "words_per_minute": 39,
        "common_words": {
            "wa": 86,
            "yes": 53,
            "know": 44,
            "would": 39,
            "like": 35,
            "good": 28,
            "honor": 28,
            "judge": 27,
            "thank": 25,
            "see": 22
        }
    }
}