{
    "title": "Life Is Beautiful",
    "year": 1997,
    "genres": [
        "Comedy",
        "Drama",
        "War"
    ],
    "runtime": [
        "116"
    ],
    "rating": 8.6,
    "plot": [
        "In 1930s Italy, a carefree Jewish book keeper named Guido starts a fairy tale life by courting and marrying a lovely woman from a nearby city. Guido and his wife have a son and live happily together until the occupation of Italy by German forces. In an attempt to hold his family together and help his son survive the horrors of a Jewish Concentration Camp, Guido imagines that the Holocaust is a game and that the grand prize for winning is a tank.::Anthony Hughes <husnock31@hotmail.com>",
        "In 1939, Jewish-Italian Guido Orefice comes into Arezzo, Italy, ultimately to open a book store. In the meantime, he will work as a waiter at the hotel restaurant where his Uncle Eliseo is the maître d'. In town, he meets a school teacher named Dora, who he calls Princess and who comes from a wealthy Italian family. For him, it's love at first sight. Despite she already being in a relationship with another man, Guido ultimately sweeps her off her feet. They get married and have a son they name Giosué. On Giosué's fifth birthday, World War II is in full force. Since they are Jewish, the Germans take away Guido, Eliseo and Giosué to a labor camp. Wanting to be with her family, Dora insists she be taken too, but she is housed in the women's side of the camp. To protect Giosué from the horror of what is happening to them, Guido tells him that they are playing a game, certain actions which garner points, other actions which take points away or disqualify one from the game. The first to reach 1,000 points wins the prize of a real tank. Guido's primary goal is to keep Giosué safe at all cost, while he tries to figure out a way to get his family out of the camp and keep the Germans at bay from learning what he is doing with Giosué.::Huggo",
        "A gentle Jewish-Italian waiter, Guido Orefice, meets Dora, a pretty schoolteacher, and wins her over with his charm and humor. Eventually they marry and have a son, Giosue. Their happiness is abruptly halted, however, when Guido and Giosue are separated from Dora and taken to a concentration camp. Determined to shelter his son from the horrors of his surroundings, Guido convinces Giosue that their time in the camp is merely a game.::Jwelch5742",
        "It's 1939. The ebullient, playful Guido comes to town. He works as a waiter under the watchful eye of his uncle, an elegant man who is a Jew. Guido falls for Dora, a schoolteacher, whom he calls \"princess\" and courts by popping up at unexpected times. She dumps her fiancé to choose Guido. The film jumps ahead to the war's last months. Nora and Guido have a child, Giosué, and when Guido and the lad are shipped to a concentration camp, Dora voluntarily follows. Although the men and women in the camp are separated and a child is in mortal peril, Guido finds ways to communicate with Dora, to hide Giosué, and to convince the boy this is an elaborate game, a special contest to win a tank.::<jhailey@hotmail.com>",
        "When an open-minded Jewish librarian and his son become victims of the Holocaust, he uses a perfect mixture of will, humor, and imagination to protect his son from the dangers around their camp.::J. S. Golden"
    ],
    "language": {
        "id": [
            "Italian",
            "German",
            "English"
        ],
        "adult_language_percentage": 0.9578320289685783,
        "linguistic_difficulty_percentage": 0.0350426352061675,
        "words_per_minute": 73,
        "common_words": {
            "go": 80,
            "get": 64,
            "want": 50,
            "right": 44,
            "take": 43,
            "come": 42,
            "one": 41,
            "see": 36,
            "let": 35,
            "good": 34
        }
    }
}