{
    "title": "Live Free or Die Hard",
    "year": 2007,
    "genres": [
        "Action",
        "Adventure",
        "Thriller"
    ],
    "runtime": [
        "128"
    ],
    "rating": 7.2,
    "plot": [
        "When someone hacks into the computers at the FBI's Cyber Crime Division; the Director decides to round up all the hackers who could have done this. When he's told that because it's the 4th of July most of their agents are not around so they might have trouble getting people to get the hackers. So he instructs them to get local PD'S to take care of it. And one of the cops they ask is John McClane who is tasked with bringing a hacker named Farrell to the FBI. But as soon as he gets there someone starts shooting at them. McClane manages to get them out but they're still being pursued. And it's just when McClane arrives in Washington that the whole system breaks down and chaos ensues.::rcs0411@yahoo.com",
        "NYPD Detective John McClane lives in Brooklyn, and he's now divorced from Holly Gennero, who lives in San Francisco. John has faced some brutal terrorists in his career, but now, he's about to face what may be his most dangerous enemy yet. John, who occasionally does jobs for the United States Department of Homeland Security, receives a call to bring in a hacker named Matt Farrell, because there has been a breach in an FBI computer system. Farrell is one of the many hackers who are suspected in the attack, and all known hackers are to be questioned. But after John gets to Matt's apartment, a group of men show up and try to kill John and Matt, who barely escape with their lives. As it turns out, a group of terrorists led by Thomas Gabriel are systematically shutting down the United States computer infrastructure. They crash the stock market, crippling America's economy. It turns out that Matt knows enough about hacking to know exactly how Gabriel is shutting down the USA. Gabriel, a disgraced former Department of Defense employee, plans to bring the country to its knees, but he doesn't count on John and Matt figuring out what's going on. Gabriel wants John and Matt out of the way, and for John, the situation becomes personal when an enraged Gabriel kidnaps John's daughter Lucy, who is a student at Rutgers University in New Jersey. Gabriel may think he now has the upper hand on John, but he has no idea how far John is willing to go to rescue Lucy.::Todd Baldridge",
        "12 years after after John McClane stopped Simon Gruber, he's back with a problem which is going to be more difficult and personal than ever before. An organization of Internet-based terrorist led by Thomas Gabriel. They are taking control of everything in America from their computers and slowly taking over the country. Accompanied by Matthew Farrell, one of the hackers who accidentally assisted the villains in setting up the system, McClane must both find Gabriel and help prevent him from taking over America completely. Gabriel knows McClane's on his way, and will make it as personal as possible, which means involving McClane's daughter, Lucy.::Film_Fan",
        "On the July 4th holiday, an attack on the vulnerable United States infrastructure begins to shut down the entire nation! But as New York City police detective John McClane delivers old-school justice to a new breed of terrorist when a massive computer attack hacker on the U.S. infrastructure threatens to shut down the entire country over Independence Day weekend!::Anthony Pereyra {hypersonic91@yahoo.com}",
        "When a criminal plot is in place to take down the entire computer and technological structure that supports the economy of the United States (and the world), it's up to a decidedly \"old school\" hero, police detective John McClane, to take down the conspiracy, aided by a young hacker.::Anonymous",
        "John McClane and a young hacker join forces to take down master cyber-terrorist Thomas Gabriel in Washington D.C.::rball4042"
    ],
    "language": {
        "id": [
            "English",
            "Italian",
            "French"
        ],
        "adult_language_percentage": 2.6346919023550917,
        "linguistic_difficulty_percentage": 0.09678460049467684,
        "words_per_minute": 72,
        "common_words": {
            "get": 94,
            "ok": 76,
            "right": 73,
            "go": 70,
            "come": 60,
            "know": 57,
            "yeah": 50,
            "got": 44,
            "let": 41,
            "mcclane": 36
        }
    }
}