{
    "title": "Logan",
    "year": 2017,
    "genres": [
        "Action",
        "Drama",
        "Sci-Fi",
        "Thriller"
    ],
    "runtime": [
        "137"
    ],
    "rating": 8.1,
    "plot": [
        "In 2029 the mutant population has shrunken significantly due to genetically modified plants designed to reduce mutant powers and the X-Men have disbanded. Logan, whose power to self-heal is dwindling, has surrendered himself to alcohol and now earns a living as a chauffeur. He takes care of the ailing old Professor X whom he keeps hidden away. One day, a female stranger asks Logan to drive a girl named Laura to the Canadian border. At first he refuses, but the Professor has been waiting for a long time for her to appear. Laura possesses an extraordinary fighting prowess and is in many ways like Wolverine. She is pursued by sinister figures working for a powerful corporation; this is because they made her, with Logan's DNA. A decrepit Logan is forced to ask himself if he can or even wants to put his remaining powers to good use. It would appear that in the near-future, the times in which they were able put the world to rights with razor sharp claws and telepathic powers are now over.",
        "In the not-so-distant 2029, the entire mutant race is almost obliterated, and Logan, the invincible bestial superhero once known as the Wolverine, finds himself getting old, and his incredible healing ability significantly weakened. As an incognito limo driver, Logan does his best to guard and keep out of sight a weary nonagenarian Professor Xavier; however, things will take an unexpected turn when a cryptic woman asks him to transport the young mutant girl, Laura. A better future lies past the Canadian borders for the unaccompanied teenager, but the government is unwilling to let go of its asset so easily. In the end, can the ageing Logan protect both himself and Laura?::Nick Riganas",
        "In the near future, a weary Logan cares for an ailing Professor X, somewhere on the Mexican border. However, Logan's attempts to hide from the world, and his legacy, are upended when a young mutant arrives, pursued by dark forces."
    ],
    "language": {
        "id": [
            "English",
            "Spanish"
        ],
        "adult_language_percentage": 2.518321119253831,
        "linguistic_difficulty_percentage": 0.0932711525649567,
        "words_per_minute": 54,
        "common_words": {
            "go": 68,
            "get": 60,
            "know": 50,
            "logan": 43,
            "wa": 41,
            "hey": 38,
            "come": 38,
            "right": 37,
            "fuck": 34,
            "laura": 33
        }
    }
}