{
    "title": "Magnolia",
    "year": 1999,
    "genres": [
        "Drama"
    ],
    "runtime": [
        "188"
    ],
    "rating": 8.0,
    "plot": [
        "24 hours in L.A.; it's raining cats and dogs. Two parallel and intercut stories dramatize men about to die: both are estranged from a grown child, both want to make contact, and neither child wants anything to do with dad. Earl Partridge's son is a charismatic misogynist; Jimmy Gator's daughter is a cokehead and waif. A mild and caring nurse intercedes for Earl, reaching the son; a prayerful and upright beat cop meets the daughter, is attracted to her, and leads her toward a new calm. Meanwhile, guilt consumes Earl's young wife, while two whiz kids, one grown and a loser and the other young and pressured, face their situations. The weather, too, is quirky.::<jhailey@hotmail.com>",
        "In the style of Ripley's Believe It Or Not, coincidence has played a part in three bizarre deaths during the past century... Jimmy Gator has hosted the popular quiz show \"What Do Kids Know?\" in Los Angeles for over 30 years. Stanley is the brightest of the three kids currently reigning on the show. Jimmy is estranged from his daughter, Claudia. Living in her cheap apartment, Claudia is hooked on cocaine. Donnie Smith had been a famous whiz kid on Jimmy's show decades ago. Since being hit by lightning, he does promotional work for the Solomon Bros. appliance store and dreams of getting an expensive set of braces for his teeth. Frank Mackey is a very successful motivational speaker. His aggressive seminar on dating, \"Seduce and Destroy\", is well attended by frustrated bachelors. Officer Kurring answers a call at a woman's apartment and finds a corpse in her closet. Affluent producer Earl Partridge is bedridden and dying of cancer. His beautiful wife Linda married him for his money... The quiz show kids are close to setting an all-time record; Stanley feels the pressure from his father. Jimmy has learned that he has cancer and only two months to live. Officer Kurring arrives at an apartment where neighbours have complained about the noise; Claudia opens the door. Earl asks Phil, his nurse, to contact his estranged son; the younger Partridge now uses the name Frank Mackey...::David Woodfield",
        "The film begins with a narrator telling us three separate stories based on the theme of coincidence. From there, we meet 9 characters whose lives are all connected in one way or another. We follow them all over the course of one day and watch their lives change forever.::John Reeler",
        "An epic mosaic of interrelated characters in search of love, forgiveness, and meaning in the San Fernando Valley.::Sean C."
    ],
    "language": {
        "id": [
            "English",
            "German",
            "French"
        ],
        "adult_language_percentage": 2.7829910450962516,
        "linguistic_difficulty_percentage": 0.01608665343986273,
        "words_per_minute": 99,
        "common_words": {
            "know": 165,
            "go": 128,
            "okay": 120,
            "right": 99,
            "yeah": 93,
            "get": 91,
            "fucking": 87,
            "uh": 85,
            "gonna": 78,
            "thing": 75
        }
    }
}