{
    "title": "Memento",
    "year": 2000,
    "genres": [
        "Mystery",
        "Thriller"
    ],
    "runtime": [
        "113"
    ],
    "rating": 8.5,
    "plot": [
        "Memento chronicles two separate stories of Leonard, an ex-insurance investigator who can no longer build new memories, as he attempts to find the murderer of his wife, which is the last thing he remembers. One story line moves forward in time while the other tells the story backwards revealing more each time.::Scion013",
        "A memory inside a memory, Memento is a complicated head spinning adventure. Leonard is determined to avenge his wife's murder. However, unable to remember anything that happens day-to-day due to a condition he sustained, short term memory loss, he has to write himself note after note that still don't mean anything after he falls asleep. The film goes back in time to reveal each little bit of the puzzle as he tries to find out the person who killed his wife and makes the audience feel just as confused as he is. The narrative closely follows a phone call Pearce has in which he talks about Sammy Jankis a former client of his who he believed had the same condition. The film takes an unexpected twist as the two characters have a lot more in common than is initially put across.::gab_b270@hotmail.com",
        "Leonard Shelby has short term memory loss resulting from an injury he sustained which was associated with the murder of his wife. He remembers his life prior to the incident, such as being an insurance claims investigator. He has learned to cope with his memory loss through dealing with a man named Sammy Jankis, a person he investigated professionally who also had short term memory issues. Some of these coping mechanism are to have a system of where to place things, talk to people face-to-face if possible rather than on the telephone as to be able to gauge their true intention, take Polaroids and write copious notes, the most important of those which he tattoos on his body so that they become permanent. Leonard's current mission is to find and kill his wife's murderer, who he believes is a man named John G., a name which is tattooed on his body. Over the course of a day, Leonard is assisted in this mission by a few people seemingly independent of each other, including a man named Teddy and a woman named Natalie. However, each time he meets them, he has no idea who they are, why they are helping him and if indeed they are working toward the same goal as him.::Huggo",
        "Leonard is an insurance investigator whose memory has been damaged following a head injury he sustained after intervening on his wife's murder. His quality of life has been severely hampered after this event, and he can now only live a comprehendable life by tattooing notes on himself and taking pictures of things with a Polaroid camera. The movie is told in forward flashes of events that are to come that compensate for his unreliable memory, during which he has liaisons with various complex characters. Leonard badly wants revenge for his wife's murder, but, as numerous characters explain, there may be little point if he won't remember it in order to provide closure for him. The movie veers between these future occurrences and a telephone conversation Leonard is having in his motel room in which he compares his current state to that of a client whose claim he once dealt with.::<tgraham@currantbun.com>",
        "Point blank in the head a man shoots another. In flashbacks, each one earlier in time than what we've just seen, the two men's pasts unfold. Leonard, as a result of a blow to the head during an assault on his wife, has no short-term memory. He's looking for his wife's killer, compensating for his disability by taking Polaroids, annotating them and tattooing important facts on his body. We meet the loquacious Teddy and the seductive Natalie (a barmaid who promises to help) and we glimpse Leonard's wife through memories from before the assault. Leonard also talks about Sammy Jankis, a man he knew with a similar condition. Has Leonard found the killer? Who's manipulating whom?::<jhailey@hotmail.com>",
        "A man with short-term memory loss attempts to track down his wife's murderer.::Noah Orent"
    ],
    "language": {
        "id": [
            "English"
        ],
        "adult_language_percentage": 2.1834061135371177,
        "linguistic_difficulty_percentage": 0.06390456917669612,
        "words_per_minute": 83,
        "common_words": {
            "know": 105,
            "sammy": 70,
            "wa": 66,
            "remember": 58,
            "get": 52,
            "guy": 46,
            "yeah": 45,
            "like": 41,
            "gonna": 39,
            "fuck": 38
        }
    }
}