{
    "title": "Million Dollar Baby",
    "year": 2004,
    "genres": [
        "Drama",
        "Sport"
    ],
    "runtime": [
        "132"
    ],
    "rating": 8.1,
    "plot": [
        "Wanting to learn from the best, aspiring boxer Maggie Fitzgerald wants Frankie Dunn to train her. At the outset he flatly refuses saying he has no interest in training a girl. Frankie leads a lonely existence, alienated from his only daughter and having few friends. Maggie's rough around the edges but shows a lot of grit in the ring and he eventually relents. Maggie not only proves to be the boxer he always dreamed of having under his wing but a friend who fills the great void he's had in his life. Maggie's career skyrockets but an accident in the ring leads her to ask Frankie for one last favor.::garykmcd",
        "Frankie Dunn (played by Clint Eastwood) owns and runs a boxing gym in Los Angeles, as well as managing some of the boxers there. Working for him is Eddie Scrap-Iron Dupris (Morgan Freeman). One day he is approached by Maggie Fitzgerald (Hillary Swank) who wants him to train her. He declines. Undeterred, Maggie joins his gym, hoping that he'll notice her and train. He is equally perseverant, knocking back all her requests to train her. However, eventually she wears him down and he trains her and manages her fight career. Her career goes very well and she now has a shot at the WBA title. Her opponent, the champion, does not play fair though...::grantss",
        "Frankie Dunn is a veteran Los Angeles boxing trainer who keeps almost everyone at arm's length, except his old friend and associate Eddie \"Scrap Iron\" Dupris. When Maggie Fitzgerald arrives in Frankie's gym seeking his expertise, he is reluctant to train the young woman, a transplant from working-class Missouri. Eventually, he relents, and the two form a close bond that will irrevocably change them both.::Jwelch5742",
        "Frankie Dunn has trained and managed some incredible fighters during a lifetime spent in the ring. The most important lesson he teaches his boxers is the one that rules life: above all, always protect yourself. In the wake of a painful estrangement from his daughter, Frankie has been unwilling to let himself get close to anyone for a very long time. His only friend, Scrap, an ex-boxer who looks after Frankie's gym, knows that beneath his gruff exterior is a man who has been seeking, for the past 25 years, the forgiveness that somehow continues to elude him. Then Maggie Fitzgerald walks into his gym...::Any",
        "Maggie Fitzgerald, a poor thirty-one year old waitress from the very lower classes and with a dysfunctional loser family, decides to make a difference through boxing. She convinces the experienced hardened boxing trainer Frankie Dunn to coach her and be her manager, with the support of his old partner Eddie Scrap-Iron Dupris, who sees her potential as a boxer. Frankie has a problematical relationship with his daughter, and practically adopts Maggie along her career.::Steve Mundy",
        "A determined woman works with a hardened boxing trainer to become a professional.::Anonymous"
    ],
    "language": {
        "id": [
            "English",
            "Irish"
        ],
        "adult_language_percentage": 2.1946086782242706,
        "linguistic_difficulty_percentage": 0.04008417677121956,
        "words_per_minute": 75,
        "common_words": {
            "got": 76,
            "fight": 65,
            "right": 61,
            "come": 58,
            "wa": 57,
            "good": 56,
            "well": 55,
            "know": 54,
            "one": 53,
            "get": 52
        }
    }
}