{
    "title": "Moana",
    "year": 2016,
    "genres": [
        "Animation",
        "Adventure",
        "Comedy",
        "Family",
        "Fantasy",
        "Musical"
    ],
    "runtime": [
        "107"
    ],
    "rating": 7.6,
    "plot": [
        "Moana Waialiki is a sea voyaging enthusiast and the only daughter of a chief in a long line of navigators. When her island's fishermen can't catch any fish and the crops fail, she learns that the demigod Maui caused the blight by stealing the heart of the goddess, Te Fiti. The only way to heal the island is to persuade Maui to return Te Fiti's heart, so Moana sets off on an epic journey across the Pacific. The film is based on stories from Polynesian mythology.::Anonumous",
        "Moana is a daughter of the chief of her tribe. Coming from a long line of navigators she sets off for a fabled island with the demigod Maui. Along the voyage they battle all which the ocean hides, while learning what the power of persistence and faith can accomplish.",
        "An adventurous teenager sails out on a daring mission to save her people. During her journey, Moana meets the once-mighty demigod Maui, who guides her in her quest to become a master wayfinder. Together, they sail across the open ocean on an action-packed voyage, encountering enormous monsters and impossible odds. Along the way, Moana fulfills the ancient quest of her ancestors and discovers the one thing she always sought: her own identity.::Jwelch5742",
        "In Ancient Polynesia, when a terrible curse incurred by the Demigod Maui reaches Moana's island, she answers the Ocean's call to seek out the Demigod to set things right.::Kenneth Chisholm"
    ],
    "language": {
        "id": [
            "English"
        ],
        "adult_language_percentage": 1.125674633770239,
        "linguistic_difficulty_percentage": 0.0,
        "words_per_minute": 60,
        "common_words": {
            "maui": 48,
            "know": 48,
            "heart": 42,
            "moana": 42,
            "te": 40,
            "go": 39,
            "one": 38,
            "island": 31,
            "back": 31,
            "get": 31
        }
    }
}