{
    "title": "Monsters, Inc.",
    "year": 2001,
    "genres": [
        "Animation",
        "Adventure",
        "Comedy",
        "Family",
        "Fantasy"
    ],
    "runtime": [
        "92"
    ],
    "rating": 8.1,
    "plot": [
        "A city of monsters with no humans called Monstropolis centers around the city's power company, Monsters, Inc. The lovable, confident, tough, furry blue behemoth-like giant monster named James P. Sullivan (better known as Sulley) and his wisecracking best friend, short, green cyclops monster Mike Wazowski, discover what happens when the real world interacts with theirs in the form of a 2-year-old baby girl dubbed \"Boo,\" who accidentally sneaks into the monster world with Sulley one night. And now it's up to Sulley and Mike to send Boo back in her door before anybody finds out, especially two evil villains such as Sulley's main rival as a scarer, chameleon-like Randall (a monster that Boo is very afraid of), who possesses the ability to change the color of his skin, and Mike and Sulley's boss Mr. Waternoose, the chairman and chief executive officer of Monsters, Inc.::Anthony Pereyra {hypersonic91@yahoo.com}",
        "Sully and Mike are 2 monster employees that work at a lighting/scaring company known as Monsters Inc and are close to breaking the all-time scare record. While mike is out with his girlfriend, Selia, Sully finds a door while looking for mike's paper and something else-a human child running amok in the city! Left with no other choice, sully must now seek help from mike to return the child before everyone finds out and Armageddon breaks out",
        "James P. Sullivan (AKA \"Sulley\") and Mike Wazowski pick up their paychecks at Monsters Inc., the utility company that generates energy from the goose bumps of children. Sulley, the No. 1 scream-generator at the plant accidentally lets in a little girl into the monster world. Since monsters are actually terrified of children it's a major cause for alarm and a major headache for Sulley and Mike.::Anonymous",
        "In a land of monsters, James P. Sullivan is king. He and his coworker/ friend Mike Wazowski are two of many monsters that work for Monsters Inc. a utility company that generates power for a very paranoid and nervous city of monsters. This power, oddly enough, is generated from the screams of children, which is produced by scaring them in their sleep. One night, however, Sully uncovers a devious plot to rid Monster city of it's power problems, but in all the wrong ways. Together, ironically, Sully and Mike will fight to protect the innocence of the children they scare every night.::Redblok",
        "In the world behind our closet doors, monsters like Mike and Sulley work hard for their income. To be exact, the monster world depends on our children's screams: It is their energy that makes lightbulbs glow and cars drive. Big companies like Monsters, Inc. collect the scream energy, and many monsters work there in shifts. In these times, it is getting harder and harder to shock the kids properly, since they're so spoiled by television, so that there's an energy shortage in the monster world. Sulley, the number one frightener, one day accidentally lets a human child into the monster world. Since kids are supposed to be poisonous and carry loads of diseases, pandemonium ensues. After Mike and Sulley discover that the girl they named Boo actually seems quite harmless, they decide to bring her back through her door into her room. But Boo's presence is more than just a mere accident. Now, Mike and Sulley have to face an enemy within their own ranks.::Julian Reischl <julianreischl@mac.com>",
        "In order to power the city, monsters have to scare children so that they scream. However, the children are toxic to the monsters, and after a child gets through, 2 monsters realize things may not be what they think.::gamergcfan"
    ],
    "language": {
        "id": [
            "English"
        ],
        "adult_language_percentage": 1.2105984467793514,
        "linguistic_difficulty_percentage": 0.011420740063956145,
        "words_per_minute": 95,
        "common_words": {
            "hey": 108,
            "oh": 86,
            "come": 70,
            "get": 65,
            "uh": 58,
            "go": 58,
            "kid": 52,
            "boo": 52,
            "right": 51,
            "sulley": 49
        }
    }
}