{
    "title": "Munna Bhai M.B.B.S.",
    "year": 2003,
    "genres": [
        "Comedy",
        "Drama",
        "Musical"
    ],
    "runtime": [
        "156"
    ],
    "rating": 8.2,
    "plot": [
        "In India gangsters are called Bhai (brothers). One such Bhai is Munna, who is feared by everyone in Mumbai, a big city in India. He cons his village-based parents into believing that he is a doctor. He gets a shock when he finds out that they are coming to verify for themselves. So he transforms a rooming shanty house into a makeshift hospital, populated by patients, people he beats up. His parents arrive, are pleased, and happy that their son is well settled. They would like him to get married to a doctor's daughter. The marriage is arranged, but before the engagement, the bride's father finds out the truth about Munna, and cancels the marriage. Munna's humiliated parents see the truth for themselves, and hurt, they return home, leaving Munna with a strong desire to hurt the doctor - and force him to let his daughter get married to him - even if it means getting admitted in the medical college - with forged documents!!!::Sumitra (corrected by Carrie)",
        "Murli Prasad Sharma is a local goon in Mumbai popularly known as 'Munna bhai'. He has kept his real identity secret from his parents, who think that their son is a doctor. Munna's parents arrive in Mumbai for their annual visit and his father meets an old acquaintance Dr. Asthana by chance. They want to fix Munna's marriage with Dr. Asthana's daughter Suman \"Chinky\" Asthana. But Dr. Asthana comes to know about Munna's real identity, reveals it to his parents and humiliates them. Heartbroken, they leave for their hometown. Munna swears revenge upon Dr. Asthana and embarks upon getting an admission in a medical college to become a doctor.::Soumitra",
        "In India gangsters are called Bhai (brothers). One such Bhai is Shri Hari Prasad Sharma alias Munna, he is feared by everyone in Mumbai, a big city in India. Munna is a full-time vagabond and later cons his village-based parents into believing that he is a doctor, which they wanted him to become, finding him fulfilling there dreams, they decides to pay him a visit in order to verify for themselves that he is indeed a doctor. He gets a nasty shock when he hears they are coming so he transforms a rooming shanty house into a makeshift hospital, populated by patients, people he beats up. His parents arrive, are pleased, and happy that their son is well settled and assure him success and bless him. They would like him to get married to his father's friend Dr. Asthana daughter. The marriage is arranged, but before the engagement, Dr. Asthana finds out the truth about Munna, and revealed his true identity to the public and his parents. After learning the truth Dr. Asthana cancels the marriage. Being humiliated by the public for Munna's deeds his parents are very much hurt and return to there home, leaving Munna with a strong desire to hurt the doctor - and force him to let his daughter get married to him - even if it means getting admitted in the medical college - with forged documents which might as well leads to escalating the conflicts to an extend that it will be hard to solve.::gavin@sunny_deol2009@yahoo.com",
        "Munna bhai(here gangster) has been lying to his parents over the years that he is a M.B.B.S doctor. His parents visit him, where they are bluffed. His parents take his invitation for marriage to a real Doctor's daughter where both of them are Doctor. This is when his parents find out their son is a gangster. Now Munna wants to take revenge, so he takes admission into best medical college of Mumbai. There he finds the ones who insulted and rejected his parents were present there itself. Now he wants to get married to the daughter of doctor who rejected him. He tries to find out about her. He creates a pleasant atmosphere for all the patients and doctors. He talks about jadoo ki jhapi which he learnt from his mother. Dr Asthana who insulted his parents, still wants him out of his college. His daughter Chinki slowly falls for him. People admitted and others think of him as a magician who can cure anybody. He cures a parsi doctors father, gives hope to a cancer patient, makes up mind of a young man who tried to commit suicide, he cures a patient who according to medical knowledge is impossible to happen.Finally after all this his dad accepts him and says 'tune to sabko jeena sikha diya'. It is shown gradually he gets married to chinky and the movie ends on a positive note.::muvi-fan-73",
        "Murli Prasad Sharma a.k.a Munna (Sanjay Dutt), is the big-time local thug and has almost everyone working for him. However, Munna has got his parents believing that he is a doctor, and whenever they visit, he has his home turned into a hospital, and his mates acting as patients and doctors. But when Munna's father visits this time, he wants Munna to marry a childhood friend, who is now a female doctor - Chinki. But Chinki's father is aware that Munna is not a doctor and is a goon, so he bust Munna in front of his parents. Munna's Father disowns Munna and Munna challenges himself to become a doctor to show his father he is capable of it. Munna attends medical school, which is run by Chinkis father. Munna wants to irritate Chinki's Father. Will Munna ever become a doctor and marry Chinki? Will Munna father ever own him again? Can the local Thug become anything more than a local thug.::Mekaeal Chaudary (Mekaeal_12345@hotmail.com)",
        "A gangster sets out to fulfill his father's dream of becoming a doctor.::Mekaeal Chaudary (Mekaeal_12345@hotmail.com)"
    ],
    "language": {
        "id": [
            "Hindi"
        ],
        "adult_language_percentage": 1.161592505854801,
        "linguistic_difficulty_percentage": 0.03747072599531616,
        "words_per_minute": 68,
        "common_words": {
            "know": 72,
            "doctor": 70,
            "brother": 66,
            "get": 60,
            "wa": 60,
            "wiii": 57,
            "munna": 55,
            "go": 53,
            "piease": 43,
            "one": 42
        }
    }
}