{
    "title": "No Country for Old Men",
    "year": 2007,
    "genres": [
        "Crime",
        "Drama",
        "Thriller"
    ],
    "runtime": [
        "122"
    ],
    "rating": 8.1,
    "plot": [
        "In rural Texas, welder and hunter Llewelyn Moss (Josh Brolin) discovers the remains of several drug runners who have all killed each other in an exchange gone violently wrong. Rather than report the discovery to the police, Moss decides to simply take the two million dollars present for himself. This puts the psychopathic killer, Anton Chigurh (Javier Bardem), on his trail as he dispassionately murders nearly every rival, bystander and even employer in his pursuit of his quarry and the money. As Moss desperately attempts to keep one step ahead, the blood from this hunt begins to flow behind him with relentlessly growing intensity as Chigurh closes in. Meanwhile, the laconic Sheriff Ed Tom Bell (Tommy Lee Jones) blithely oversees the investigation even as he struggles to face the sheer enormity of the crimes he is attempting to thwart.::Kenneth Chisholm (kchishol@rogers.com)",
        "1980, West Texas. While out hunting down by the US-Mexico border, good ol' Texas boy Llewelyn Moss, a welder by day who lives in a trailer park in Sanderson with his wife Carla Jean, comes across what is a drug deal gone wrong. What he finds are all the players left at the scene dead or near death and a satchel filled with $2 million which he takes, despite knowing that someone will be looking for the money and is probably willing to kill for it. As such, he not only tries to protect himself in the process of trying to find out who will be after the money, but also Carla Jean by sending her away. A person hired to retrieve the money is Anton Chigurh, who indeed will kill anyone, including innocent bystanders, necessary to get to his end goal, with a high pressure air pistol his weapon of choice especially as it leaves no bullet as evidence. Chigurh, in deciding who should live or die in his day to day life, also uses his own psychopathic set of principles. Chirgurh quickly learns that Moss has the money and is on the run. Also on both their trails is Terrell County Sheriff Ed Tom Bell and his naive deputy Wendell. Bell, a third generation sheriff, has of late contemplated his professional future solely because of the notion that he and his like have not been able to do anything to control the increasing violence of the region. Bell finds evidence that Moss has the money and that someone, who has left a trail of carnage behind him, is after Moss and the money. As such, Bell tries to find Moss solely to protect him from whoever is after him. One other person added to the mix is Carson Wells, hired by the same person that hired Chigurh also to retrieve the money, as their employer feels that Chigurh has gotten out of control. Wells knows Chigurh well and knows that he will not take too kindly to anyone else brought in on his job.::Huggo",
        "In the desert of Rio Grande, a drug deal goes wrong and Llewellyn Moss, the welder, finds 2 million dollars in a box. He keeps the money for himself but an unemotional psychopathic killer Chigurh chases him. He kills everyone that comes in front of him to get the welder, using a unique weapon of his own. By this time the elderly sheriff Ed Tom tries to go through and to as deed as possible of the matter.",
        "After stumbling across a case of money among dead bodies, Llewelyn Moss (Josh Brolin) thinks he can keep it quiet, but when silent killer Anton Chigurh (Javier Bardem) locates Moss and his money, Vietnam veteran Moss makes a run for it. With bodies falling everywhere Anton goes, it's only a matter of time before he catches up with Llewelyn. Whilst all this is going on, Sheriff Ed Tom Bell (Tommy Lee Jones) is overseeing the investigation and begins to see the country in a different light than it once was.::FilmFanUk",
        "After he finds $2 million in the desert where a drug deal has apparently gone wrong, working man Llewelyn Moss (Josh Brolin) finds himself on the run. His pursuer is Anton Chigurh (Javier Bardem), an unemotional killer with a unique murder weapon at his disposal. Throughout, soon to be retired Sheriff Ed Tom Bell (Tommy Lee Jones) attempts to convince Moss, mostly through his wife Carla Jean, that he should turn the money over to the authorities or this could all end in tragedy.::garykmcd",
        "Violence and mayhem ensue after a hunter stumbles upon a drug deal gone wrong and more than two million dollars in cash near the Rio Grande.::IMDb Editor"
    ],
    "language": {
        "id": [
            "English",
            "Spanish"
        ],
        "adult_language_percentage": 1.4523218039365564,
        "linguistic_difficulty_percentage": 0.02866424613032677,
        "words_per_minute": 85,
        "common_words": {
            "know": 126,
            "wa": 83,
            "well": 78,
            "got": 61,
            "right": 57,
            "yes": 51,
            "yeah": 50,
            "one": 48,
            "sir": 44,
            "going": 43
        }
    }
}