{
    "title": "Pan's Labyrinth",
    "year": 2006,
    "genres": [
        "Drama",
        "Fantasy",
        "War"
    ],
    "runtime": [
        "118"
    ],
    "rating": 8.2,
    "plot": [
        "In 1944 falangist Spain, a girl, fascinated with fairy-tales, is sent along with her pregnant mother to live with her new stepfather, a ruthless captain of the Spanish army. During the night, she meets a fairy who takes her to an old faun in the center of the labyrinth. He tells her she's a princess, but must prove her royalty by surviving three gruesome tasks. If she fails, she will never prove herself to be the the true princess and will never see her real father, the king, again.::Tim",
        "In 1944, in the post-Civil War in Spain, rebels still fight in the mountains against the falangist troops. The young and imaginative Ofelia travels with her pregnant and sick mother Carmen Vidal to the country to meet and live with her stepfather, the sadistic and cruel Captain Vidal, in an old mill. During the night, Ofelia meets a fairy and together they go to a pit in the center of a maze where they meet a faun that tells that she is a princess from a kingdom in the underground. He also tells that her father is waiting for her, but she needs to accomplish three gruesome, tough and dangerous assignments first. Meanwhile, she becomes friend of the servant Mercedes, who is the sister of one of the rebels and actually is giving support to the group. In a dark, harsh and violent world, Ofelia lives her magical world trying to survive her tasks and sees her father and king again.::Claudio Carvalho, Rio de Janeiro, Brazil",
        "Ofelia's love of fairy tales is obvious from the beginning of El Laberinto del fauno. Set in the not so tranquil Spanish woodlands of World War Two, where a small band of anti-falangist rebels are hiding out. This is where Ofelia and her pregnant mother have come to live, in the company of Capitán Vidal, Ofelia's new stepfather and soon to be father of her half-brother. It is with the brutal, unforgiving and totalitarian idealist Capitán Vidal, and his falangist troops, who must weed out these resistance fighters of the hills and woods, that Ofelia finds her release and distraction of the new world order and its warring factions and delves into the older, mysterious and enchanting world of fairies, faun's and giant frogs. Beautiful, charming, graphic and deadly. El Laberinto del fauno.::Cinema_Fan",
        "Set in Spain during World War II. This is the story of a young girl named Ofelia. She is a girl who has a passion for fairy tales, which causes her to see one during her trip on the forest that is not quiet. She goes to her stepfather's home in the country along with her pregnant but sickly mother, he is the sadistic Captain Vidal. Ofelia creates an imaginary world of her own to escape the cruel and harsh realities of the world. When she encounters a faun, she must complete three tasks in order to obtain immortality according to the legend of a princess.::Emphinix",
        "The story takes place in Spain, a few years after The Civil War, which ended in 1939 with General Franco emerging victorious and taking over as Dictator of Spain. The Resistance has fled into the forests, but are looking to bounce back at any opportunity. Amidst this setting, the narrative of the film intertwines the real world with a mythical world centered on an overgrown abandoned labyrinth and a mysterious faun creature, with whom the main character, Ofelia (Ivana Baquero), interacts. Ofelia meets several strange and magical creatures who become central to her story, leading her through the trials of the old labyrinth garden. On successful completion of her tasks, Ofelia bears the chance to attain immortality by ascending the high throne of the underworld as Princess Moanna. Parallely running, is the story of Captain Vidal (Sergi Lopez), the son of a brave Commander who died in a battle in Morocco, who is posted on an Army outpost in the forest surrounded by the Resistance men. He takes Ofelia's mother Carmen (Ariadna Gil) as his wife, after the death of Ofelia's father. There is state control over the rations to prevent it from reaching the Resistance men hiding in the forests and amidst this he plays an evil character who is impossible to defend. Mercedes (Maribel Verdu), Vidal's housekeeper, who is secretly supporting the rebels is also supported by Dr Ferreiro (Alex Angulo) in her mission. Midway in the movie, The Resistance, in a stroke of brilliance, are able to overpower the men at the outpost and gain access to the rations leaving the Captain and his men dumbfounded. This incident in the movie, shifts the tide in favor of the Resistance. Soon after, Vidal discovers that his housekeeper Mercedes is a spy. Ofelia is locked in her bedroom, and Mercedes is taken to be tortured. However, she frees herself, stabs Vidal, and rejoins the rebels. The faun returns to Ofelia and tells her to bring her baby brother into the labyrinth. Vidal pursues her. The faun tells Ofelia that opening the portal to the underworld requires the blood of an innocent. The faun suggests a few drops of her baby brother's blood. Ofelia refuses to harm her brother; for further disobeying his orders, the faun refuses to help her. Vidal finds Ofelia talking to someone (the faun) whom Vidal cannot see. Vidal takes the baby from her arms and fatally shoots Ofelia; then, when he reaches the labyrinth's entrance, he is surrounded by the rebels who have taken over the outpost. Knowing that he will be killed, he hands the baby to Mercedes. One of the rebels kills Vidal. The movie ends with drops of Ofelia's blood falling down the center of the spiral stone staircase onto an altar. Ofelia then appears in a golden throne room. The king of the underworld says that she passed the final test, which was to choose to spill her own blood rather than that of her baby half-brother.::Dev X Cholera <devansh.cholera@gmail.com>",
        "In 1944 Spain young Ofelia and her ailing mother arrive at the post of her mother's new husband, a sadistic army officer who is trying to quell a guerrilla uprising. While exploring an ancient maze, Ofelia encounters the faun Pan, who tells her that she is a legendary lost princess and must complete three dangerous tasks in order to claim immortality.::Jwelch5742",
        "In the falangist Spain of 1944, the bookish young stepdaughter of a sadistic army officer escapes into an eerie but captivating fantasy world.::Shannon Patrick Sullivan <shannon@mun.ca>"
    ],
    "language": {
        "id": [
            "Spanish"
        ],
        "adult_language_percentage": 1.6680567139282736,
        "linguistic_difficulty_percentage": 0.020850708924103418,
        "words_per_minute": 40,
        "common_words": {
            "l": 122,
            "captain": 46,
            "one": 28,
            "lt": 26,
            "ofelia": 25,
            "wa": 23,
            "father": 23,
            "come": 23,
            "look": 20,
            "go": 17
        }
    }
}