{
    "title": "PK",
    "year": 2014,
    "genres": [
        "Comedy",
        "Drama",
        "Fantasy"
    ],
    "runtime": [
        "153"
    ],
    "rating": 8.2,
    "plot": [
        "P. K. is a comedy of ideas about a stranger in the city, who asks questions that no one has asked before. They are innocent, child-like questions, but they bring about catastrophic answers. People who are set in their ways for generations, are forced to reappraise their world when they see it from PK's innocent eyes. In the process PK makes loyal friends and powerful foes. Mends broken lives and angers the establishment. P. K.'s childlike curiosity transforms into a spiritual odyssey for him and millions of others. The film is an ambitious and uniquely original exploration of complex philosophies. It is also a simple and humane tale of love, laughter and letting-go. Finally, it is a moving saga about a friendship between strangers from worlds apart.::Abhijat Joshi",
        "PK the alien being, a gentle one who encounters the other side of God and religion on earth, in India. He comes across as a simpleton, an innocent being who represents his kind from a distant planet. He meets Jaggu, Anushka Sharma, an the plot unravels soon. Of how the contemporary society has been taken over dogmatic preachers from all major religions. Of how the universal message of God is forgotten and of how people are manipulated by the so-called religious leaders, aptly called as Managers by PK. The movie is symbolic of how convoluted our belief system is, be it Hinduism, Islam or Christianity.::Jagdish Keshav",
        "An alien from a distant galaxy, drops in on our planet Earth to study the inhabitants. What he encounters here, surprises him. It's about how major religions in contemporary religions have been hijacked by religious zealots, whom he, PK calls as Managers.::Jagdish Keshav",
        "A human like Alien from a distant civilization arrives on the earth to conduct a research for his people. Within few minutes of his arrival, his remote control to his spaceship gets stolen and he gets stranded on the earth. Now how should he go about finding his remote control in a completely alien world? The only unanimous advice he seems to receive from the people of the earth is that only God could help him. Not having any clue about the concept of God, he sets off on his mission to search for him. He comes across different religions with different Gods which only help him to fall into a confusion. What God should he follow? Which religion does he belong to? Will he ever find God? Will he get to get back to his home?::vspm83",
        "PK is an Alien who visits earth to understand about its 'intelligent' inhabitants, but the very first lesson is a painful one when the remote control of his spaceship is stolen. Hence he now faces myriads of problem in a planet where he is alone unaware and can't even speak its language. But he is helped by a noble soul named Bhairon Singh and hence his search takes him from Rajasthan to Delhi. Here he learns that his remote control can only be returned to him by the heavenly intervention and from here on his tangle with the 'organized religion' starts as he tries various religious solutions but when all of them fails he not only criticizes them as a tool used by the 'managers' of religion to exploit the helpless but also seek refund and in the end redefines religion as something which is Rational , Compassionate and Humane , Not the Superstitious , Hateful, and Heartless one currently propagated to the masses which he calls as the 'Wrong Number'.::Raveesh",
        "An alien on Earth loses the only device he can use to communicate with his spaceship. His innocent nature and child-like questions force the country to evaluate the impact of religion on its people.::Abhijat Joshi"
    ],
    "language": {
        "id": [
            "Hindi",
            "English",
            "Urdu",
            "Persian",
            "Kurdish"
        ],
        "adult_language_percentage": 2.4667546441985584,
        "linguistic_difficulty_percentage": 0.18272256623693026,
        "words_per_minute": 64,
        "common_words": {
            "god": 137,
            "l": 81,
            "get": 51,
            "wa": 50,
            "one": 46,
            "come": 44,
            "say": 43,
            "tipsy": 41,
            "wrong": 40,
            "go": 38
        }
    }
}