{
    "title": "Prisoners",
    "year": 2013,
    "genres": [
        "Crime",
        "Drama",
        "Mystery",
        "Thriller"
    ],
    "runtime": [
        "153"
    ],
    "rating": 8.1,
    "plot": [
        "How far would you go to protect your family? Keller Dover is facing every parent's worst nightmare. His six-year-old daughter, Anna, is missing, together with her young friend, Joy, and as minutes turn to hours, panic sets in. The only lead is a dilapidated RV that had earlier been parked on their street. Heading the investigation, Detective Loki arrests its driver, Alex Jones, but a lack of evidence forces his release. As the police pursue multiple leads and pressure mounts, knowing his child's life is at stake the frantic Dover decides he has no choice but to take matters into his own hands. But just how far will this desperate father go to protect his family?::Warner Bros. Pictures",
        "When two girls go missing, the families call the police. The brother of one of the girls says that an RV was parked on the street. The police find the RV and the man inside is a mentally challenged man. The detective in charge questions him but says nothing. The father of one of the girls tells the detective to keep him locked up so they can work on him. But he says without more evidence they have to let him go. When the father learns of this he goes to confront the man and the man says something which makes the father think he knows something. So he grabs him and works on him to make him talk but he doesn't. The detective continues to try and find the girls.::rcs0411@yahoo.com",
        "On Thanksgiving, Keller Dover, his wife Grace, their teenage son Ralph and their little daughter Anna go to the home of their neighbors and friends Franklin Birch, his wife Nancy, their teenage daughter Eliza and their little daughter Joy to celebrate together in a lunch party. Anna and Joy want to play on the street and Ralph stays with them. The girls play in a ROV and Ralph brings them back home. Later Anna asks her father to go to their house with Joy to seek her emergency whistle and Keller tells her to call Ralph or Eliza to go with them. Later the families realize that the girls went alone and have vanished, and they call the police department. Detective Loki is assigned to the case and he arrests the teenager Alex Jones that drives the trailer. Soon they learn that Alex has the IQ of a ten year-old boy and he is discharged. When he is leaving the precinct with his aunt Holly Jones, Keller presses Alex and he says to Keller that \"the girls have not cried when he left them\". Keller asks to keep Alex imprisoned during the investigations, but Loki cannot hold him anymore. While Detective Loki investigates the pedophiles near the location, Keller decides to abduct Alex to torture him and find where his beloved daughter and her friend are, crossing the thin line between right and wrong.::Claudio Carvalho, Rio de Janeiro, Brazil",
        "In a town in northeastern Pennsylvania, Keller and Grace Dover, Franklin and Nancy Birch, and their respective offspring - each couple with a teenager and adolescent apiece - are best friends. While the two families are celebrating Thanksgiving together, the two adolescent girls, Anna Dover and Joy Birch, go missing. Based on events earlier in the day, the two families believe that the girls were abducted by whoever lives in the camper van parked in their neighborhood. Their beliefs are strengthened after they meet the resident of the camper, Alex Jones, a mentally childlike young man who is supported in every respect by his overprotective aunt, Holly Jones, and based on other subsequent evidence about Alex that emerges. However, Detective Loki, the lead police investigator, is pretty certain that Alex did not abduct the girls, he instead initially following leads of known sex offenders and pedophiles in the area. In addition, Loki has no evidence to hold Alex in custody, placing him at odds especially with Keller, who is certain that Alex is the one who abducted the girls. While Loki continues his investigation with Keller accusing him of not doing his job by following what he considers are pointless leads, Keller decides he has to take matters into his own hands. He has to decide how much he will involve Grace, Franklin and Nancy in getting Alex to divulge where the girls are by any means possible. His decisions as in who he will involve in getting Alex to talk may depend on how like-minded he believes the other three are, they who may be as devastated as he is, but who may neither be certain that Alex is the perpetrator or go to the same extremes as he to get the information from Alex.::Huggo",
        "When Keller Dover's daughter and her friend go missing, he takes matters into his own hands as the police pursue multiple leads and the pressure mounts.::Anonymous"
    ],
    "language": {
        "id": [
            "English"
        ],
        "adult_language_percentage": 1.8119266055045873,
        "linguistic_difficulty_percentage": 0.08027522935779817,
        "words_per_minute": 56,
        "common_words": {
            "know": 79,
            "tell": 60,
            "wa": 58,
            "come": 57,
            "go": 50,
            "gonna": 50,
            "get": 47,
            "right": 47,
            "hey": 45,
            "yeah": 38
        }
    }
}