{
    "title": "Rear Window",
    "year": 1954,
    "genres": [
        "Mystery",
        "Thriller"
    ],
    "runtime": [
        "112"
    ],
    "rating": 8.5,
    "plot": [
        "Professional photographer L.B. \"Jeff\" Jefferies breaks his leg while getting an action shot at an auto race. Confined to his New York apartment, he spends his time looking out of the rear window observing the neighbors. He begins to suspect that a man across the courtyard may have murdered his wife. Jeff enlists the help of his high society fashion-consultant girlfriend Lisa Freemont and his visiting nurse Stella to investigate.::Col Needham <col@imdb.com>",
        "L.B. 'Jeff' Jefferies is an immobilized photo-journalist who, after breaking his leg photographing a racetrack accident, finds himself wheelchair bound and confined to the walls of his apartment. His rear window looks out onto a courtyard and several other apartments, where the binocular-wielding Jefferies spends his days as a voyeur spying on his neighbors. Jefferies gradually becomes more and more engrossed with this activity of his, and soon brings his girlfriend, Lisa, in on the thrill of his voyeurism. It's all fun and games for the two until they witness what they believe to be a murder in progress, becoming increasingly convinced as they continue to observe the apartment.::Kyle Perez",
        "Photographer L.B. \"Jeff\" Jefferies is confined to his small apartment with a broken leg. To pass the time, he watches the goings-on of his motley assortment of neighbors - a frustrated yet fun-loving composer, a middle-aged couple with a small dog, a dancer who seems to enjoy practicing her routines while scantily clad, a pair of reclusive newlyweds, a lonely woman who seems to live in a fantasy world, and a salesman and his invalid wife. One day the wife inexplicably disappears, and the salesman starts doing things that lead Jeff to suspect that he may have murdered her. Unfortunately, he has no proof and no one seems to believe him. Eventually, however, things start falling together in a way that make it look like Jeff might just be right after all. Finally, his girlfriend Lisa and his nurse Stella come up with a plan to catch the killer red-handed. But doing so could put all of their lives in danger.::LOTUS73",
        "In 1950-something New York, an adventuresome free-lance photographer finds himself confined to a wheelchair in his tiny apartment while a broken leg mends. With only the occasional distraction of a visiting nurse and his frustrated love interest, a beautiful fashion consultant, his attention is naturally drawn to the courtyard outside his \"rear window\" and the occupants of the apartment buildings which surround it. Soon he is consumed by the private dramas of his neighbors lives which play themselves out before his eyes. There is \"Miss Lonelyhearts,\" so desperate for her imaginary lover that she sits him a plate at the dinner table and feigns their ensuing chat. There is the frustrated composer banging on his piano, the sunbathing sculptress, the shapely dancer, the newlyweds who are concealed from their neighbors by a window shade, and a bungling middle-aged couple with a little yapping dog who sleep on the fire escape to avoid the sweltering heat of their apartment. ...And then there is the mysterious salesman whose nagging, invalid wife's sudden absence from the scene ominously coincides with middle-of-the-night forays into the dark, sleeping city with his sample case. Where did she go? What's in the trunk that the salesman ships away? What's he been doing with the knives and the saw that he cleans at the kitchen sink?::Mark Fleetwood <mfleetwo@mail.coin.missouri.edu>",
        "Professional photographer L.B. \"Jeff\" Jefferies is a prisoner of sorts in his own apartment sporting a hip cast from one of his adventures. He has little to do and spends much of the time observing his neighbors, including a newlywed couple, a middle-aged woman who lives alone and a ballerina who seems to attract men without much effort. He becomes particularly interested in one neighbor, Lars Thorwald, a traveling salesman whose invalid wife spends much of her time in bed. When he sees Thorwald make several trips out of his apartment on a particularly rainy night, he begins to wonder what may be going on. The disappearance of his wife makes him think he may have murdered her. Jefferies has few visitors, but the elegant and beautiful Lisa Fremont, who is madly in love with him, sees him daily and while she is at first skeptical, soon comes around to his way of thinking. In order to get proof however, it will be necessary for her to enter Thorwald's apartment.::garykmcd",
        "A wheelchair-bound photographer spies on his neighbors from his apartment window and becomes convinced one of them has committed murder.::Col Needham <cn@imdb.com>"
    ],
    "language": {
        "id": [
            "English"
        ],
        "adult_language_percentage": 0.743571207270474,
        "linguistic_difficulty_percentage": 0.051636889393782914,
        "words_per_minute": 86,
        "common_words": {
            "well": 68,
            "get": 66,
            "oh": 50,
            "see": 50,
            "know": 49,
            "thorwald": 47,
            "one": 46,
            "right": 45,
            "look": 41,
            "wa": 40
        }
    }
}