{
    "title": "Requiem for a Dream",
    "year": 2000,
    "genres": [
        "Drama"
    ],
    "runtime": [
        "102"
    ],
    "rating": 8.3,
    "plot": [
        "Sara Goldfarb (Ellen Burstyn) is a retired widow, living in a small apartment. She spends most of her time watching TV, especially a particular self-help show. She has delusions of rising above her current dull existence by being a guest on that show. Her son, Harry (Jared Leto) is a junkie but along with his friend Tyrone (Marlon Wayans) has visions of making it big by becoming a drug dealer. Harry's girlfriend Marion (Jennifer Connelly) could be fashion designer or artist but is swept along in Harry's drug-centric world. Meanwhile Sara has developed an addiction of her own. She desperately wants to lose weight and so goes on a crash course involving popping pills, pills which turn out to be very addictive and harmful to her mental state.::grantss",
        "Drugs. They consume mind, body and soul. Once you're hooked, you're hooked. Four lives. Four addicts. Four failures. Despite their aspirations of greatness, they succumb to their addictions. Watching the addicts spiral out of control, we bear witness to the dirtiest, ugliest portions of the underworld addicts reside in. It is shocking and eye-opening but demands to be seen by both addicts and non-addicts alike.::Jeff Mellinger <jmell@uclink4.berkeley.edu>",
        "Requiem for a Dream exposes four paralleled individuals and their menacing addiction to heroin, cocaine, and diet pills (speed). Taking place in Brooklyn amidst the waning Coney Island, the drugs are very easily obtained and keep each main character in its cycle of dependence. The protagonist Harry Goldfarb is your typical heroin junky with an ambitious plan of \"Getting off hard knocks,\" with help from his cocaine crazed girlfriend Marion and his long time friend Tyrone. Meanwhile his widowed mother is obsessed with the glamor of television and eventually finds her way to a dietitian who pushes her into the cycle of drug induced enslavement.::spiro muqhar",
        "A film paralleling the lives of Sara Goldfarb, a lonely, TV obsessed widow, and her son Harry, his girlfriend Marion, and his drug dealer friend Tyrone. After learning that she will make an appearance on a TV game show, Sara tries to lose weight so that she can fit into her prized red dress, and becomes hooked on diet pills. Meanwhile, Harry and his friends are taking heroin and cocaine. We then witness the disasterous consequences and the downward spiral their lives take as a result of their addictions.::richie-29",
        "Pills and heroin offer fulfillment of the dreams of four residents of Brooklyn's Brighton Beach in the shadow of a crumbling Coney Island amusement park. Sara dreams of appearing on television wearing a red dress that's a bit snug. So she starts a diet assisted by uppers. Her son Harry, his girlfriend Marion, and his best friend Tyrone pin their hopes for money on moving up from pushing nickel bags of heroin to buying in bulk. They also deal to support their growing habits. Things are going well: Harry buys his mom a new TV, she's losing weight, she has status among her friends, Tyrone's girlfriend is cool, and the team has money in a shoe box. These dreams are addictive.::<jhailey@hotmail.com>",
        "The drug-induced utopias of four Coney Island people are shattered when their addictions run deep.::someguy"
    ],
    "language": {
        "id": [
            "English"
        ],
        "adult_language_percentage": 2.513048521167601,
        "linguistic_difficulty_percentage": 0.0,
        "words_per_minute": 50,
        "common_words": {
            "got": 54,
            "get": 43,
            "know": 33,
            "cum": 32,
            "want": 31,
            "like": 31,
            "sara": 29,
            "see": 28,
            "going": 28,
            "good": 26
        }
    }
}