{
    "title": "Scarface",
    "year": 1983,
    "genres": [
        "Crime",
        "Drama"
    ],
    "runtime": [
        "170"
    ],
    "rating": 8.3,
    "plot": [
        "Tony Montana manages to leave Cuba during the Mariel exodus of 1980. He finds himself in a Florida refugee camp but his friend Manny has a way out for them: undertake a contract killing and arrangements will be made to get a green card. He's soon working for drug dealer Frank Lopez and shows his mettle when a deal with Colombian drug dealers goes bad. He also brings a new level of violence to Miami. Tony is protective of his younger sister but his mother knows what he does for a living and disowns him. Tony is impatient and wants it all however, including Frank's empire and his mistress Elvira Hancock. Once at the top however, Tony's outrageous actions make him a target and everything comes crumbling down.::garykmcd",
        "When Fidel Castro opens the harbor at Mariel, Cuba, he sends 125,000 Cuban refugees to reunite with their relatives in the United States. Among all the refugees, there is one who wants it all, his name is Tony Montana. Tony and his friend Manny arrive in the United States and start in small time jobs. Soon, they are hired by Omar Suarez to pay money to a group of Colombians. When the deal goes wrong, Tony and Manny leave with the money and succeed in their job. Soon Tony meets with drug kingpin Frank Lopez and falls for his boss's girl, Elvira. Pretty soon Tony will know that those who want it all, do not last forever; that is the price of power. The world will know Montana by one name....SCARFACE.::Emphinix",
        "A remake of the 1932 classic, the 1983 version follows Cuban refugee, Tony Montana and his close friend Manny Ray, and together they build a strong drug empire in Miami. Of course Montana must deal with the hardships of this type of business. And as Montana's power begins to grow so does his ego and his paranoia.::A Martinez",
        "An update of the 1932 film, Scarface (1983) follows gangster Tony Montana and his close friend Manny Ray from their trip on the Cuban Boat Lift for refugees to their arrival in Miami. After killing a powerful Cuban figure, Montana and company gain the ability to leave their refugee camps and roam around the U.S. After unsuccessfully trying to make it legitimately in the country, Montana and Ray resort to selling cocaine to dealers around the world. Tony's rise is quick, but as he becomes more powerful, his enemies and his own paranoia begin to plague his empire.::Titan45",
        "When Castro opened the port at Mariel Harbor, thousands of Cubans fled to the United States. One is a young tough named Antonio (Tony) Montana, who, with his friend Manny Ray, starts in with Miami's cocaine trade. He survives attack by chainsaw after a deal goes bad, and several other attempts by other dealers to eliminate him. Eventually the grandiose Montana becomes head of a cocaine cartel. But his enemies start coming after him, and his paranoia threatens to drive Montana's empire into the ground...::Derek O'Cain",
        "In Miami in 1980, a determined Cuban immigrant takes over a drug cartel and succumbs to greed.::mgx"
    ],
    "language": {
        "id": [
            "English",
            "Spanish"
        ],
        "adult_language_percentage": 3.134651019147622,
        "linguistic_difficulty_percentage": 0.0077208153180975915,
        "words_per_minute": 76,
        "common_words": {
            "know": 111,
            "got": 107,
            "like": 100,
            "tony": 97,
            "come": 89,
            "want": 88,
            "okay": 87,
            "fuck": 78,
            "fucking": 77,
            "get": 72
        }
    }
}