{
    "title": "Shutter Island",
    "year": 2010,
    "genres": [
        "Mystery",
        "Thriller"
    ],
    "runtime": [
        "138"
    ],
    "rating": 8.1,
    "plot": [
        "It's 1954, and up-and-coming U.S. marshal Teddy Daniels is assigned to investigate the disappearance of a patient from Boston's Shutter Island Ashecliffe Hospital. He's been pushing for an assignment on the island for personal reasons, but before long he wonders whether he hasn't been brought there as part of a twisted plot by hospital doctors whose radical treatments range from unethical to illegal to downright sinister. Teddy's shrewd investigating skills soon provide a promising lead, but the hospital refuses him access to records he suspects would break the case wide open. As a hurricane cuts off communication with the mainland, more dangerous criminals \"escape\" in the confusion, and the puzzling, improbable clues multiply, Teddy begins to doubt everything - his memory, his partner, even his own sanity.::alfiehitchie",
        "Federal Marshall Teddy Daniels and his new partner Chuck Aule travel to a government-run mental institution for the criminally insane on Shutter Island, near Boston, when there is a report that one of the prisoners has gone missing. Daniels has his own reasons for wanting to get to the island and carries baggage of his own. He is still traumatized from what he saw when his army unit liberated one of the Nazi concentration camps at the end of World War II and is still haunted by the more recent death in a fire of his wife. The head of the hospital, Dr. John Cawley, treats him alright but others give the agents a less than warm reception. Daniels particularly wants to find out what is going on in one of the wards, reserved for the most serious offenders. As Daniels begins to peal away the layers of deceit, it becomes obvious that not all is as it seems.::garykmcd",
        "Saif Dx, AbuDhabi UAE In 1954, Federal Marshal Teddy Daniels and his new partner, Chuck Aule, from Seattle travel to Shutter Island to investigate the disappearance of a patient there, Rachel Solando. She had been sectioned at the institution for dangerous criminals at Ashcliffe Hospital, because she drowned her three kids. Teddy is a veteran WWII soldier, traumatized by the war experience in the liberation of the Dachau concentration camp and the loss of his beloved wife in a criminal fire. Teddy is unable to access the records of employees and patients and feels that his investigation is obstructed by the management by the Federal facility. Teddy has severe migraines and when there is a storm, Teddy and Chuck find that they are stranded in the island. Teddy interviews the internees and follows a lead to the lighthouse, where he discloses the mystery about the Shutter Island.",
        "U.S. Marshall, Teddy, and his partner, Chuck, travel to a secluded island home to a mental facility called Shutter Island. The reason for Teddy's arrival is to investigate the disappearance of a missing patient, named Rachel. As Teddy and Chuck dive deeper into their investigation to find out where Rachel has gone, they reveal the dark secrets of Shutter Island.",
        "In 1954, Federal Marshal Teddy Daniels and his new partner, Chuck Aule, from Seattle travel to Shutter Island to investigate the disappearance of a patient there, Rachel Solando. She had been sectioned at the institution for dangerous criminals at Ashcliffe Hospital, because she drowned her three kids. Teddy is a veteran WWII soldier, traumatized by the war experience in the liberation of the Dachau concentration camp and the loss of his beloved wife in a criminal fire. Teddy is unable to access the records of employees and patients and feels that his investigation is obstructed by the management by the Federal facility. Teddy has severe migraines and when there is a storm, Teddy and Chuck find that they are stranded in the island. Teddy interviews the internees and follows a lead to the lighthouse, where he discloses the mystery about the Shutter Island.::Claudio Carvalho, Rio de Janeiro, Brazil",
        "In 1954, a U.S. Marshal investigates the disappearance of a murderer, who escaped from a hospital for the criminally insane."
    ],
    "language": {
        "id": [
            "English",
            "German"
        ],
        "adult_language_percentage": 2.258129265355279,
        "linguistic_difficulty_percentage": 0.10036130068245684,
        "words_per_minute": 72,
        "common_words": {
            "wa": 64,
            "know": 47,
            "marshal": 46,
            "patient": 46,
            "get": 38,
            "got": 36,
            "right": 35,
            "go": 34,
            "one": 33,
            "rachel": 33
        }
    }
}