{
    "title": "Snatch",
    "year": 2000,
    "genres": [
        "Comedy",
        "Crime"
    ],
    "runtime": [
        "104"
    ],
    "rating": 8.3,
    "plot": [
        "Turkish and his close friend/accomplice Tommy get pulled into the world of match fixing by the notorious Brick Top. Things get complicated when the boxer they had lined up gets badly beaten by Mickey, a 'pikey' ( slang for an Irish Gypsy)- who comes into the equation after Turkish, an unlicensed boxing promoter wants to buy a caravan off the Irish Gypsies. They then try to convince Mickey not only to fight for them, but to lose for them too. Whilst all this is going on, a huge diamond heist takes place, and a fistful of motley characters enter the story, including 'Cousin Avi', 'Boris The Blade', 'Franky Four Fingers' and 'Bullet Tooth Tony'. Things go from bad to worse as it all becomes about the money, the guns, and the damned dog.::Filmtwob <webmaster@filmfreak.co.za>",
        "Turkish, an unlicenced boxing promoter is pulled into trouble when he becomes involved in big time criminal Brick Top, who wants him to arrange a fight and fix it. Meanwhile, a diamond theft goes down but the 84 karat stone goes missing. This leads Avi, the boss who was supposed to receive the stone, to come to England to search for it, with the help of his cousin, Doug The Head and Bullet Tooth Tony. As events twist and turn, the two situations blend into one with a chain reaction of events carrying on for each and every character.::~^Æ~§íX~^Æ~",
        "Unscrupulous boxing promoters, violent bookmakers, a Russian gangster, incompetent amateur robbers, and supposedly Jewish jewelers fight to track down a priceless stolen diamond.::<jgp3553@excite.com>"
    ],
    "language": {
        "id": [
            "English",
            "Russian"
        ],
        "adult_language_percentage": 4.219918013021461,
        "linguistic_difficulty_percentage": 0.06028454304316373,
        "words_per_minute": 79,
        "common_words": {
            "get": 77,
            "know": 67,
            "fucking": 63,
            "want": 61,
            "got": 56,
            "dog": 46,
            "like": 40,
            "fuck": 39,
            "fight": 33,
            "wa": 31
        }
    }
}