{
    "title": "Spotlight",
    "year": 2015,
    "genres": [
        "Crime",
        "Drama",
        "History"
    ],
    "runtime": [
        "128"
    ],
    "rating": 8.1,
    "plot": [
        "When the Boston Globe's tenacious \"Spotlight\" team of reporters delves into allegations of abuse in the Catholic Church, their year-long investigation uncovers a decades-long cover-up at the highest levels of Boston's religious, legal, and government establishment, touching off a wave of revelations around the world.::Open Road",
        "In existence since the 1970s, Spotlight is the investigative reporting unit of the Boston Globe. They can spend months on a single story, which they choose amongst themselves. As such, they are somewhat autonomous from the rest of the newspaper, only needing to report to their superiors. As a rule, they are not to discuss their work with anyone else, whether it be family, friends or other staff at the newspaper. In 2001, the four person team consists of its editor Walter Robinson - Robby to his friends - and his three investigative journalists, Michael Rezendes, Sacha Pfeiffer and Matt Carroll. Robby reports to the assistant managing editor, Ben Bradlee Jr.. Upon his arrival from his most recent position in Florida, Marty Baron, the newly hired editor-in-chief, requests Spotlight to place their current story on hold and instead flesh out a story by a fellow Globe columnist Eileen McNamara about sexual abuse allegations of a Catholic priest against a minor, and what seems to be the cover-up by Cardinal Bernard Law, the Archdiocese of Boston. They are at first hesitant to work on the story, seeing Baron as an outsider to Boston, he who doesn't understand what is important to locals. Baron's outsider status includes not being born and raised there, and not being Catholic (he being the Globe's first Jewish editor-in-chief). Their first task is to see if they can have some court documents on the case unsealed, which means suing the Catholic church, success which is no easy task. Beyond that one step, Robby and his team talk to lawyers who have or are working on alleged sex abuse cases perpetrated by Catholic priests in Boston (those lawyers including Eric MacLeish and Mitchell Garabedian), known victims (such as Phil Saviano, the head of the Survivors Network of those Abused by Priests (SNAP)) and insiders in the Catholic church. Through this investigation, they get wind that the problem is not contained to one priest and one victim, in essence changing the focus from the priest(s) to the systemic problem of the Archdiocese not only covering up the abuse but in reality doing nothing to stop it and thus condoning it. Their goal is not only the end product of an important story, but making sure that the other major local newspapers, such as the Boston Herald, do not beat them to the scant outline of the story in the public consciousness which the Catholic church could easily quash. Through it all, they may come to some unpleasant realizations that not only the Archdiocese and the Catholic church in general are to blame for what happened.::Huggo",
        "In 2001, editor Marty Baron of The Boston Globe assigns a team of journalists to investigate allegations against John Geoghan, an unfrocked priest accused of molesting more than 80 boys. Led by editor Walter \"Robby\" Robinson, reporters Michael Rezendes, Matt Carroll and Sacha Pfeiffer interview victims and try to unseal sensitive documents. The reporters make it their mission to provide proof of a cover-up of sexual abuse within the Roman Catholic Church.::Jwelch5742",
        "In 2001, the Jewish editor Marty Baron is hired by The Boston Globe and he asks the Spotlight team to investigate the priest John Geoghan that was accused of abusing children and the lawyer Mitchell Garabedian that has told that Cardinal Law knew what his priest did. Walter 'Robby' Robinson, Mike Rezendes, Sacha Pfeiffer and Matt Carroll are fully supported by Baron and their leader Ben Bradlee, Jr. to set in motion the investigation of the priest and they contact the initially reluctant Garabedian; the lawyer Eric Macleish that has defended many victims; the leader of the victims' rights organization Phil Saviano; and several victims that accept to meet them. After one year investigation, they confirm the names of twenty pedophile priests in Boston and they publish the story showing that Cardinal Law had prior knowledge of the priests' abuse of children::Claudio Carvalho, Rio de Janeiro, Brazil",
        "The true story of how, in 2001, reporters at the Boston Globe investigated accusations of Catholic priests in Boston molesting children. Following on from leads, interviews with victims, existing court cases and extensive research they reveal decades of abuse. Moreover, they discover that the issue was far wider spread than they at first believed, that senior members of the diocese were aware of the issue and that the church systemically covered up the crimes.::grantss",
        "The true story of how the Boston Globe uncovered the massive scandal of child molestation and cover-up within the local Catholic Archdiocese, shaking the entire Catholic Church to its core."
    ],
    "language": {
        "id": [
            "English"
        ],
        "adult_language_percentage": 1.6812465828321486,
        "linguistic_difficulty_percentage": 0.0683433570256971,
        "words_per_minute": 114,
        "common_words": {
            "yeah": 152,
            "know": 103,
            "wa": 90,
            "uh": 79,
            "get": 77,
            "okay": 71,
            "right": 70,
            "think": 68,
            "church": 65,
            "hey": 63
        }
    }
}