{
    "title": "Superbad",
    "year": 2007,
    "genres": [
        "Comedy"
    ],
    "runtime": [
        "113"
    ],
    "rating": 7.6,
    "plot": [
        "Seth and Evan are best friends, inseparable, navigating the last weeks of high school. Usually shunned by the popular kids, Seth and Evan luck into an invitation to a party, and spend a long day, with the help of their nerdy friend Fogell, trying to score enough alcohol to lubricate the party and inebriate two girls, Jules and Becca, so they can kick-start their sex lives and go off to college with a summer full of experience and new skills. Their quest is complicated by Fogell's falling in with two inept cops who both slow and assist the plan. If they do get the liquor to the party, what then? Is sex the only rite of passage at hand?::<jhailey@hotmail.com>",
        "Seth, Evan and Fogell are three teenage guys who love to drink and desperately wish to get laid. When a girl that Seth really likes, asks him to get the drink for her party, he sees this as a perfect opportunity to make her his girlfriend. The trio plan out how to get the alcohol, even including Fogell's new fake ID, but things won't got smoothly for the trio. Seth and Evan become separated from Fogell (now called McLovin) and they still haven't got the alcohol for the party that night.::FilmFanUK",
        "High school seniors Evan and Seth have been best friends since they were kids, Seth the leader who is all talk and no action, Evan on the most part the faithful follower. They are part of the \"out\" crowd, meaning that they have few other friends and especially few in the \"in\" crowd. They have done everything together by themselves but their plan to be roommates at college falls apart when Seth is not accepted to their school of choice, Dartmouth. Evan decides still to attend Dartmouth and room instead with their mutual friend, the boyishly nerdish Fogell, which Evan decides not to tell Seth about if only in not wanting to make Seth feel like he is being abandoned for another known quantity. Their initial plans to hang out together by themselves for graduation takes a turn when two weeks before graduation, the pretty Jules invites Seth, and by association Evan, to her house party that evening. Knowing that Fogell is getting a fake ID made, Seth, with Jules' money, offers to purchase all the alcohol for the party. Seth believes that the alcohol is his and Evan's ticket to losing their respective virginities that evening at the party, Seth with Jules, and Evan with Becca, who he knows likes him, but whose advances he has been unable to act upon out of shyness and insecurity. But the road to purchasing the alcohol and being the kings of Jules' party takes a less than smooth path, based largely on Fogell's cluelessness about his new ID, the actions of a couple of adolescently-minded police officers, and Seth and Evan's own attitudes of what they need to do to be popular, if only for this one day. Through the process, Seth and Evan may come to a clearer picture of what their friendship truly means, and where they fit in life.::Huggo",
        "Two inseparable high school seniors trying to come out with a 'bang' before school ends. Although most consider them as losers, they want to at least get into a party, get the girl, and just be remembered.::Ethan Neihart",
        "Hilarious comedy about two high school seniors who have been best friends since they were young and are preparing to finally graduate. They aren't exactly \"popular\", however, that won't stop them from doing whatever they can to finally lose their virginity before college to the prettiest and coolest girls in school. When one of the girls asks them to get alcohol for the party they set out on an adventure to get it and bring it to the graduation house party. Unfortunately, the trip turns out to be a lot more difficult then they had originally planned. Will they make it to the party with the alcohol in time? Or will they miss the final chance to lose their virginities to the girls of their dreams and lose each other in the process?::Erica Adina Amaral",
        "Two co-dependent high school seniors are forced to deal with separation anxiety after their plan to stage a booze-soaked party goes awry.::Anonymous"
    ],
    "language": {
        "id": [
            "English"
        ],
        "adult_language_percentage": 5.03989920201596,
        "linguistic_difficulty_percentage": 0.013999720005599889,
        "words_per_minute": 126,
        "common_words": {
            "like": 162,
            "get": 135,
            "yeah": 130,
            "know": 117,
            "man": 109,
            "fuck": 109,
            "fucking": 102,
            "gonna": 99,
            "wa": 98,
            "okay": 98
        }
    }
}