{
    "title": "Tangled",
    "year": 2010,
    "genres": [
        "Animation",
        "Adventure",
        "Comedy",
        "Family",
        "Fantasy",
        "Musical",
        "Romance"
    ],
    "runtime": [
        "100"
    ],
    "rating": 7.8,
    "plot": [
        "After receiving the healing powers from a magical flower, the baby Princess Rapunzel is kidnapped from the palace in the middle of the night by Mother Gothel. Mother Gothel knows that the flower's magical powers are now growing within the golden hair of Rapunzel, and to stay young, she must lock Rapunzel in her hidden tower. Rapunzel is now a teenager and her hair has grown to a length of 70-feet. The beautiful Rapunzel has been in the tower her entire life, and she is curious of the outside world. One day, the bandit Flynn Ryder scales the tower and is taken captive by Rapunzel. Rapunzel strikes a deal with the charming thief to act as her guide to travel to the place where the floating lights come from that she has seen every year on her birthday. Rapunzel is about to have the most exciting and magnificent journey of her life.::Douglas Young (the-movie-guy)",
        "Once, a drop of the sun falls on Earth and grows a magic golden flower with the ability to heal the sick and injured. Mother Gothel sees the flower and hides it; then she finds that when she sings to the flower, she rejuvenates. Centuries pass and a kingdom is raised in the place where the flower is hidden. When the beloved Queen is about to have a baby, she gets sick and the only hope to save her is to find the magic flower. But Mother Gothel does not want to share the sun's gift and keeps the flower hidden. However, the spot is found and the magic of the golden flower heals the Queen. When the Queen's daughter Rapunzel is born, she receives the healing power from the flower and Gothel abducts her to use her magic hair to stay young. Gothel raises Rapunzel as a daughter, without cutting her hair and locks her in a high tower in an isolated area. She keeps Rapunzel far from other people, telling that it is for her own protection. The King and the Queen celebrate the anniversary of their beloved daughter releasing lanterns to the sky, and Rapunzel dreams of leaving the tower to see the floating lights from the outside world. When the thief, cheater and liar Flynn Rider steals the crown with two bandits, he is chased by the royal guard. However, he double-crosses the other thieves and flees, and climbs the tower to hide. However, Rapunzel hits him with a frying pan and hides his satchel with the crown. Rapunzel promises to return the satchel if Flynn takes her to see the lanterns. He accepts the deal and they start a dangerous journey of discoveries and love chased by the guards, the bandits and Mother Gothel.::Claudio Carvalho, Rio de Janeiro, Brazil",
        "Rapunzel, the missing daughter of a Queen and King, meets Flynn Rider, a witty criminal who teams up with the long haired princess to escape the tall tower she had been trapped in for 18 years. As they set out to find the lanterns that roam the sky each year on her birthday, they run in to silly mishaps and engage in a sing-along adventure for children of all ages!",
        "A long-lost princess with the longest hair imaginable named Rapunzel has spent her whole life in a lonely tower, dreaming of the world, waiting to discover it. When she finally starts to give up hope an escaped prisoner named Flynn Rider approaches Rapunzel's lonely tower and agrees to take her to see the lanterns that appear every day on her birthday if she would return his satchel filled with stolen jewels, including the lost princess's shiny crown. Flynn and Rapunzel embark on a journey that they will never forget and Rapunzel discovers who she really is.",
        "The magically long-haired Rapunzel has spent her entire life in a tower, but now that a runaway thief has stumbled upon her, she is about to discover the world for the first time, and who she really is.::Marc-Olivier Pagé"
    ],
    "language": {
        "id": [
            "English"
        ],
        "adult_language_percentage": 0.587149807079349,
        "linguistic_difficulty_percentage": 0.050327126321087066,
        "words_per_minute": 59,
        "common_words": {
            "know": 54,
            "wa": 47,
            "oh": 44,
            "rapunzel": 41,
            "mother": 34,
            "see": 32,
            "right": 31,
            "dream": 31,
            "like": 30,
            "well": 28
        }
    }
}