{
    "title": "The Philadelphia Story",
    "year": 1940,
    "genres": [
        "Comedy",
        "Romance"
    ],
    "runtime": [
        "112"
    ],
    "rating": 8.0,
    "plot": [
        "Philadelphia socialites Tracy Lord and C.K. Dexter Haven married impulsively, with their marriage and subsequent divorce being equally passionate. They broke up when Dexter's drinking became excessive, it a mechanism to cope with Tracy's unforgiving manner to the imperfect, imperfections which Dexter admits he readily has. Two years after their break-up, Tracy is about to remarry, the ceremony to take place at the Lord mansion. Tracy's bridegroom is nouveau riche businessman and aspiring politician George Kittredge, who is otherwise a rather ordinary man and who idolizes Tracy. The day before the wedding, three unexpected guests show up at the Lord mansion: Macaulay Connor (Mike to his friends), Elizabeth Imbrie - the two who are friends of Tracy's absent brother, Junius- and Dexter himself. Dexter, an employee of the tabloid Spy magazine, made a deal with its publisher and editor Sidney Kidd to get a story on Tracy's wedding - the wedding of the year - in return for Kidd not publishing a salacious story with accompanying photographs of Tracy's father, Seth Lord, with a New York showgirl named Tina Marra. In reality, Mike and Liz are the reporter and photographer respectively for Spy. Mike and Liz don't particularly like this assignment or working for Kidd, but they need to make a living as their chosen other fields as serious writer and painter don't pay the bills. A suspicious Tracy is onto them, the entire truth which Dexter admits to her. Tracy decides to turn the tables on Mike and Liz. However, hours before the wedding, as the more self-assured Dexter and Liz get to work on how to get the Lords out from under Spy's threats, Tracy and Mike, both inebriated, go on a journey of self-discovery with Tracy ultimately coming to her realizations a little faster than Mike.::Huggo",
        "Just as Philadelphia socialite Tracy Lord is about to remarry her first husband C.K. Dexter Haven arrives at her house. He has with him a tabloid reporter and a photographer, Macaulay 'Mike\" Connor and Elizabeth Imbrie, and he's clearly intent on causing mischief. Tracy is surprised to learn that Mike is a serious writer who works for the tabloids only to earn a paycheck. They are clearly attracted to one another and the arrival of Tracy's ne'er-do-well father - and some rather stern comments on his part - leads to her to reevaluate her choices and what it is she wants for the future.::garykmcd",
        "A Philadelphia socialite C.K. Dexter Haven as he's being tossed out of his palatial home by his wife, Tracy Lord. Adding insult to injury, Tracy breaks one of C.K.'s precious golf clubs. He gallantly responds by knocking her down on her million-dollar keester. A couple of years after the breakup, Tracy is about to marry George Kittridge, a wealthy stuffed shirt whose principal recommendation is that he's not a Philadelphia mainliner, as C.K. was. Still holding a torch for Tracy, C.K. is galvanized into action when he learns that Sidney Kidd , the publisher of Spy Magazine, plans to publish an exposé concerning Tracy's philandering father). To keep Kidd from spilling the beans, C.K. agrees to smuggle Spy reporter Macauley Connor and photographer Elizabeth Imbrie into the exclusive Lord-Kittridge wedding ceremony. How could C.K. have foreseen that Connor would fall in love with Tracy, thereby nearly lousing up the nuptials? As it turns out, of course, it is C.K. himself who pulls the louse-up, reclaiming Tracy as his bride.::Jwelch5742",
        "Philadelphia heiress Tracy Lord throws out her playboy husband C.K. Dexter Haven shortly after their marriage. Two years later, Tracy is about to marry respectable George Kittredge whilst Dexter has been working for \"Spy\" magazine. Dexter arrives at the Lord's mansion the day before the wedding with writer Mike Connor and photographer Liz Imbrie, determined to spoil things.::Col Needham <col@imdb.com>",
        "After getting a divorce from C. K. Dexter Haven, Tracy Lord prepares to marry again...however, in the days before her wedding, Haven and a reporter, posing as her brother's friend, show up at her doorstep. From there, Tracy is forced to choose among her past love, her present love, and her new love.::thexotherxchris",
        "When a rich woman's ex-husband and a tabloid-type reporter turn up just before her planned remarriage, she begins to learn the truth about herself.::Anonymous"
    ],
    "language": {
        "id": [
            "English",
            "French"
        ],
        "adult_language_percentage": 0.6197267229149556,
        "linguistic_difficulty_percentage": 0.03733293511535877,
        "words_per_minute": 119,
        "common_words": {
            "know": 81,
            "wa": 80,
            "tracy": 75,
            "oh": 66,
            "like": 65,
            "think": 55,
            "well": 52,
            "mr": 49,
            "good": 48,
            "say": 45
        }
    }
}