{
    "title": "The Silence of the Lambs",
    "year": 1991,
    "genres": [
        "Crime",
        "Drama",
        "Thriller"
    ],
    "runtime": [
        "118"
    ],
    "rating": 8.6,
    "plot": [
        "FBI trainee Clarice Starling works hard to advance her career, while trying to hide/put behind her West Virginia roots, of which if some knew, would automatically classify her as being backward or white trash. After graduation, she aspires to work in the agency's Behavioral Science Unit under the leadership of Jack Crawford. While she is still a trainee, Crawford asks her to question Dr. Hannibal Lecter, a psychiatrist imprisoned, thus far, for eight years in maximum security isolation for being a serial killer who cannibalized his victims. Clarice is able to figure out the assignment is to pick Lecter's brains to help them solve another serial murder case, that of someone coined by the media as Buffalo Bill, who has so far killed five victims, all located in the eastern US, all young women who are slightly overweight (especially around the hips), all who were drowned in natural bodies of water, and all who were stripped of large swaths of skin. She also figures that Crawford chose her, as a woman, to be able to trigger some emotional response from Lecter. After speaking to Lecter for the first time, she realizes that everything with him will be a psychological game, with her often having to read between the very cryptic lines he provides. She has to decide how much she will play along, as his request in return for talking to him is to expose herself emotionally to him. The case takes a more dire turn when a sixth victim is discovered, this one from who they are able to retrieve a key piece of evidence, if Lecter is being forthright as to its meaning. A potential seventh victim is high profile Catherine Martin, the daughter of Senator Ruth Martin, which places greater scrutiny on the case as they search for a hopefully still alive Catherine. Who may factor into what happens is Dr. Frederick Chilton, the warden at the prison, an opportunist who sees the higher profile with Catherine, meaning a higher profile for himself if he can insert himself successfully into the proceedings.::Huggo",
        "Young FBI agent Clarice Starling is assigned to help find a missing woman to save her from a psychopathic serial killer who skins his victims. Clarice attempts to gain a better insight into the twisted mind of the killer by talking to another psychopath: Hannibal Lecter, who used to be a respected psychiatrist. FBI agent Jack Crawford believes that Lecter, who is also a very powerful and clever mind manipulator, has the answers to their questions and can help locate the killer. However, Clarice must first gain Lecter's confidence before the inmate will give away any information.::Sami Al-Taher <staher2000@yahoo.com>",
        "Clarice Starling, a young intelligent FBI trainee, has been sent to the Baltimore state hospital for the criminally insane to interview an inmate, Dr. Hannibal \"the cannibal\" Lecter, a brilliant renowned psychiatrist turned infamous psychopathic serial killer. She must match wits with Lecter - who has the darkest of all minds - and trust him to give her clues in the search for \"Buffalo Bill\", a nickname given to a loose, unknown, unstoppable psychopathic serial killer...::Sam Krainak",
        "A psychopath known as Buffalo Bill is kidnapping and murdering young women across the Midwest. Believing it takes one to know one, the F.B.I. sends Agent Clarice Starling to interview a demented prisoner who may provide psychological insight and clues to the killer's actions. The prisoner is psychiatrist Dr. Hannibal Lecter, a brilliant, murderous cannibal who will only help Starling if she feeds his morbid curiosity with details of her own complicated life. This twisted relationship forces Starling to not only confront her psychological demons, but leads her face to face with a demented, heinous killer; an incarnation of evil so powerful, that she may not have the courage, or strength, to stop him.::Robert Lynch <docrlynch@yahoo.com>",
        "A young F.B.I. cadet must receive the help of an incarcerated and manipulative cannibal killer to help catch another serial killer, a madman who skins his victims.::Helltopay27"
    ],
    "language": {
        "id": [
            "English"
        ],
        "adult_language_percentage": 1.554605518849592,
        "linguistic_difficulty_percentage": 0.09068532193289286,
        "words_per_minute": 65,
        "common_words": {
            "starling": 45,
            "clarice": 41,
            "wa": 40,
            "lecter": 39,
            "sir": 35,
            "get": 34,
            "know": 34,
            "see": 30,
            "good": 30,
            "one": 30
        }
    }
}