{
    "title": "The Princess Bride",
    "year": 1987,
    "genres": [
        "Adventure",
        "Family",
        "Fantasy",
        "Romance"
    ],
    "runtime": [
        "98"
    ],
    "rating": 8.1,
    "plot": [
        "An elderly man reads the book \"The Princess Bride\" to his sick and thus currently bedridden adolescent grandson, the reading of the book which has been passed down within the family for generations. The grandson is sure he won't like the story, with a romance at its core, he preferring something with lots of action and \"no kissing\". But the grandson is powerless to stop his grandfather, whose feelings he doesn't want to hurt. The story centers on Buttercup, a former farm girl who has been chosen as the princess bride to Prince Humperdinck of Florian. Buttercup does not love him, she who still laments the death of her one true love, Westley, five years ago. Westley was a hired hand on the farm, his stock answer of \"as you wish\" to any request she made of him which she came to understand was his way of saying that he loved her. But Westley went away to sea, only to be killed by the Dread Pirate Roberts. On a horse ride to clear her mind of her upcoming predicament of marriage, Buttercup is kidnapped by a band of bandits: Vizzini who works on his wits, and his two associates, a giant named Fezzik who works on his brawn, and a Spaniard named Inigo Montoya, who has trained himself his entire life to be an expert swordsman. They in turn are chased by the Dread Pirate Roberts himself. But chasing them all is the Prince, and his men led by Count Tyrone Rugen. What happens to these collectives is dependent partly on Buttercup, who does not want to marry the Prince, and may see other options as lesser evils, and partly on the other motives of individuals within the groups. But a larger question is what the grandson will think of the story as it proceeds and at its end, especially as he sees justice as high a priority as action.::Huggo",
        "A kindly grandfather sits down with his ill grandson and reads him a story. The story is one that has been passed down from father to son for generations. As the grandfather reads the story, the action comes alive. The story is a classic tale of love and adventure as the beautiful Buttercup, engaged to the odious Prince Humperdinck, is kidnapped and held against her will in order to start a war, It is up to Westley (her childhood beau, now returned as the Dread Pirate Roberts) to save her. On the way he meets a thief and his hired helpers, an accomplished swordsman and a huge, super strong giant, both of whom become Westley's companions in his quest.::Afterburner <aburner@erols.com>",
        "When the lovely Buttercup is kidnapped by a ghastly gang intent on fermenting an international incident they find they are pursued by the Dread Pirate Roberts who just might be Westley, her one true love. Also after everyone is nasty Prince Humperdinck to whom Buttercup is now betrothed but who seems to care little for her continued survival. The stage is set for swordfights, monsters, and tortures - but will Grandpa be allowed to finish telling the story with all these kissy bits?::Jeremy Perkins {J-26}",
        "Return to a time when men and swamps were swamps. Fire Swamps, that is. Full of quicksand and Rodents of Unusual Size. Lagoons were inhabited by shrieking eels. And the most beautiful woman in the world was named . . . Buttercup? Well, it's a bent fairy tale. Complete with all the fencing, chasing, escapes, and silly accents you'd expect. Including such unique folk as Inigo Montoya, who has dreamed his whole life of finding the six-fingered man who killed his father. Fezzik is his enormous sidekick. And Max is the kvetching miracle man. Blonde Buttercup loves Westley, a poor stable boy. But when he's captured by pirates, she's chosen by evil Prince Humperdinck to be his princess bride. Along the way, she gets kidnapped, he gets killed. But it all ends up okay.::Robert Lynch <docrlynch@yahoo.com>",
        "When a young boy falls ill, his grandfather pops round to visit him. To cheer his grandson up, Grandpa has brought a storybook; The Princess Bride, a tale of the love between the beautiful Buttercup and the besotted Westley, a love cruelly interrupted by Westley's tragic apparent death at sea when seeking his fortune. Heartbroken, Buttercup has sworn never to love again, but accepts the marriage proposal of the rich and handsome Prince Humperdinck, heir to the throne of Florin; but death is no barrier to true love, and in a story filled with exotically-accented swordsmen, big-hearted giants, genius kidnappers, sadistic torturers, vile swamps, Rodents of Unusual Size, the Dread Pirate Roberts and a somewhat embittered miracle worker, the love between Westley and Buttercup twists and turns on a path filled with adventure. Will the True Love of Westley and Buttercup win the day? Will Inigo Montaya find the six-fingered man who murdered his father? Will Humperdinck's evil plans come to fruition? And, more importantly, will Grandpa be able to tell the story without any of the yucky kissing?::Scott Nisbet",
        "While home sick in bed, a young boy's grandfather reads him a story called The Princess Bride.::Movie Guy"
    ],
    "language": {
        "id": [
            "English"
        ],
        "adult_language_percentage": 1.6438671111622025,
        "linguistic_difficulty_percentage": 0.08046901942752041,
        "words_per_minute": 88,
        "common_words": {
            "wa": 62,
            "love": 44,
            "think": 33,
            "know": 32,
            "westley": 30,
            "never": 30,
            "one": 28,
            "man": 27,
            "right": 26,
            "well": 25
        }
    }
}