{
    "title": "The Exorcist",
    "year": 1973,
    "genres": [
        "Horror"
    ],
    "runtime": [
        "122"
    ],
    "rating": 8.0,
    "plot": [
        "A visiting actress in Washington, D.C., notices dramatic and dangerous changes in the behavior and physical make-up of her 12-year-old daughter. Meanwhile, a young priest at nearby Georgetown University begins to doubt his faith while dealing with his mother's terminal sickness. And, book-ending the story, a frail, elderly priest recognizes the necessity for a show-down with an old demonic enemy.::Andrew Harmon <aharmon@erols.com>",
        "Accompanied by her 12 year-old daughter Regan, actress Chris McNeil relocates to Washington D.C. where she is filming a movie. Mother and daughter have a good relationship but after a time Regan begins to act strangely. She undergoes various neurological tests but doctors can find nothing to explain her behavior. As Regan's situation reaches crisis proportions - she has to be tied to her bed, swears like a sailor and speaks in tongues - Chris turns to Father Karras, a Roman Catholic priest and psychiatrist to see if an exorcism might be the solution to their problem. Karras is incredulous but the church eventually agrees calling in Father Merrin, who has previously conducted an exorcism and come face to face with the devil.::garykmcd",
        "Separated from her actor husband, Hollywood actress Chris MacNeil and her preteen daughter Regan are in Washington DC, where Chris is on an extended location shoot for a movie called \"Crash Course\". They have rented a brownstone in Georgetown as a place to live during the shoot, after which Chris plans to take Regan to Europe until their new house in Los Angeles is constructed. Chris continually hears noises in the middle of the night emanating from the attic, which she assumes is nothing more than a small infestation of rats. Concurrently, Regan, who had been an even keeled child, is showing periodic signs of unusual behavior, such as hyperactivity, swearing, lying and lack of concentration. The GP, Dr. Klein, who can only surmise the symptoms are a manifestation of stress from the separation and temporary move to DC away from her home, diagnoses her condition, solely based on the symptoms, as hyperkinesia. Despite Dr. Klein and other physicians trying to determine and explain Regan's increasingly abnormal and bizarre behavior with scientific theories, Chris begins to believe that there is more at play, especially as Regan's behavior ultimately includes violence and acts of superhuman strength, which can only be classified as other worldly which Regan herself could not have directly caused on her own, such as the rat-less noises in the attic. Despite having no religious convictions, Chris is convinced that since there is some other worldly force overtaking Regan, a course of action is to have that force - the demon - exorcised from Regan's being. Who contacts her is Father Damien Karras - also an M.D. who acts as a psychiatric counselor for the Catholic church - who Chris for whatever reason had been drawn to as a person she has seen in the neighborhood. Father Karras is facing his own crisis of faith upon the recent death of his mother. He needs not only the permission of the church to proceed but also his own faith that whatever he does will help as opposed to hurt Regan. Who the church also sends is Father Lankester Merrin, who may have a better understanding of what has possessed Regan and why it has chosen her, which is necessary to be able to combat it. The questions become whether Fathers Merrin and Karras have a strong enough faith to exorcise the demon and what they are willing to do to achieve their mission.::Huggo",
        "Something beyond evil is happening in a little girl's room. Regan has brutally changed both in the way she looks and the way she acts, with violent outbursts on everyone who comes in contact with her. Her worried mother gets in contact with a priest who comes to the conclusion that Regan is possessed. The top priest who can deal with an exorcism, Father Merrin, is called in to help save Regan from the demon inside her.::FilmFanUk",
        "A movie actress taking up temporary residence in Washington D.C. has her troubles. The script for the movie she's filming seems inadequate. Her ex, who is also the father of her adolescent daughter, Regan, neglects to call the girl on her birthday. And the attic has rats. Meanwhile, Father Karras, a priest and a psychiatrist, is losing his faith; and he's dealing with a sick mother who needs medical care he hasn't the money to provide. Another priest, the old and ailing Father Merrin, has just returned from Iraq with forebodings of evil. These three persons meet when the sweet and cheerful Regan turns foul-mouthed and violent. But her sickness is beyond the reach of a medical doctor or a psychiatrist. What Regan needs is an exorcist.::J. Spurlin",
        "When a teenage girl is possessed by a mysterious entity, her mother seeks the help of two priests to save her daughter.::paulrichard"
    ],
    "language": {
        "id": [
            "English",
            "Latin",
            "Greek",
            "French",
            "German",
            "Arabic",
            "Kurdish"
        ],
        "adult_language_percentage": 2.7537277537277536,
        "linguistic_difficulty_percentage": 0.06012506012506013,
        "words_per_minute": 68,
        "common_words": {
            "know": 58,
            "christ": 46,
            "like": 46,
            "oh": 44,
            "wa": 44,
            "father": 44,
            "well": 39,
            "regan": 38,
            "see": 37,
            "right": 36
        }
    }
}