{
    "title": "The Last Picture Show",
    "year": 1971,
    "genres": [
        "Drama"
    ],
    "runtime": [
        "118"
    ],
    "rating": 8.1,
    "plot": [
        "In tiny Anarene, Texas, in the lull between World War Two and the Korean Conflict, Sonny and Duane are best friends. Enduring that awkward period of life between boyhood and manhood, the two pass their time the best way they know how -- with the movie house, football, and girls. Jacey is Duane's steady, wanted by every boy in school, and she knows it. Her daddy is rich and her mom is good looking and loose. It's the general consensus that whoever wins Jacey's heart will be set for life. But Anarene is dying a quiet death as folks head for the big cities to make their livings and raise their kids. The boys are torn between a future somewhere out there beyond the borders of town or making do with their inheritance of a run-down pool hall and a decrepit movie house -- the legacy of their friend and mentor, Sam the Lion. As high school graduation approaches, they learn some difficult lessons about love, loneliness, and jealousy. Then folks stop attending the second-run features at the movie house and the time comes for the last picture show. With the closure of the movie house, the boys feel that a stage of their lives is closing. They stand uneasily on the threshold of the rest of their lives. (The movie was adapted from the novel by Larry McMurtry).::Mark Fleetwood <mfleetwo@mail.coin.missouri.edu>",
        "It's 1951 in the small town of Anarene, located in the dust bowl of Texas. Sam the Lion, owner of the local café, pool hall and movie theater, and the unofficial father figure to many of the young men of the town, is one of the few people who seems content with his life in Anarene. Life in Anarene for the younger generation in particular seems to hold little interest and not much of a future. The sensitive Sonny Crawford and brusque Duane Jackson are high school seniors, co-captains of the hapless high school football team, and best friends. Duane is dating the beautiful Jacy Farrow, the daughter of the town's oil baron. Jacy's mother, Lois Farrow, offers Jacy advice for her future: marry the boy who offers the greatest opportunity, especially in escaping Anarene, that boy who isn't Duane. Jacy goes on that pursuit for good or bad. Sonny just broke up with his long time girlfriend Charlene Tuggs, the two who dated seemingly since there was nothing better to do. While Sonny dreams of Jacy, as do many of the boys, he ends up in an affair with middle aged Ruth Popper, the unhappy wife of the high school's football and basketball coach. These encounters and relationships, especially for Sonny, Duane and Jacy, who are just coming to the age of exploring their sexuality, show just what future there is for them in Anarene.::Huggo",
        "In 1951, a group of high schoolers come of age in a bleak, isolated, atrophied West Texas town that is slowly dying, both culturally and economically.::duke1029@aol.com"
    ],
    "language": {
        "id": [
            "English"
        ],
        "adult_language_percentage": 1.432812701690977,
        "linguistic_difficulty_percentage": 0.01290822253775655,
        "words_per_minute": 65,
        "common_words": {
            "get": 67,
            "wa": 65,
            "know": 58,
            "got": 56,
            "go": 48,
            "want": 47,
            "like": 45,
            "come": 37,
            "one": 32,
            "guess": 31
        }
    }
}