{
    "title": "The King's Speech",
    "year": 2010,
    "genres": [
        "Biography",
        "Drama",
        "History"
    ],
    "runtime": [
        "118"
    ],
    "rating": 8.0,
    "plot": [
        "Britain's Prince Albert must ascend the throne as King George VI, but he has a speech impediment. Knowing that the country needs her husband to be able to communicate effectively, Elizabeth hires Lionel Logue, an Australian actor and speech therapist, to help him overcome his stammer. An extraordinary friendship develops between the two men, as Logue uses unconventional means to teach the monarch how to speak with confidence.::Jwelch5742",
        "Tells the story of the man who became King George VI, the father of Queen Elizabeth II. After his brother abdicates, George ('Bertie') reluctantly assumes the throne. Plagued by a dreaded stammer and considered unfit to be king, Bertie engages the help of an unorthodox speech therapist named Lionel Logue. Through a set of unexpected techniques, and as a result of an unlikely friendship, Bertie is able to find his voice and boldly lead the country through war.::Anonymous",
        "Biopic about Britain's King George VI (father of present day Queen Elizabeth II) and his lifelong struggle to overcome his speech impediment. Suffering from a stammer from the age of 4 or 5, the young Prince Albert dreaded any public speaking engagement. History records that his speech at the closing of the 1925 Commonwealth exhibition in London was difficult for both him and everyone listening that day. He tried many different therapies over many years but it was only when he met Lionel Logue, a speech therapist, that he truly began to make progress. Logue did not have a medical degree but had worked as an elocution coach in the theater and had worked with shell-shocked soldiers after World War I. Through a variety of techniques and much hard work, Albert learns to speak in such a way so as to make his impediment a minor problem and deliver a faultless speech heard around the world by radio when the UK declared war on Nazi Germany in 1939. The King and Logue remained lifelong friends.::garykmcd",
        "In the mid 1930s, King George VI is concerned about the immediate future of the British monarchy. His eldest son David, first in line for the throne, is in a relationship with American divorcée Wallis Simpson. Marriage to a divorcée and being King of The United Kingdom (and thus head of the Established Church) are incompatible. King George V's second son, Albert (or Bertie as he is called by family), second in line for the throne, speaks with a stammer, something he's had since he was a child. Although a bright and temperamental man, Bertie, because of his stammer, does not capture the confidence of the public, which is paramount if Britain does enter into war against Hitler's regime. As King George V observes about living in a communications age, a king can no longer get by in life solely by looking good in a regal uniform and knowing how to battle riding a horse. Elizabeth, Bertie's loving wife, wants to help her husband gain confidence solely in his increasing need to speak at public functions, regardless if he becomes king or not. She finds an unconventional Australian-raised speech therapist named Lionel Logue to help assist in curing Bertie's stammer, with no one, even Lionel's family, knowing he has this job with the royal highness. Lionel and Bertie's relationship is often an antagonistic one as Lionel feels the need for the two to be equals during their sessions - with Lionel even calling him \"Bertie\" instead of \"Your Royal Highness\" in their sessions, which doesn't sit well with Albert, not used to such familiarity with a commoner. Lionel does in time become Bertie's confidante and friend, especially from Lionel's side as he tries to determine the psychological issues behind the speech impediment. An issue with Lionel (which he does not hide but also does not fully disclose) may threaten their relationship altogether, which may be especially problematic as a still stammering Bertie ultimately becomes King George VI and Britain enters into war with Germany.::Huggo / edited by statmanjeff",
        "In 1925, the Duke of York is stammerer and has troubles to speak to the public. His wife Elizabeth seeks the treatment of the speech therapist Lionel Logue that follows unconventional methods and relationship, and Bertie gives up the treatment on the first day. However, after listening to the session that was recorded by Lionel, the Bertie returns to the treatment. In the mid 30's, the Duke of York is forced to assume the throne of The United Kingdom as King George VI due to the abdication of his older brother King Edward VIII. Immediately after, there is a crisis in the government and Britain declares war with Germany. King George VI needs to make a speech to his compatriots, and his friend Lionel helps him using an unorthodox technique.::Claudio Carvalho, Rio de Janeiro, Brazil",
        "The story of King George VI of the United Kingdom of Great Britain and Northern Ireland, his impromptu ascension to the throne and the speech therapist who helped the unsure monarch become worthy of it.::Kenneth Chisholm"
    ],
    "language": {
        "id": [
            "English"
        ],
        "adult_language_percentage": 1.4574362371646241,
        "linguistic_difficulty_percentage": 0.09937065253395165,
        "words_per_minute": 76,
        "common_words": {
            "yu": 329,
            "f": 128,
            "n": 119,
            "yur": 108,
            "nt": 72,
            "fr": 54,
            "wa": 50,
            "well": 45,
            "king": 44,
            "dn": 44
        }
    }
}