{
    "title": "The Social Network",
    "year": 2010,
    "genres": [
        "Biography",
        "Drama"
    ],
    "runtime": [
        "120"
    ],
    "rating": 7.7,
    "plot": [
        "On a fall night in 2003, Harvard undergrad and computer programming genius Mark Zuckerberg sits down at his computer and heatedly begins working on a new idea. In a fury of blogging and programming, what begins in his dorm room soon becomes a global social network and a revolution in communication. A mere six years and 500 million friends later, Mark Zuckerberg is the youngest billionaire in history... but for this entrepreneur, success leads to both personal and legal complications.::Columbia Pictures",
        "Every age has its visionaries who leave, in the wake of their genius, a changed world--but rarely without a battle over exactly what happened and who was there at the moment of creation. \"The Social Network\" explores the moment at which Facebook was invented--through the warring perspectives of the super-smart young men who each claimed to be there at its inception. The movie moves from the halls of Harvard to the cubicles of Palo Alto to capture the heady early days of a culture-changing phenomenon in the making--and the way it both pulled a group of young revolutionaries together and then split them apart. In the midst of the chaos are Mark Zuckerberg (Jesse Eisenberg), the brilliant Harvard student who conceived a Web site; Eduardo Saverin (Andrew Garfield), once Zuckerberg's close friend, who provided the seed money for the fledgling company; Napster founder Sean Parker (Justin Timberlake), who brought Facebook to Silicon Valley's venture capitalists; and the Winklevoss twins (Armie Hammer and Josh Pence), the Harvard classmates who asserted that Zuckerberg stole their idea and then sued him for ownership of it. Each has his own narrative, his own version of the Facebook story in this multi-level portrait of 21st Century success--both the youthful fantasy of it and its finite realities as well.::Columbia Pictures",
        "As told through flashbacks via deposition hearings for two concurrent lawsuits, the development and early days of the social networking website Facebook is presented. Harvard students Mark Zuckerberg and Eduardo Saverin - officially listed as the co-founders of the website - were once best friends. Based on an on-line blog about his ex-girlfriend and a site he developed allowing its users to rate the hotness factor of girls on campus, Zuckerberg, who exhibited a streak of arrogance, was asked by fellow Harvardites, wealthy twins Cameron Winklevoss and Tyler Winklevoss, and their friend Divya Narendra, to enter into an agreement to develop a social networking website specifically for Harvard students, the attraction for people to visit it being its exclusivity solely to Harvard students. Zuckerberg agreed. Zuckerberg, with financing from his friend Saverin, decided instead to develop his own website without telling the \"Winklevi\" (as he calls the twins) and Narenda. Zuckerberg's assertion was that he never used a line of code provided by the three in his work. As \"thefacebook\" as it was then called began to blossom, the twins and Narenda had to figure out what to do to regain what they believed their intellectual property without having to sue, since that's not what gentlemanly Harvardites do. As the site was brought to more and more university campuses, Zuckerberg and Saverin began to have a difference of opinion: Saverin wanted to sell ad space to generate revenue (as he had been the website's sole financier and he had profit mentality based on being an economics major), while Zuckerberg, never one interested in money, didn't want to go that route as the ads would make the site lose its \"cool\" factor, which made it popular. The site attracted the attention of the founder of Napster, Sean Parker, whose own dot com life had its spectacular ups and spectacular downs. As Parker ingratiated himself into Facebook's life (much to Saverin's chagrin) and as Zuckerberg began increasingly to side with Parker, Saverin slowly began to be phased out of both Zuckerberg's personal and professional life.::Huggo",
        "Not very good at expressing himself in person, Mark Zuckerberg (Jesse Eisenberg) first alienates himself from his girlfriend, who feels conversing with him is like working the 'stairmaster', while taking strong exception to his condescending remarks towards her. He and his buddy, Eduardo Saverin (Andrew Garfield), plagiarize a proposed networking website from Cameron and Tyler Winklevoss, and Divya Narendra, made exclusively for Harvadites - re-naming it 'The Facebook'. This site connects students, describes what drives life in college, who's single, and how to hook-up with girls. Both then are approached by Napster-fame Sean Parker (Justin Timberlake), and upon his advise, 'The' is removed - giving birth to the now-revolutionary 'Facebook' - that can be accessed by anyone worldwide - not just a few exclusive campuses. But his competitiveness, inability to communicate, and the urge to be number one, will alienate him, and result in two lawsuits - one from the Winklevoss twins - and the second from none other than Eduardo himself.::rAjOo (gunwanti@hotmail.com)",
        "The story of the creators of Facebook and the subsequent legal battles that stretched out over several years. Told mostly in flashbacks while Mark Zuckerman gives depositions in two lawsuits, the idea of a shareable social information site came to him one night after he hacked into his school's database and published the photos of all the women at the school. One of his roommates, Eduardo Saverin, provides the upfront financing and Zuckerman deftly outmaneuvers two other students who had a similar idea. The relationship with Saverin deteriorates and he soon finding himself on the outside looking in. All in all, an unflattering picture of all those involved.::garykmcd",
        "Harvard student Mark Zuckerberg creates the social networking site that would become known as Facebook, but is later sued by two brothers who claimed he stole their idea, and the co-founder who was later squeezed out of the business.::jgp3553@yahoo.com"
    ],
    "language": {
        "id": [
            "English",
            "French"
        ],
        "adult_language_percentage": 0.8931761343336906,
        "linguistic_difficulty_percentage": 0.07740859830891986,
        "words_per_minute": 139,
        "common_words": {
            "wa": 170,
            "know": 116,
            "mark": 79,
            "yeah": 75,
            "gonna": 71,
            "get": 68,
            "right": 68,
            "go": 64,
            "one": 58,
            "facebook": 54
        }
    }
}