{
    "title": "The Pursuit of Happyness",
    "year": 2006,
    "genres": [
        "Biography",
        "Drama"
    ],
    "runtime": [
        "117"
    ],
    "rating": 8.0,
    "plot": [
        "Based on a true story about a man named Christopher Gardner. Gardner has invested heavily in a device known as a \"bone density scanner\". He feels like he has it made selling these devices. However, they do not sell well as they are marginally better than x-ray at a much higher price. As Gardner works to make ends meet, his wife leaves him and he loses his apartment. Forced to live out in the streets with his son, Gardner continues to sell bone density scanners while concurrently taking on an unpaid internship as a stockbroker, with slim chances for advancement to a paid position. Before he can receive pay, he needs to outshine the competition through 6 months of training, and to sell his devices to stay afloat.::John Wiggins, Alf Fonz",
        "1981, San Francisco. In what limited academic opportunities he has had in his life, Chris Gardner has demonstrated that he is a smart man. Yet he is struggling financially in his life. He has invested all his money on portable bone density scanners, which he personally sells to physicians. Despite being a better product than x-rays machines, they are also far more expensive, meaning that they are an unnecessary luxury for most physicians. He needs to sell three scanners per month just to meet the basic necessities to support his family, his wife, Linda, and their five year old son, Christopher, on who he dotes since he didn't know his own father when he was a child. But lately, that has been three per month more than he has sold, resulting in an increasing embittered Linda continually needing to work double shifts doing manual work at a laundry, which still isn't enough to cover those basic costs, they being currently behind three months rent. Chris can't afford to pay his parking ticket, meaning that he has to take the bus everywhere now as the clamp remains on the tire of his car. Feeling like the scanner is not the answer to their financial problems, Chris, with or without Linda's blessing, decides to take a chance by switching careers when he sees that brokerage and securities firm Dean Witter has a six month internship program, which only admits twenty applicants, leading to only one intern being hired at the end of the process. It isn't until he is well immersed into the process that he learns that the internships are non-paying. Based largely on his chutzpah, Chris, against the odds, gets one of the twenty positions. With some changes in their lives resulting in fewer expenses, Chris figures he needs to sell his remaining six scanners just to scrape by for those six months. But some unexpected issues arise which leads to the Gardners possibly not making it through this phase of their lives financially, something he has to hide from his superiors at Dean Witter if he has any chance at all of making it through the internship and getting that paying job with them.::Huggo",
        "In 1981, in San Francisco, the smart salesman and family man Chris Gardner invested the family savings in Ostelo National bone-density scanners, an apparatus twice more expensive than x-ray with practically the same resolution. The white elephant financially breaks the family, bringing troubles to the relationship with his wife that leaves him and moves to New York. Without money and wife, but totally committed with his son Christopher, Chris sees the chance to fight for a stockbroker internship position at Dean Witter, vying for one career in the end of six months training period without any salary with other twenty candidates. Meanwhile, homeless, he has all sorts of difficulties with his son.::Claudio Carvalho, Rio de Janeiro, Brazil",
        "Chris Gardner has big dreams for him and his family but it doesn't seem to come together for him. Chris has an opportunity to be a stock broker but first he has to go through a grueling internship which means no pay. Chris decides to do it but when his wife leaves and he is evicted, he has to take care of his son on his own. So they find themselves sometimes living on the street and struggling to get by. But Chris is determined to make it.::rcs0411@yahoo.com",
        "A struggling salesman takes custody of his son as he's poised to begin a life-changing professional career.::IMDb Editors and assmn316"
    ],
    "language": {
        "id": [
            "English",
            "Cantonese"
        ],
        "adult_language_percentage": 0.48187241854061497,
        "linguistic_difficulty_percentage": 0.04589261128958238,
        "words_per_minute": 74,
        "common_words": {
            "right": 86,
            "yeah": 77,
            "hey": 74,
            "chris": 71,
            "go": 68,
            "come": 58,
            "get": 57,
            "know": 56,
            "wa": 55,
            "thank": 55
        }
    }
}