{
    "title": "The Color of Money",
    "year": 1986,
    "genres": [
        "Drama",
        "Sport"
    ],
    "runtime": [
        "119"
    ],
    "rating": 7.0,
    "plot": [
        "Pool hustler Fast Eddie Felson finds the young, promising pool player Vincent in a local bar and he sees in him a younger version of himself. To try and make it as in the old days, Eddie offers to teach Vincent how to be a hustler. After some hesitations Vincent accepts and Eddie takes him and Vincent's girlfriend Carmen on a tour through the country to work the pool halls. However, Vincent's tendency to show off his talent and by doing so warning off the players and losing money, soon leads to a confrontation with Eddie.::Leon Wolters <wolters@strw.LeidenUniv.nl>",
        "Eddie \"Fast Eddy\" Felson, a former pool player forced into retirement by gangsters (as seen in \"The Hustler\",) finds himself, self-respect, and finally, redemption when he enters a relationship with young pool player Tom Cruise very similar to his own early career. As they travel together, Fast Eddy realizes how much he had lost, and can see the inevitable finale of their relationship as history begins to repeat itself. In an effort to avert tragedy, Eddy severs their relationship, and returns to his first love, pool. Finally, in a big Atlantic City tournament, Cruise returns the favor, and teaches Eddy the final lesson that allows him to finish his quest of re-discovery.::Anonymous",
        "Fast Eddie Felson teaches a cocky but immensely talented protégé the ropes of pool hustling, which in turn inspires him to make an unlikely comeback.::jgp3553@yahoo.com"
    ],
    "language": {
        "id": [
            "English",
            "Spanish"
        ],
        "adult_language_percentage": 1.7133227225915175,
        "linguistic_difficulty_percentage": 0.0,
        "words_per_minute": 89,
        "common_words": {
            "know": 103,
            "yeah": 83,
            "eddie": 81,
            "got": 78,
            "guy": 78,
            "go": 72,
            "right": 68,
            "get": 66,
            "want": 65,
            "hey": 63
        }
    }
}