{
    "title": "The Grand Budapest Hotel",
    "year": 2014,
    "genres": [
        "Adventure",
        "Comedy",
        "Drama"
    ],
    "runtime": [
        "99"
    ],
    "rating": 8.1,
    "plot": [
        "GRAND BUDAPEST HOTEL recounts the adventures of Gustave H, a legendary concierge at a famous European hotel between the wars, and Zero Moustafa, the lobby boy who becomes his most trusted friend. The story involves the theft and recovery of a priceless Renaissance painting and the battle for an enormous family fortune -- all against the back-drop of a suddenly and dramatically changing Continent.::Fox Searchlight Pictures",
        "A teenage girl visits the monument of the writer who penned the book, \"The Grand Budapest Hotel\". In 1968, that author was inspired to write the book when he visited that hotel, located in the European mountainous country formerly known as Zubrowka. Once a luxurious hotel, it, in 1968, has fallen on hard times. The author meets the then current owner, M. Zero Moustafa, who recounts the story of how he became the hotel's owner and why he holds onto it and keeps it open despite it obviously making him no money. Zero's story begins in 1932, when the hotel was in its golden era. Zero was the novice immigrant lobby boy, who, like all the other hotel staff, was under the guidance of M. Gustave H., the devoted concierge. Gustave aimed to please, he giving the guests whatever they wanted, especially the wealthy blonde women. The story largely revolves around one of those women, the wealthy Madame Céline Villeneuve Desgoffe-und-Taxis - better known as Mme. D. - her opportunistic son Dimitri, the bequeathing of a valuable painting called \"Boy with Apple\" to Gustave, the mysterious circumstances surrounding her death which is initially pinned on Gustave, and the attempts of Zero, his girlfriend - a baker's assistant named Agatha - and others to clear Gustave's name while Dimitri does whatever he needs to get what he believes is rightfully his, namely the painting.::Huggo",
        "A writer travels to the decadent Grand Budapest Hotel in the mountains of the Republic of Zubrowka and he meets the owner Mr. Zero Moustafa, who is a very simple man. Zero invites the author to have dinner with him and he tells his story and how he became the owner of the hotel. In 1932, in the glorious days of the Grand Budapest Hotel, Zero Moustafa is hired to work as lobby boy under the command of the legendary concierge Monsieur Gustave H that becomes his friend. Gustave efficiently manages the hotel and staff and also attends the sexual needs of the old ladies lodged at the hotel. He spends one night with Madame Céline Villeneuve \"Madame D\" Desgoffe und Taxis and soon he learns that she was found dead at home. Gustave summons Zero to travel with him to the funeral and he learns that he has inherited the valuable painting Boy with Apple. Madame D's son Dimitri and her family do not accept that a concierge may have inherited the painting and Gustave and Zero steal it and return to the Grand Budapest Hotel. Gustave promises Zero that he would be his heir for helping him. But Gustave is falsely accused of murdering Madame D and is arrested and imprisoned. Will his friend Zero leave him die in the prison?::Claudio Carvalho, Rio de Janeiro, Brazil",
        "In the far reaches Eastern Europe in the former Republic of Zubrowka, there once was the Grand Budapest hotel. A writer remembers a stay at the hotel during the off season many years ago and recalls the tales he heard of the hotel's past from the elderly owner, Mr. Mustafa. He tells the young writer about how he came to acquire the hotel and of the original concierge of the Grand Budapest, M. Gustave H. Mustafa was a lobby boy at the time and accompanies Gustave to the reading of a will after one of their regular guests dies. She leaves Gustave a valuable painting but when the woman's son challenges the will, Gustave and Mustafa steal the painting setting off a series of events that will lead to Mustafa present circumstance.::garykmcd",
        "In the 1930s, the Grand Budapest Hotel is a popular European ski resort, presided over by concierge Gustave H.. Zero, a junior lobby boy, becomes Gustave's friend and protege. Gustave prides himself on providing first-class service to the hotel's guests, including satisfying the sexual needs of the many elderly women who stay there. When one of Gustave's lovers dies mysteriously, Gustave finds himself the recipient of a priceless painting and the chief suspect in her murder.::Jwelch5742",
        "The adventures of Gustave H, a legendary concierge at a famous hotel from the fictional Republic of Zubrowka between the first and second World Wars, and Zero Moustafa, the lobby boy who becomes his most trusted friend.::Fox Searchlight Pictures / marianoandres"
    ],
    "language": {
        "id": [
            "English",
            "French",
            "German"
        ],
        "adult_language_percentage": 1.5638259182931264,
        "linguistic_difficulty_percentage": 0.23033094920596434,
        "words_per_minute": 83,
        "common_words": {
            "wa": 58,
            "gustave": 45,
            "one": 34,
            "know": 29,
            "well": 29,
            "never": 27,
            "yes": 27,
            "sir": 23,
            "course": 22,
            "right": 21
        }
    }
}