{
    "title": "The Good, the Bad and the Ugly",
    "year": 1966,
    "genres": [
        "Western"
    ],
    "runtime": [
        "161"
    ],
    "rating": 8.9,
    "plot": [
        "Blondie (The Good) is a professional gunslinger who is out trying to earn a few dollars. Angel Eyes (The Bad) is a hit man who always commits to a task and sees it through, as long as he is paid to do so. And Tuco (The Ugly) is a wanted outlaw trying to take care of his own hide. Tuco and Blondie share a partnership together making money off Tuco's bounty, but when Blondie unties the partnership, Tuco tries to hunt down Blondie. When Blondie and Tuco come across a horse carriage loaded with dead bodies, they soon learn from the only survivor (Bill Carson) that he and a few other men have buried a stash of gold in a cemetery. Unfortunately Carson dies and Tuco only finds out the name of the cemetery, while Blondie finds out the name on the grave. Now the two must keep each other alive in order to find the gold. Angel Eyes (who had been looking for Bill Carson) discovers that Tuco and Blondie met with Carson and knows they know the location of the gold. All he needs is for the two to lead him to it. Now The Good, The Bad and The Ugly must all battle it out to get their hands on $200,000 worth of gold.::Jeremy Thomson",
        "During the American Civil War, three men set off to find $200,000 in buried gold coins. Tuco and Blondie have known each other for some time now having used the reward on Tuco's head as a way of earning money. They come across a dying man, Bill Carson, who tells them of a treasure in gold coins. By chance, he tells Tuco the name of the cemetery and tells Blondie the name of the grave where the gold is buried. Now rivals, the two men have good reason to keep each other alive. The third man, Angel Eyes, hears of the gold stash from someone he's been hired to kill. All he knows is to look for for someone named Bill Carson. The three ultimately meet in a showdown that takes place amid a major battle between Confederate and Union forces.::garykmcd",
        "Set during the Civil War, three men search for a fortune in gold. One of these men is Angel Eyes, a cold blooded hired killer who was hired by a man to locate his partner who vanished with the gold but he doesn't tell Angel Eyes why he wants him. But Angel Eyes finds out while looking for the man and tells the man who hired him what he found out. But he kills him so he can get the gold himself. The other two men are Tuco and a guy he calls Blondie. Tuco is a bandit. Blondie captures him and turns him in for the reward. But when Tuco is about to be hung, Blondie saves him and they go off and do it somewhere else. After their latest attempt, Bloncie tells Tuco they've taken it as far as they can. He leaves Tuco and doesn't give him his share. Tuco tracks him down and makes walk across the desert. Later they come across a stagecoach filled with men who are dead wearing Confederate uniforms, Tuco finds a man dying who just happens to be the man Angel Eyes is looking for. He tells Tuco about the gold but before he could tell Tuco where it is he passes out. So Tuco goes to get some water but when he comes back, the man is dead. But Blondie is there and Tuco thinks the man told him where the gold is. So he nurses him back to health. They put on the uniforms and take the stagecoach. They come across some soldiers who they thought were Confederate but were actually Union so they take them prisoner and bring them to the Fort. Angel Eyes is there, an officer. When he learns Tuco took the identity of the man is looking for, he assumes he knows about the gold. So he talks to Tuco and he \"gets\" him to tell him about the gold but Blondie is the one who knows where it is. So he brings Blondie to him but he's not intimidated. So he agrees to take him to where the gold is. So the three of them head off to get the gold. But can they trust each other.::rcs0411@yahoo.com",
        "Three different men of three different tempers and tastes get involved in a long and full-of-adventure battle in order to find a fortune in gold. While the first man who is an ex-bounty hunter and a forgiving person knows the name of the cemetery which the gold is buried in, the second who is a fast-tempered greedy man knows the name on the grave. But the third person, a cruel cold-blooded murderer, knows none; so he has to reach the gold in his own way of finding something.::J. S. Golden",
        "A $200,000 shipment of Confederate gold is ambushed by Yankees in the Southwest making it open season for huge news for every grifter, bad guy and bounty hunter in the area. Blondie, Angel Eyes and Tuco are Good, Bad and Ugly, respectively. Each one of the three has a key portion of the puzzle leading to the location of the gold. But, none of them ever learned to share.::LA-Lawyer",
        "A Mexican bandit named Tuco learns of a stash of gold hidden in a remote military cemetery. However, he only gets half of the information. So he must work together with his former scam partner Blondie, who has the other half of the information, to find it.",
        "A bounty hunting scam joins two men in an uneasy alliance against a third in a race to find a fortune in gold buried in a remote cemetery.::Helltopay27"
    ],
    "language": {
        "id": [
            "Italian",
            "English"
        ],
        "adult_language_percentage": 2.253782031491201,
        "linguistic_difficulty_percentage": 0.06174745291756715,
        "words_per_minute": 40,
        "common_words": {
            "know": 40,
            "name": 37,
            "get": 35,
            "one": 32,
            "come": 32,
            "go": 30,
            "like": 29,
            "carson": 29,
            "blondie": 29,
            "yeah": 28
        }
    }
}