{
    "title": "The Sound of Music",
    "year": 1965,
    "genres": [
        "Biography",
        "Drama",
        "Family",
        "Musical",
        "Romance"
    ],
    "runtime": [
        "172"
    ],
    "rating": 8.0,
    "plot": [
        "In 1930's Austria, a young woman named Maria is failing miserably in her attempts to become a nun. When the Navy captain Georg Von Trapp writes to the convent asking for a governess that can handle his seven mischievous children, Maria is given the job. The Captain's wife is dead, and he is often away, and runs the household as strictly as he does the ships he sails on. The children are unhappy and resentful of the governesses that their father keeps hiring, and have managed to run each of them off one by one. When Maria arrives, she is initially met with the same hostility, but her kindness, understanding, and sense of fun soon draws them to her and brings some much-needed joy into all their lives -- including the Captain's. Eventually he and Maria find themselves falling in love, even though Georg is already engaged to a Baroness and Maria is still a postulant. The romance makes them both start questioning the decisions they have made. Their personal conflicts soon become overshadowed, however, by world events. Austria is about to come under the control of Germany, and the Captain may soon find himself drafted into the German navy and forced to fight against his own country.::LOTUS73",
        "Maria always wanted to be a nun ever since she was a little child but when she grew up and join them, she could not cope because of her wild and longing- to- be- free personality. She is however sent away to be the governess of seven children who give governesses a hard time and live with their wifeless and widowered father who run the house as he runs his ship. Maria however succeeds in bringing happiness and music back to the house. She and the captain eventually start falling in love but it cannot work out due to some certain reasons.::Ropheka Adejugbe",
        "Maria had longed to be a nun since she was a young girl, yet when she became old enough discovered that it wasn't at all what she thought. Often in trouble and doing the wrong things, Maria is sent to the house of a retired naval captain, named Captain Von Trapp, to care for his children. Von Trapp was widowed several years before and was left to care for seven 'rowdy' children. The children have run off countless governesses. Maria soon learns that all these children need is a little love to change their attitudes. Maria teaches the children to sing, and through her, music is brought back into the hearts and home of the Von Trapp family. Unknowingly, Maria and Captain Von Trapp are falling helplessly in love, except there are two problems, the Captain is engaged, and Maria is a postulant!::Katy Richardson",
        "Baron Von Trapp, a widower, runs his home near Salzburg like the ship he once commanded. That changes when Maria arrives from the convent to be the new governess of his seven children. Their romps through the hills inspire all to sing and to find joy in the smallest things -- like raindrops on window panes. With a renewed zest for life, the baron hosts a party to introduce his new fiance. Maria knows then she does not want to be a nun. She marries the baron. The happy ever after part is threatened when Austria's new German rulers want the baron back in military service.::Dale O'Connor <daleoc@interaccess.com>",
        "Maria is a failure as a nun. The Mother Superior sends her off in answer to a letter from a retired naval captain for a governess for his seven children. She goes to their house and finds that she is the latest in a long line of governesses run off by the children. She teaches the children to sing and that becomes their bonding force, of course leading her to fall in love with their father and marries him. As this is happening Austria votes to be assumed by Germany on the eve of World war II.::John Vogel <jlvogel@comcast.net>",
        "A woman leaves an Austrian convent to become a governess to the children of a Naval officer widower.::Murray Chapman <muzzle@imdb.com>"
    ],
    "language": {
        "id": [
            "English",
            "German"
        ],
        "adult_language_percentage": 0.501637288371769,
        "linguistic_difficulty_percentage": 0.034835922803595064,
        "words_per_minute": 83,
        "common_words": {
            "oh": 114,
            "maria": 92,
            "child": 77,
            "know": 74,
            "good": 70,
            "yes": 69,
            "well": 68,
            "like": 55,
            "father": 52,
            "captain": 50
        }
    }
}