{
    "title": "The Matrix Revolutions",
    "year": 2003,
    "genres": [
        "Action",
        "Sci-Fi"
    ],
    "runtime": [
        "129"
    ],
    "rating": 6.7,
    "plot": [
        "Neo discovers that somehow he is able to use his powers in the real world too and that his mind can be freed from his body, as a result of which he finds himself trapped on a train station between the Matrix and the Real World. Meanwhile, Zion is preparing for the oncoming war with the machines with very little chances of survival. Neo's associates set out to free him from The Merovingian since it's believed that he is the One who will end the war between humans and the machines. What they do not know is that there is a threat from a third party, someone who has plans to destroy both the worlds.::Soumitra",
        "It is a dark time for the world in this final adventure. the epic war between man and machine reaches a thundering crescendo: the Zion military, aided by courageous civilian volunteers like Zee and the Kid, desperately battles to hold back the Sentinel invasion as the Machine army bores into their stronghold. Facing total annihilation, the citizens of the last bastion of humanity fight not only for their own lives, but for the future of mankind itself.::Anthony Pereyra {hypersonic91@yahoo.com}",
        "The machine army continues to drill towards Zion. Within hours, they will overrun the population of the Zionites and lay extinction to human kind. Meanwhile, Neo is held captive by the Merovingian at the train station. Trinity & Morpheus set out on a journey to release him from a mysterious train operator. Also, Smith resumes his quest to kill \"Mr. Anderson\" as he reveals his identity into the real world and resumes to replicate his program inside the system of The Matrix, causing it to decay. All hope is placed in the freed Neo, who must travel to the city of the machines in the Logos ship with Trinity and bargain to save each kingdom from destruction by finishing Smith once and for all. But even with his new powers over the sentinels, will he be able to fight them off?::keyser_soze-2",
        "It is a dark time for the world. Neo is trapped in the \"Train Station\", between the Matrix and the Source. Zion is doomed to be crushed under an unstoppable army of countless Sentinels. But it is not only the human race that is in peril. The machines press ever onward against the humans, unaware that one force within the Matrix has slowly been growing, and has taken over that world completely: Smith. There is only one hope for both races, the one force that can stop Smith, and that is Neo. One final battle must ensue. And the outcome of this battle will decide the fate and future of both races.::Maxamillian King",
        "As Neo somehow becomes trapped in a train station between The Matrix and the real world, Morpheus, Trinity, and Seraph set out to rescue him by means of the Merovingian. As this is going on, the Machines are approaching Zion with the intent of laying waste to every human there, but they do not realize that something is taking over The Matrix, with the intent of destroying everything: Smith. After Neo is freed, he and Trinity take the Logos and make a beeline for the Machine City. The Machines have reached Zion and the battle of a lifetime rages on. However, there is one way to save Zion and put an end to the war, and that is Neo. He must venture into the Matrix and put an end to Smith's evil plans once and for all, and if he succeeds, Zion will live to see another day. It's like the Oracle says, \"Everything that has a beginning has an end.\"::Roguemaster83",
        "The human city of Zion defends itself against the massive invasion of the machines as Neo fights to end the war at another front while also opposing the rogue Agent Smith.::Kenneth Chisholm"
    ],
    "language": {
        "id": [
            "English",
            "French"
        ],
        "adult_language_percentage": 1.5129041827350933,
        "linguistic_difficulty_percentage": 0.08899436369029962,
        "words_per_minute": 52,
        "common_words": {
            "know": 66,
            "see": 38,
            "one": 33,
            "go": 32,
            "sir": 31,
            "time": 31,
            "want": 31,
            "get": 27,
            "say": 26,
            "wa": 26
        }
    }
}