{
    "title": "There Will Be Blood",
    "year": 2007,
    "genres": [
        "Drama"
    ],
    "runtime": [
        "158"
    ],
    "rating": 8.1,
    "plot": [
        "The intersecting life stories of Daniel Plainview and Eli Sunday in early twentieth century California presents miner-turned-oilman Daniel Plainview, a driven man who will do whatever it takes to achieve his goals. He works hard but also takes advantage of those around him at their expense if need be. His business partner/son (H.W.) is, in reality, an \"acquired\" child whose true biological single-parent father (working on one of Daniel's rigs) died in a workplace accident. Daniel is deeply protective of H.W. if only for what H.W. brings to the partnership. Eli Sunday is one in a pair of twins whose family farm Daniel purchases for the major oil deposit located on it. Eli, a local preacher and a self-proclaimed faith healer, wants the money from the sale of the property to finance his own church. The lives of the two competitive men often clash as Daniel pumps oil off the property and tries to acquire all the surrounding land at bargain prices to be able to build a pipeline to the coast, and as Eli tries to build his own religious empire.::Huggo / edited by statmanjeff",
        "The film follows the rise to power of Daniel Plainview - a charismatic and ruthless oil prospector, driven to succeed by his intense hatred of others and desperate need to see any and all competitors fail. When he learns of oil-rich land in California that can be bought cheaply, he moves his operation there and begins manipulating and exploiting the local landowners into selling him their property. Using his young adopted son H.W. to project the image of a caring family man, Plainview gains the cooperation of almost all the locals with lofty promises to build schools and cultivate the land to make their community flourish. Over time, Plainview's gradual accumulation of wealth and power causes his true self to surface, and he begins to slowly alienate himself from everyone in his life.::Denny Gibbons",
        "Daniel Plainview is an oil man and spends his days harvesting the money from discovered oil. When Paul Sunday asks Plainview to dig for the oil at his family home, he finds it too hard to resist. Soon, he is up in Little Boston, California. Not everyone is pleased to see him as tension builds between Daniel and preacher, Eli Sunday as well as the greed.::FilmFanUk",
        "In the early years of the 20th century, Daniel Plainview is an oil prospector. Based on information sold to him by Paul Sunday, he travels to Little Boston, California and begins to buy land, starting with the Sunday's farm. Wanting to buy up all of the land in the area, he smooth-talks the locals into selling by promising to build roads, schools and churches. He has no intention of doing so, of course. His only purpose is to make money. Over the course of his endeavors, men die, the locals get nothing, and Plainview gets rich. In his life he makes few friends and many enemies and even his adopted son H.W. is eventually alienated.::garykmcd",
        "A story of family, religion, hatred, oil and madness, focusing on a turn-of-the-century prospector in the early days of the business.::Anonymous and Brian McInnis"
    ],
    "language": {
        "id": [
            "English",
            "American Sign Language"
        ],
        "adult_language_percentage": 1.053811659192825,
        "linguistic_difficulty_percentage": 0.04484304932735426,
        "words_per_minute": 28,
        "common_words": {
            "well": 32,
            "get": 28,
            "right": 26,
            "know": 22,
            "thank": 22,
            "oil": 20,
            "like": 19,
            "go": 18,
            "good": 18,
            "come": 17
        }
    }
}