{
    "title": "Trainspotting",
    "year": 1996,
    "genres": [
        "Drama"
    ],
    "runtime": [
        "94"
    ],
    "rating": 8.2,
    "plot": [
        "A wild, freeform, Rabelaisian trip through the darkest recesses of Edinburgh low-life, focusing on Mark Renton and his attempt to give up his heroin habit, and how the latter affects his relationship with family and friends: Sean Connery wannabe Sick Boy, dimbulb Spud, psycho Begbie, 14-year-old girlfriend Diane, and clean-cut athlete Tommy, who's never touched drugs but can't help being curious about them...::Michael Brooke <michael@everyman.demon.co.uk>",
        "Renton is an Edinburgh lad with a heroin addiction problem. His best mates are: somewhat dimwitted but good-hearted Spud, also a heroin addict; con man Sick Boy, also a heroin addict who has steadfast opinions on the most renowned British actors; and Tommy, a clean cut athlete who doesn't use. The likelihood of Renton, Spud and/or Sick Boy leading Tommy astray are higher than the other way around as problems in Tommy's life resulting in him wanting to use are more likely than any of Renton, Spud or Sick Boy having a reason to follow Tommy's clean example. Renton, Spud and Sick Boy often use with Allison, the mother of an infant, they, including baby Dawn, congregating in Swanney's drug den. They also need to steal and rob to support their habit, those activities often with the assistance of their criminal acquaintance Begbie, whose violent tendencies can be ignited on the slightest provocation. Despite Renton, Spud and Sick Boy believing there is no better feeling than being high, Renton truly does want to quit using, or so he tells himself. The struggles Renton have in trying to get clean are presented. He may feel that other priorities in his life may help him, such as the love at first sight feelings he has for Diane, who he sees across a nightclub room but who may not be all she appears at first glance. Renton probably realizes that he can never get clean in his current environment, which includes hanging around with Spud, Sick Boy, Begbie, Allison and Swanney, but getting out from their influence may not be as easy as just physically leaving.::Huggo",
        "Renton, deeply immersed in the Edinburgh drug scene, tries to clean up and get out, despite the allure of the drugs and influence of friends.::Jon Reeves <jreeves@imdb.com>"
    ],
    "language": {
        "id": [
            "English"
        ],
        "adult_language_percentage": 4.293770827992822,
        "linguistic_difficulty_percentage": 0.05126890540886952,
        "words_per_minute": 83,
        "common_words": {
            "fucking": 87,
            "wa": 81,
            "boy": 60,
            "get": 46,
            "like": 45,
            "got": 39,
            "oh": 36,
            "fuck": 34,
            "one": 34,
            "going": 34
        }
    }
}