{
    "title": "Wings of Desire",
    "year": 1987,
    "genres": [
        "Drama",
        "Fantasy",
        "Romance"
    ],
    "runtime": [
        "128"
    ],
    "rating": 8.1,
    "plot": [
        "Visible only to those like them and to human children, Damiel and Cassiel are two angels, who have existed even before humankind. Along with several other angels, they currently wander around West Berlin, generally on their own, observing and preserving life, sometimes trying to provide comfort to the troubled, although those efforts are not always successful. Among those they are currently observing are: the cast and crew of a movie - a detective story set in WWII Nazi Germany - which include a sensitive and perceptive Peter Falk; an elderly man named Homer looking for eternal peace; and the troupe of a financially failing circus, which has closed early for the season because of those financial problems. One day, Damiel tells Cassiel that he wants to become human, to feel not only the sensory aspects of physical beings, but also emotional aspects. He embarks on this thought with the full realization that there is no turning back if he decides to do so. His thoughts are largely because he has fallen in love with Marion, the trapeze artist with the circus. If he does decide to become a human, there is no guarantee that as a human that he will be able to locate Marion or that she will return his affection. His angels, however, may be looking out for him.::Huggo",
        "Two angels, Damiel and Cassiel, observe life on Earth and the human condition. They've been doing this for a very long time and have seen both the best and the worse of mankind. Damiel wants nothing more that to be human - to feel, to touch, to smell, to have emotions. When his wish is granted he also learns that being human has its limitations that are in many ways no different than being immortal.::garykmcd",
        "This Wim Wenders film centers around the story of two angels wandering in a mixture of post-war and modern Berlin. Invisible to humans, they nevertheless give their help and comfort to all the lonely and depressed souls they meet. Finally, after many centuries, one of the angels becomes unhappy with his immortal state and wishes to become human in order to experience the joys of everyday life. He meets a circus acrobat and finds in her the fufillment of all his mortal desires. He also discovers that he is not alone in making this cross over, and that a purely spiritual experience is not enough to satisfy anyone.::Nell Rehn <NRehn@aol.com>",
        "An angel tires of overseeing human activity and wishes to become human when he falls in love with a mortal.::Ed Sutton <esutton@nortel.ca>"
    ],
    "language": {
        "id": [
            "German",
            "English",
            "French",
            "Turkish",
            "Hebrew",
            "Spanish",
            "Japanese"
        ],
        "adult_language_percentage": 0.9114583333333334,
        "linguistic_difficulty_percentage": 0.11160714285714285,
        "words_per_minute": 42,
        "common_words": {
            "wa": 56,
            "one": 39,
            "child": 34,
            "like": 31,
            "time": 30,
            "still": 24,
            "look": 20,
            "last": 20,
            "know": 16,
            "day": 16
        }
    }
}